[{"post_id": 0, "title": "“Where do you find yourself in 5 years”", "score": 1, "total_comments": 2, "url": "https://www.reddit.com/r/jobs/comments/1mw30yy/", "content": "Do I be honest if I need to answer this question during a job interview? I’ve heard tons of people saying that the “correct” response is to say something along the lines of “I see myself in this company doing blah blah,” but as a pre-vet student who is trying to get into vet school in like 2 years that answer seems very off-putting (?). Tips? ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Just always be honest. Hiring managers can see right through the manufactured responses that seem so popular. As a hiring manager, I’m always looking for authenticity, not a particular right answer."}]}, {"post_id": 1, "title": "Extremely Toxic Workplace (Rant)", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/jobs/comments/1mw2xi6/", "content": "Hello everyone, just a bit of a rant here.\n\nI started a new job about three months ago at a mid-sized company, and while the role itself is fine, the culture is incredibly toxic. The COO (who happens to be related to the CEO) constantly talks badly about me and my coworker behind our backs. Training was basically nonexistent - I had to learn from that same coworker, who had only started a month before me and barely knew the role themselves. \n\nWhat’s frustrating is that no matter how much I do, the COO nitpicks and makes it seem like I’m not pulling my weight. He always seems to be looking for something to criticize and be mad about. I can spend an entire day handling tasks, but if my manager steps in to do one small thing for me, suddenly it looks like I did nothing. I even overheard the COO telling my manager that I’m “fucking useless” and that me and my coworker don't know what we're doing. The CEO is just as insufferable according my manager. Thankfully, my manager is supportive and", "top_comments": []}, {"post_id": 2, "title": "Ingles markets", "score": 0, "total_comments": 0, "url": "https://www.reddit.com/r/jobs/comments/1mw2w8j/", "content": "Earlier today before my shift I told the customer how are you on this lovely day?and she said in a snippy voice good and I mashed her grapes and I said have a blessed day in a kind mood and she said thank you in a snippy mood,should me and her have a fight in the parking lot at my job?", "top_comments": []}, {"post_id": 3, "title": "Are AI Headshots the Secret Cheat Code for Job Hunting… or Just a Red Flag? My Honest Results.", "score": 3, "total_comments": 1, "url": "https://www.reddit.com/r/jobs/comments/1mw2tiu/", "content": "Okay, gotta get this off my chest: I finally gave in and tried an AI headshot for my LinkedIn, because my old selfies looked straight-up tragic. Ended up using Headshot Kiwi after seeing a bunch of recommendations here and on X.\n\nHere’s the crazy part:\nLiterally the week I switched my photo, I started getting way more recruiter messages. Like, actual real people—not just bots or spam. I’m not saying it’s magic, but the timing is kinda wild.\n\nBut here’s where it gets tricky…\nA friend told me, “Recruiters can totally spot AI headshots now. It looks fake, it’s a turnoff, don’t do it.”\nMeanwhile, another friend says, “Dude, everyone is using these now. If you don’t, you look outdated.”\n\nSo now I’m just confused.\n\nAre AI headshots actually working, or will they start backfiring as more people catch on?\n\nDo you think recruiters really care if it’s AI, as long as you look professional?\n\nAnyone here using Headshot Kiwi or another tool and notice a difference (good or bad)?\n\nI’ll be honest: I l", "top_comments": []}, {"post_id": 4, "title": "Excited/love being a Brand Ambassador", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/jobs/comments/1mw2o10/", "content": "I love being a Brand Ambassador so far for a laundry company passing out flyers and promoting the company! It’s really fun and it gets me $25/hr (although it’s only for three hours a day)! \n\nI can’t wait to become another Demo Lead/Brand Ambassador for another supplement company and pass out samples/interact with people! I’m glad that this website that got recommended to me called Home from College gave me this opportunity!", "top_comments": []}, {"post_id": 5, "title": "Was this Legal?", "score": 0, "total_comments": 0, "url": "https://www.reddit.com/r/jobs/comments/1mw2f1r/", "content": "I was working for a company in one state for about a year, when I finally decided I was going to move to a different state for personal/health related reasons back in March.\n\nAfter a back and forth and them making me get a reference from my psychiatrist, they dragged their feet and approved me to go remote. I could tell I had irritated them.\n\nAt the end of April, I sent a message to HR letting them know that I was turning 26 in May and would need to go on health insurance. They acted super weird about it and again, after some back and forth and dragging their feet, they allowed me to enroll in insurance that would activate in July, since they were making me wait the full month of my birthday before activating the insurance.\n\nWell at the very end of May, they gave me a random video call in the middle of the work day and fired me (technically laid me off). They said I would get 2 weeks of severance pay but my employment was ending immediately. Shut down my laptop, and mailed me packing s", "top_comments": []}, {"post_id": 6, "title": "Pre-employment Screening for Fastenal", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/jobs/comments/1mw2ad5/", "content": "Hey guys I just got offered a job at Fastenal and am really excited. Do you know if they test for THC? \n\nI don’t drink or do any hard drugs, I just like to smoke (on weekends) and drink caffeine (at work and on weekdays). \n\nAll the answers I’ve been able to find that say that Fastenal’s pre-employment screening doesn’t test for THC are from two years ago. The more recent answers seem inconclusive and I just wanna confirm nothing has changed. Super eager to get back into the workforce and work here and don’t want to lose the opportunity just because I like to relax every once in a while. \n\nFor reference, my state is a legal state. It is not California. ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "🙏🏼"}]}, {"post_id": 7, "title": "Sad Relatable Humor", "score": 3, "total_comments": 0, "url": "https://www.reddit.com/r/jobs/comments/1mw1vya/", "content": "No text", "top_comments": []}, {"post_id": 8, "title": "how long is too short…", "score": 3, "total_comments": 1, "url": "https://www.reddit.com/r/jobs/comments/1mw1dni/", "content": "i work in a fast casual restaurant. i’m a manager, but our agm and gm are toxic and unreliable. some people are saying i shouldn’t give any notice at all but i want to give SOME kind of notice, but i also don’t really want to work a whole 2 weeks there with bosses i hate. is a week notice or even a 10 day notice acceptable in this case? i do fear their initial reaction, but idrc about burning the bridge tbh.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "there is no legal obligation to give notice. Literally, do whatever you think is best. Even if you do give notice they don't have to honor it and might fire you that day"}]}, {"post_id": 9, "title": "moving to Ho Chi Minh City for working", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/jobs/comments/1mw1cj2/", "content": "Hi Im Japanese and just got an offer for relocating to Vietnam for working, they would support the home and visa things. Any advice whether I should accept it or not? \n\nFor those who already move to Vietnam, what's your opinion? Did you regret it?", "top_comments": []}, {"post_id": 10, "title": "Is it realistic to get a full time employment after a work trial?", "score": 2, "total_comments": 1, "url": "https://www.reddit.com/r/recruitinghell/comments/1mw2n8y/", "content": "I recently interviewed with a company and they responded with \"lets have you work on one of our actual projects for a month (paid) as a assessment\". Seeing that this is the closest I ever got to getting a job, I accepted and its been roughly a week, and there's a few things that are a concern for me:\n\n1. The contract says I get paid by the task, not by time so would that usually mean I get cut off and receive a lower payment if I don't finish all the tasks or do they make me stay until I get all of it done?\n2. What are the chances that this job is just a way for them to get cheap labor off, as in they weren't planning to hire me from the start?\n3. I agreed to a very low payment assuming that if I get the job as full time, I will be getting a proper payment from then on (i was more worried that they'll just refuse to give me the opportunity period if I try to negotiate the payment). was I too naive?\n\nThe job is fun and all but I'm wondering what are the chances that I will actually get ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*"}]}, {"post_id": 11, "title": "12:45 in the fucking morning!", "score": 4, "total_comments": 2, "url": "https://www.reddit.com/r/recruitinghell/comments/1mw2mnt/", "content": "What the double blue fuck?!.  This is why I despise so-called video interviews with canned videos.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "I added my name to the Workday lawsuit and I hope that company goes up in flames."}]}, {"post_id": 12, "title": "Tips and advice", "score": 3, "total_comments": 1, "url": "https://www.reddit.com/r/recruitinghell/comments/1mw21l4/", "content": "What tips and advice would you give someone who’s looking for jobs, from applications to interviews? What has helped you, and what’s a golden nugget you’d pass on to someone else who’s also in need?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*"}]}, {"post_id": 13, "title": "How representative are those bad recruiters/employees?", "score": 2, "total_comments": 2, "url": "https://www.reddit.com/r/recruitinghell/comments/1mw19qb/", "content": "Hi! I wonder:\n\nThere are many stories about bad recruiters/employees - which share (weighted) do they actually comprise? Are there regularities, like by years of experience?\n\n(If this behavior is widespread, why not much successful resistance?)\n\nLooking for personal experiences, preferably for ones with diverse jobs.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*"}]}, {"post_id": 14, "title": "[Interview Experience] Cencora panel interview – unprofessional, felt like hazing", "score": 2, "total_comments": 1, "url": "https://www.reddit.com/r/recruitinghell/comments/1mw0j3e/", "content": "I was told this would be a technical interview with 3 members. One of the panelists in particular was very difficult to follow. Their questions weren’t clear, and when I politely asked for clarification, the panelist responded in a way that felt rude and condescending. Instead of making it a constructive discussion, it felt more like they were trying to intimidate me by grilling me. I did not expect this.\n\nI know I shouldn’t have let it get to me, but I lost my focus as a result.\n\nOverall, the dynamic came across less like a professional interview and more like hazing. I’ve been through tough interviews before, but there’s a clear difference between being challenged and being belittled.\n\nThis experience left me questioning whether Cencora actually values respect and collaboration in their culture.\n\nHas anyone else gone through something similar with them?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*"}]}, {"post_id": 15, "title": "Trying something.... since there are so many people here who are looking for work dilligently.", "score": 0, "total_comments": 3, "url": "https://www.reddit.com/r/recruitinghell/comments/1mw0em4/", "content": "I see people all day complaining about fake jobs, difficulties finding work, unfounded qualifications, etc... so I thought, let's do this transparently.   I am open to answering any questions here in the sub, and I am willing to provide open feedback on CV/Resume if you desire.  ***While I am anonymous on here by username, I am a real hiring manager, and this is a very real position.***  \n\nI am currently looking to hire a specialized role in the Portland OR area. Specialized, because I would like the hire to be bilingual. \n\nIf there is anyone in that area, I'll throw it out there, and you can either post your resume publicly here for feedback, or DM me, but I will be MOSTLY transparent here.  ***I will not reveal the company publicly.*** \n\nTitle is **Systems Administrator**\n\n**Responsibilities**\n\n* Provide escalation support for multiple clients across the organization\n* Administer and maintain Windows Server, Active Directory, and Azure environments\n* Monitor system performance and re", "top_comments": [{"comment_number": 1, "score": 1, "comment": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": ">***I am a real hiring manager***\n\nBig deal, my dad works for Nintendo."}]}, {"post_id": 16, "title": "are fresh grads expected to have the knowledge of a full timer now?", "score": 3, "total_comments": 2, "url": "https://www.reddit.com/r/recruitinghell/comments/1mw02h7/", "content": "Went for a physical interview today for a data analyst role. Prepped well with industry knowledge, but they asked me questions super specific to terms that only someone working for years in that role would know and criticised my case study submission\n\nI have done internships (all different industries) the past 2 years, but they took it as the equivalent of a full timer working 2 years in the same role. Interns don’t even get the full picture of things with a lot of limitations, especially when interns typically only work for 6 months each stint. 💀\n\nasked me “are you gonna go home now?” on the way to the door. what do you think im gonna do…after that roasting session?? just feeling poop now", "top_comments": [{"comment_number": 1, "score": 1, "comment": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "The company that you ran into is one that wants mid-level experience but pay entry level pay. The market for data analysts is oversaturated especially for entry level. It’s not you, you are exactly where you are expected to be at, it’s the companies and the job market. You will get full time offer. Keep your head up and continue to work on your skills, learn new skills. Invest in yourself by working on projects while looking for full time work. \n\nAlso a little out of the box, since the job market is crazy in general. If you have a car, or bike maybe sign up to be an Uber/eats driver to make income on the side while you are searching for full time employment. Or if you know anyone that does Uber maybe they will share their driver data. When enough data is gathered, use the driver data to do all sorts of data analysis to increase your profits, predict profits, identify trends etc., and use a software for visualization. \n\nOr think of any other out of the box project while you are in your job search."}]}, {"post_id": 17, "title": "career obstruction?", "score": 3, "total_comments": 3, "url": "https://www.reddit.com/r/recruitinghell/comments/1mvzmbz/", "content": "hey peeps, hope your job search is successful.\n\nI'm wondering if some company recruiters or anybody of insight can reach out and answer a pretty bizrree question to a pretty bizarre situation I've been in.\n\nso like all of you, I've put in somewhere in the vicinity of probably 150+ jobs recently and was offered a position at a crisis center where a distant relative of mine works part-time and put in a good referral. met the director, super cool dude, very lax,\n\nvery likable and down to Earth pretty much guaranteed me the job but had to get approval from his higher up, said give it a few days and he'd call back. he didn't so today I called him and his demeanor was super strange and offputting if not outright short, shady and rude to be honest, which kinda made me baffled.\n\nhis response was \"we've decided to go in a different direction\" in a very condescending manner to which I said \"but you said last week that your hiring a handful of new positions, most of which are part time and that I", "top_comments": [{"comment_number": 1, "score": 1, "comment": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "Sorry this is happening to you, OP. I'm just a stranger on the internet, but it looks to me like this situation is really affecting your life in a very negative manner. If you have people in your life you can confide in or reach out to, either for help or just to vent, I'd suggest you do so. Maybe one of them could point you to a helpful direction; maybe one where you could get answers. Personally, I don't have any answers for you; I'm in a pretty bad state myself. But I sincerely hope things start looking up for you soon and that you can find the support you need and hopefully you can overcome the bad situation you find yourself in. Sending you my solidarity."}]}, {"post_id": 18, "title": "Urgent Confirmation", "score": 1, "total_comments": 9, "url": "https://www.reddit.com/r/recruitinghell/comments/1mvyvx5/", "content": "Sterling background check has asked me for T4, paystubs, experience letter, offer letter, and contract letter.\nI worked as an independent contractor, so I don’t have T4s or paystubs.\nIf I only provide my contract letter and the contact details of my company’s HR, will that be enough?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "Try a W2 or tax return "}, {"comment_number": 3, "score": 1, "comment": "Photoshop"}]}, {"post_id": 19, "title": "Where are these jobs?", "score": 5, "total_comments": 5, "url": "https://www.reddit.com/r/recruitinghell/comments/1mvylr8/", "content": "Hey everybody ,just curious where everyone is finding these jobs...are y'all applying to janitor jobs? McDonald's? \n\nI'm reading constantly about people applying for hundreds of jobs. I've found maybe 20 around me for a Mechanical Engineer, I've applied and been rejected from all. I've been applying to remote jobs, but holy heck those get weirdly specific. ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "The discord for our subreddit can be found here: https://discord.gg/JjNdBkVGc6 - feel free to join us for a more realtime level of discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruitinghell) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 5, "comment": "I'm finding them across the country, globally, and without prejudice for less experienced positions. Being too picky feels like a death sentence currently. "}, {"comment_number": 3, "score": 3, "comment": "You might need to be willing to relocate if you are looking for mechanical engineering jobs specifically."}]}, {"post_id": 20, "title": "Looking For IT Project Manager Job In Dubai \\ Abu Dhabi , With 10 Plus years Experience .", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/getemployed/comments/1mw2vue/", "content": "Looking For Recommendations \\ References . \n\nHi We are From India And We are Planning To Move Out From Country Seeking Opportunities . My wife has an Experience of 10 + years in IT as a whole and Managing Projects from last 3-4 years in india ( Holds a B Tech Degree In Computer Science Engineering) . She Currently Manages a team of 5-6 People . She is at the Designation Of Project / Incident Manager ( company’s name is Boltech , Malasiya based Tech Giant ) . We want to ask that How can she land a Decent job in here , And  how much could she possibly get \\ annually . She is Actively Seeking Opportunities On LinkedIn . Can anyone help her securing a decent opportunity here ?\n\nThanks In Advance ", "top_comments": []}, {"post_id": 21, "title": "What Next?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/getemployed/comments/1mw1gpi/", "content": "I recently applied for an IT Technician role and had three interviews. First with the recruiter, then the Director and last, the Regional manager I would be reporting directly to. I think all interviews went well and I wrote a nice followup email after the interviews were through. The last interview I had was last Friday. I haven't gotten a rejection letter, but I also haven't gotten feedback yet. What do I do at this point since it's almost been a week since I last spoke to anyone? I was told by the regional manager I would hear back from the recruiter with their decision. Should I wait longer for the answer or aggressively get it?\n\nThis is my only interview in 2 years since the last one and hundreds of applications.", "top_comments": []}, {"post_id": 22, "title": "Seeking Advice: Career Paths Beyond Client-Facing Roles for Someone with Series 7 & 66", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/getemployed/comments/1mw0sc6/", "content": "Hi everyone,\n\nI’m a 27-year-old Investment Advisor Representative currently making around $60,000 per year. I hold my Series 7 and 66 licenses. I’m exploring career options that allow me to leverage my current experience in finance but move away from client-facing roles or sales positions.\n\nI’m particularly interested in roles that could potentially offer higher compensation while allowing me to work more behind the scenes, without regularly interacting with clients over the phone or in person.\n\nHas anyone here made a similar transition? What types of roles should I be looking into, and are there specific industries or positions where my licenses and experience could give me an advantage?\n\nAny guidance or suggestions would be greatly appreciated.\n\nThanks in advance!\n", "top_comments": []}, {"post_id": 23, "title": "Considering a Career Switch from Financial Advisor to Tech — Advice?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/getemployed/comments/1mw0rn7/", "content": "Hi everyone,\n\nI’m currently working as a Financial Advisor Representative and thinking about transitioning into the tech industry. I’ve never worked in tech before, but I’m exploring options and wondering what might be realistic career paths given my background.\n\nI’ve been considering software engineering, but I’m not sure if that’s a practical goal given I don’t have prior experience. Are there other tech roles that might be more suitable for someone with my skill set—licenses, financial knowledge, analytical skills—but without a formal tech background?\n\nI’d love to hear from people who have made similar transitions or have insight into entry points into tech.\n\nThanks for any guidance or suggestions!", "top_comments": []}, {"post_id": 24, "title": "Background check after phone screen but before main interview?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/getemployed/comments/1mvvc7u/", "content": "Hello all,\n\nI've been pursuing a job opportunity for about two weeks now. I had passed the phone screen and was told to wait for an email for next steps. After about a week, I thought it was dead in the water but randomly got an email from them the other day to fill out info for a background check. Here's the thing, I actually haven't interviewed with anyone yet (aside from the phone screen). Is this normal? I've had numerous interviews and they never did a background check prior. Maybe a good sign? I'm not getting my hopes up obvi (considering the state of the job market) but curious to hear what you guys think. ", "top_comments": []}, {"post_id": 25, "title": "How to omit experience without lying", "score": 3, "total_comments": 5, "url": "https://www.reddit.com/r/getemployed/comments/1mvv9e0/", "content": "So it goes, I need a job in retail/fast food to save up a little. However I’m a STEM professional with extensive experience, and they won’t hire me because of it.\n", "top_comments": [{"comment_number": 1, "score": 2, "comment": "Have you considered working for a job agency?"}, {"comment_number": 2, "score": 2, "comment": "You could just not include it as long as you can bridge it. You weren't working in stem during those months because you were deciding a career path, continuing learning, etc"}, {"comment_number": 3, "score": 1, "comment": "Just curate resumes for each job. Leave out irrelevant experience"}]}, {"post_id": 26, "title": "Edd employment program rep interview", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/getemployed/comments/1mvutej/", "content": "Anyone who got hired remember what questions were asked?", "top_comments": []}, {"post_id": 27, "title": "Should I wait for the job offer?", "score": 1, "total_comments": 2, "url": "https://www.reddit.com/r/getemployed/comments/1mvub33/", "content": "I have been interviewing for multiple roles for the past 1 year and finally got an offer for a profile i wanted. The company was gracious enough to wait for 3 months long notice period (yes that long). Joining date is in 2 days now. However, I got a verbal offer for a profile at another company I absolutely would love to do but have not gotten a chance to do before.  I want to join this company if possible but the HR has not given a written offer yet which they say is due to a technical glitch. After i get the written offer they will still give a joining date which is 2 weeks after the offer acceptance date. Earlier they said they wanted someone who can join as soon as possible but are now delaying on their end.\n\nI dont have the time to wait for the written offer from second company and would have to inform the first company asap since joining date is in 2 days.\n\nI want to understand- \n1. Can the company blacklist me for pulling out at the last moment?\n2. Can the second company pull ou", "top_comments": [{"comment_number": 1, "score": 3, "comment": "1. Companies can get annoyed, but blacklisting is rare unless it's a tight-knit industry. 2. Verbal offers are risky, without a written offer, there's no guarantee. If you want the second job, push for that written offer ASAP, but be ready to commit to the first if it doesn't come through."}]}, {"post_id": 28, "title": "What jobs could i potentially get while studying for my BBA?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/getemployed/comments/1mvu6vp/", "content": "I start classes Sept 2nd as was wondering what jobs i could potentially look into as i study and work towards my degree.\n\nI do have an associate degree in health information management, but i’m not sure if health care is what i really want to be in after having some experience in it. \n\nI am a 20 year old male\n\nThank you ", "top_comments": []}, {"post_id": 29, "title": "thinking about quitting my job job", "score": 2, "total_comments": 0, "url": "https://www.reddit.com/r/getemployed/comments/1mvtmic/", "content": "just wanted to ask some question but a little back story. I came back from vacation not so long ago and wanted to start working then I found usps mail handler but the times they wanted me to work didn't really fit then now I'm soon going to work at the airport and the times are a little better but the parking is a little bit of an issue. I feel like I'm jumping from job to job just to find something that really fits me? what should I do ", "top_comments": []}, {"post_id": 30, "title": "Why is there only a Follow button AND there's no \"Connect\" option under the More button/menu?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/LinkedIn/comments/1mw2tmx/", "content": "It's easy to find explainers about why the Connect button has been replaced by Follow on certain profiles. However, the info I've seen talks about how you can still send a connection request by going into the More menu.\n\nI can't find anywhere that explains the second part: how is it possible that this option to connect does not exist under the More button/menu? I click More, I see only 4 options. The Message \\[name of person\\] option also does not exist.\n\nI found this explainer from LI, which is absurd:\n\n>You won’t see the Connect button on a member’s profile if:\n\n>\\[removed some stuff\\]\n\n>\\* You're out of network.\n\nWtf does that last bullet even mean?? You're \"out of network\"?? Wut?\n\nAnyway, bottom line: what did the person behind such a profile set up to disable connect requests and even messaging?", "top_comments": []}, {"post_id": 31, "title": "Creative LinkedIn Banner Feedback", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/LinkedIn/comments/1mw1810/", "content": "I've just designed a really cool banner for my own personal linked in page.  \nWould love your feedback on my new LinkedIn Banner.\n\n[https://www.linkedin.com/in/dollarakshay/](https://www.linkedin.com/in/dollarakshay/)\n\n", "top_comments": []}, {"post_id": 32, "title": "\"Connect\" button stopped being my default option & I can't fix it?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/LinkedIn/comments/1mvvri5/", "content": "I successfully followed the instructions to make the \"Connect\" button the default option on my profile (going to settings > visibility > followers > make follow primary > turn off).\n\nIt worked for a while. However, recently I noticed the \"Connect\" button is no longer the default option, \"Follow\" is. I checked and make follow primary was still toggled off. \n\nI tried different browsers, turning on and then off again the make follow primary setting - nothing has worked. \n\nHelp please! Thanks so much.\n\n\n\n\n\n\n\n  \n", "top_comments": []}, {"post_id": 33, "title": "Looking For IT Project Manager Job In Dubai \\ Abu Dhabi With 10 Plus Years Of Experience . Please suggest something.", "score": 0, "total_comments": 0, "url": "https://www.reddit.com/r/LinkedIn/comments/1mvu2uc/", "content": "Hi We are From India . My wife has an experience of 10 + years in IT as a whole and managing projects from last 3-4 years in india . She is at the Designation Of Project / Incident Manager ( company’s name is boltech , Malasiya based Tech Giant ) . We want to ask that How can she land a job in dubai \\ Abu Dhabi , And  how much could she possibly get \\ annually . She is Actively Seeking Opportunities On LinkedIn . Can anyone help her securing a decent opportunity in Dubai \\ Abudhabi ?", "top_comments": []}, {"post_id": 34, "title": "I can’t add a link to my profile?", "score": 1, "total_comments": 2, "url": "https://www.reddit.com/r/LinkedIn/comments/1mvt8m9/", "content": "I see many people with their portfolio link in their profile and i want to do the same, but after searching for like the past hour i cant find the same buttons to do it? How the heck do i do this", "top_comments": [{"comment_number": 1, "score": 1, "comment": "I think it's business premium only now for $45/mo. I was wondering the same. What is the best way to drive traffic? Can we put links in posts?"}]}, {"post_id": 35, "title": "Dads profile keeps getting deleted", "score": 2, "total_comments": 4, "url": "https://www.reddit.com/r/LinkedIn/comments/1mvsmie/", "content": "My dad is every boomer stereotype with technology and has made 7 accounts. His original one is from well over a decade ago, and he doesn’t know how to log in to it. He did the verification processes submission with a photo ID, but they denied it. \n\nSo, he created a new one. It flagged him and required him to do the identity verification process, so he did it. They denied it and deleted the account. He has changed his email, name, photo, and number, but they all get flagged and make him verify his identity then deny his appeal. \n\nHe is trying to switch jobs after working for the same company for over a decade, employers now require you add your LinkedIn profile. LinkedIn doesn’t have a number you can call. He’s been driving me crazy, any advice would be welcomed.", "top_comments": [{"comment_number": 1, "score": 2, "comment": "Creating additional accounts is the pattern of behavior spammers use, so LinkedIn’s system for catching them is catching your dad too. A decade ago, many social platforms didn’t worry about authenticity so much and allowed people to create multiple accounts, but that’s not possible with many of them now. Their systems are most likely already aware of his name, email address, IP address and device IDs, so any combination of those could trigger immediate deletion. \n\nI’d look for some way to appeal the original denial."}, {"comment_number": 2, "score": 1, "comment": "*\"employers now require you add your LinkedIn profil*e\" \n\nThis is not true. Not everyone has a linkedin profile. And certainly not compelled by any employer to have a LinkedIn profile."}]}, {"post_id": 36, "title": "Am I using LinkedIn wrong or is the platform just oversaturated?", "score": 1, "total_comments": 2, "url": "https://www.reddit.com/r/LinkedIn/comments/1mvqsl2/", "content": "I’m a junior in college and have been seriously job hunting these past 4 months. I got LinkedIn Premium for free, and since I just completed my first internship during the spring, I wanted to keep the momentum going and land another internship/job.\n\nThe issue is… every time I apply to something on LinkedIn it either turns out to be spam, a random recruiter, or some company trying to get me to join their platform. And when I try to connect with people or DM them, it feels like a waste of time because most don’t answer at all.\n\nIs this just how LinkedIn is now—super oversaturated and filled with noise? Or am I just not using it the “right” way?\n\nAlso, are there any other platforms you all actually use to find legit opportunities? I’m already on Handshake, WayUp, and Idealist, but I feel like I’m missing something.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to LinkedIn"}, {"comment_number": 2, "score": 1, "comment": "Linkedin dominates the job search online options.  The others (monster, computerjobs.com, etc)  have closed, are shells of their former selves, or are dominated by third party middleman and/or shady parties.\n\nIndeed is ok, but not any more helpful than LinkedIn.\n\nLinkedin is now owned by Microsoft.   They seem to be focused on being some type of social media platform for corporations.   Marketing types seem to like to shovel their BS there.  \n\nLinkedin is not very helpful or useful. But, at the moment, it is the best game in town.\n\nThe most helpful advice I can offer, use linkedin to find postings, but do NOT apply there.   Instead, try going directly to the company's careers site and apply there.\n\nAlso, many companies have an option for an employee to submit a resume for someone they know. If Coca-Cola is hiring, check if you have ANY connection there... a parents friend, a neighbor, parent of a high school classmate, a teachers spouse, or even a recent grad from your college.  You have a MUCH greater chance of getting a call or an interview if your resume is submitted by an employee."}]}, {"post_id": 37, "title": "Is there a way to upload folders on my profile with previous work for my portfolio?", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/LinkedIn/comments/1mvqnsv/", "content": "What I'm asking is - Can I upload previous work within folders, that connections or viewers could click on and browse, to view my previous work?\n\n  \nOr do I have to upload separate images only, or link to a hosting site that displays everything?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "click on +upload"}]}, {"post_id": 38, "title": "Creating a LinkedIn profile at a age of 24/25. I have 3.1 years of work experience. But I am scared to join there. Also I am joining a masters program next month.", "score": 1, "total_comments": 6, "url": "https://www.reddit.com/r/LinkedIn/comments/1mvq0ov/", "content": "Please guide me, how to do everything. ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Do you have other social media profiles? It’s like that but only post things you’d want a company looking to hire you to see.\n\nConnect with the people you work with now. They may help you find a job when you get out of the grad program."}, {"comment_number": 2, "score": 0, "comment": "Please check your DM"}, {"comment_number": 3, "score": 0, "comment": "[removed]"}]}, {"post_id": 39, "title": "Google Alerts-like functionality?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/LinkedIn/comments/1mvlg5t/", "content": "Hi there. Just looking for a heads up on an idea I've had. \n\nIs there some way to do something like Google Alerts on LinkedIn? Ideally I'd like an email or notification any time any any of my contacts posts something that is on a pre-determined list of keywords.", "top_comments": []}, {"post_id": 40, "title": "[NY] Ballpark cost for individual healthcare admin support", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/AskHR/comments/1mw2xgm/", "content": "I’m trying to figure out a ballpark range of fair wages to hire an individual directly (not via an agency) to help my brother, a professional living in NYC who has a few disabilities, with complex personal healthcare- and accessibility-related admin.\n\nBut I’m unable to find literally ANY data for even vaguely similar roles (e.g. in BLS or O\\*NET, etc.)\n\nWe would NOT require the individual to have healthcare education / experience, though that'd definitely be nice. It'll be a highly detail oriented, complex, and busy arrangement.\n\nTasks might include, for e.g., scheduling appts, taking notes, tracking Rxs, following up on providers’ recs; summarizing medical records, arranging accommodations, managing home care workers, highly-educated-layperson-level online research, personal asst type stuff, etc.\n\nDraft job description [here](https://docs.google.com/document/d/1wTazWq5lIVWIHeQgucrvbzb0YIQoanFRnWfQINnDGDQ/edit?usp=sharing)\n\nQuestions:\n\n* **What range seems fair to you and why?**\n* **If", "top_comments": []}, {"post_id": 41, "title": "[CA] Is it normal for HR to include sarcastic comments in a sick leave approval letter?", "score": 3, "total_comments": 2, "url": "https://www.reddit.com/r/AskHR/comments/1mw2w72/", "content": "Hi everyone,\n\nI’m looking for some advice on a situation I’m dealing with.\n\nI work part-time as an on-site manager while also working at a bank (which is my primary job). When I was hired, management agreed to work around my bank schedule, but recently my manager (let’s call him Mark) tried to change my schedule abruptly without my consent or consultation — even though he knows my primary hours are at the bank.\n\nAnother issue is that when I started this role, I was only given one day of training. I requested additional training because I felt one day was not enough, but I was told that was all they provide. I’ve basically been left to figure out years of files and processes on my own, which has caused me a lot of stress and even some stress-related health issues.\n\nAfter a confrontation at work this past Monday, I decided I needed to protect my mental health and requested to use the sick leave I’ve accrued. I asked for two weeks off, and I have 40 hours available.\n\nMy manager Mark texte", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Do not reply to her comments or let her know why you need the leave of absence. For all she knows you have a surgery appointment. She's very unprofessional and weird for that. Since it's approved leave it at that. Also glad you didn't sign the disciplinary report as well. She should have sent separate emails especially if they get sent to different parties. I would suggest finding some place else toxic. Keep all your docs and emails. If she keeps trying to pry it's against HIPPA. AND you could file a civil suit against the company."}]}, {"post_id": 42, "title": "[CA] Is my profession title hurting me in other industries?", "score": 2, "total_comments": 4, "url": "https://www.reddit.com/r/AskHR/comments/1mw21pb/", "content": "I have worked in Biotech/Pharmaceuticals for 13 years. My resume is covered with the terms “Drug Substance”, “Drug Product”. \n\nWhen I apply to other industries, is it possible that my resume is getting negatively flagged by the words “drug” and “substance”? As if a bot/AI screener interprets this as illegal drugs/substances. ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Are there alternate synonyms in use in your industry?\n\nactive pharmaceutical ingredient seems to be a recognized alternative to drug substance"}, {"comment_number": 2, "score": 1, "comment": "It would be a stupid reason, but people can also be stupid. Maybe replace with \"biochemical\" and the like."}]}, {"post_id": 43, "title": "[CA] Full-time to part-time job wants to see offer letter for second job", "score": 0, "total_comments": 2, "url": "https://www.reddit.com/r/AskHR/comments/1mw18ek/", "content": "Okay this is a weird situation. I was a full-time postdoctoral researcher at University A. I recently got an offer to be a full-time visiting professor at University B for the fall semester, with all my teaching requirements able to be fulfilled Tuesday-Thursday. I have research commitments for this time, so my supervisor and I decided I would go to half-time at University A and work M and F. University B is fine with this arrangement.\n\nAs of last week I have started at University B and gone to half-time at University A. It has been a bit last minute so some of the appointment stuff at University A may still be in process, but I have signed forms indicating this is the plan and my supervisor has approved it. I am waiting for my timesheet to switch from the monthly salaried employee to biweekly hourly, but as far as I know, I'm approved as half time.\n\nToday I was asked to send a copy of my offer letter from University B. I'm a little hesitant to do this, wondering why they need it or wa", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If you're in a union you should talk to them.\n\nAbsent union protections, there's no way to know what's going on here, or what might happen if you refuse."}, {"comment_number": 2, "score": 1, "comment": "As far as I’m aware, there’s no legal reason or justification for them to ask to see the other offer letter. However, since I don’t work for the UC or state college system, they may have some fancy legal justification to back up their request. I doubt it bec if they did they would have cited it openly in the request. \n\n But, hey, let’s start out by not even mentioning their request and just reiterating the info that they already know. \n\n‘Is there a specific question or piece of information missing that you’re looking for? The pertinent info on my teaching schedule at B was already submitted as part of my new plan here at A. To refresh your memory, here it is again:\n\nUniversity A: M and F only (PT) \nUniversity B: Tue-Wed-Thu (FT) \n\nHope this clears things up! If there is an additional requirement for paperwork, please let me know.’\n…..\nNote: Don’t mention the offer letter at all the first reply. It’s not your job to confront people who are potentially being sneaky. Point out what they already have, and reiterate it so they have no excuses, and then ask what else is missing? \n\nMake them spell out exactly what they are asking for and why. If they have the audacity to ask for the offer letter a second time, they are going to have to produce some legal documentation to back that up. I know there are some contracts that are negotiated by unions but the university system is a whole different ball game. It makes my brain hurt to hear my sister talk about it, tbh, but that’s another rant for another day"}]}, {"post_id": 44, "title": "[NC] Interviewed 25 HR managers - turns out HR is basically a scavenger hunt", "score": 0, "total_comments": 11, "url": "https://www.reddit.com/r/AskHR/comments/1mw0vel/", "content": "Past two months I’ve been hopping on calls with HR managers, maybe 25 in total. Mix of small companies and some bigger ones. I thought the stories would be different depending on size, but honestly it was the same across the board.\n\nThey spend a crazy amount of time just chasing paperwork. Offer letters hiding in old email threads, handbooks lost somewhere in SharePoint, I-9s locked away in ADP while policies sit in Google Drive. Performance reviews floating around in five different “final” versions. A few of them joked they feel more like document archaeologists than HR.\n\nAlmost all of them said the same thing too. if they could just throw this pile of files into something like chatgpt or copilot, life would be 10x easier. But they can’t. HR means payroll data, IDs, medical info. Legal and security would shut that down instantly. A couple even mentioned their companies tried internal LLM pilots, but compliance pulled the plug as soon as they saw the data risk.\n\nThat’s what pushed me t", "top_comments": [{"comment_number": 1, "score": 6, "comment": "I’ve been running HRIS + IT compliance at a 2k-employee company for a decade, and honestly this whole local AI brain thing sounds nice on paper but would never get past day one in the real world. HR staff don’t get to just download tools onto their laptops. Anything that processes payroll data, IDs, or medical info goes through security, legal, and audit. That review cycle alone can drag 12–18 months and that’s if it isn’t killed in the first meeting."}, {"comment_number": 2, "score": 1, "comment": "Or you could try hiring college grads with internship experience. Not all of them are lazy. They have student loans to pay off too. Crazy right?"}]}, {"post_id": 45, "title": "Transitioning to HR from Recruitment [TX]", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/AskHR/comments/1mvzzwd/", "content": "Hey everyone,  \nI know the job market isn’t great right now, but I’m looking to make a move from agency recruiting into HR/People Ops. I’ve got about three years of agency recruiting experience, and some recent stuff has put me back on the job hunt.\n\nI’m not really wanting to go back into another agency role, so I’m trying to figure out the best way to break into HR or People Ops. For anyone who’s made that switch or works in the field, I’d really appreciate any advice on how to get started.\n\n", "top_comments": []}, {"post_id": 46, "title": "[MD] FMLA Do I need it?", "score": 0, "total_comments": 5, "url": "https://www.reddit.com/r/AskHR/comments/1mvzz8f/", "content": "Hi all,\n\nI’m going to have surgery this fall and will be out for 3 weeks.\n\nI have plenty of sick time and PTO time to cover, I’m not going to need to file for any kind of disability.\n\nMy question is, do I still need to file for FMLA?\n\nJust wondering, and my HR department hasn’t been very helpful", "top_comments": [{"comment_number": 1, "score": 3, "comment": "Yes, FMLA provides you job protection. It is unpaid so you can use your PTO to get you paid through the duration of your leave"}, {"comment_number": 2, "score": 3, "comment": "Employers are by law required to designate FMLA when they have enough info to do so. If you take the time without going through the process, your job isn’t protected. PTO doesn’t protect your job."}, {"comment_number": 3, "score": -2, "comment": "Talk to your direct supervisor.  If they allow it, then don't use FMLA. May as well save it for later in case something else happens. If they're not firmly on board, then use it, as is your right. I've seen employees use FMLA when they didn't need to, and HR was...rather sketchy. They allowed it, of course, but they were grateful to be able to limit it later as needed.  \n\nBack when I did work from within HR at a different company, there wasn't an option. Nobody could ever accrue more than six days of sick leave, so FMLA was generally mandatory."}]}, {"post_id": 47, "title": "[TX] How can I switch departments when I already got approval from the other department?", "score": 0, "total_comments": 1, "url": "https://www.reddit.com/r/AskHR/comments/1mvzxf7/", "content": "I got offered a role at another department. It’s a career step up, I would even take a pay cut to be in that role over mine. \n\nThis is what happened, my friend is the head of another department. He offered me a role, I accepted it. He had me him and the GM sit down and talk about it, and the GM agreed. He said I need to talk to my boss first out of respect, and to let him know of any potential push back. \n\nI carry the work in my department and if I left I don’t think they will do well. I don’t want them to fail but I also don’t want to stay somewhere I’m unhappy. I’ve felt stagnant. \n\nHeres a very important point: This actually happened last year also, my boss agreed, then behind closed doors they were saying something else I guess, and I didn’t get to switch and my boss got an external hire to take the position I wanted, and my boss didn’t even run the department they got the external hire to get. So I got screwed. \n\nThis has been in the back of my mind, and I don’t think I should fee", "top_comments": [{"comment_number": 1, "score": -1, "comment": "Tell your boss you got offered the position and will be accepting it. Just gotta rip off the bandaid. If you've already got this approved by the GM, this part should basically be a formality.\n\nAt the end of the day, it's not your problem what happens to the department after you're gone, so don't hamstring yourself to keep them happy.\n\nIf you get hit with the same shenanigans as before, you know it's time to leave that place if you want to work with decent people and be able to grow your career."}]}, {"post_id": 48, "title": "Can name discrepancy cause problems in BGV??[India]", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/AskHR/comments/1mvyf6d/", "content": "In my hcl application form my initial name is last after my\nname but in documents my initial name is front to my name\nlike eg: in hcl form akhil palika but in my all documents\nname is palika akhil is it cause any problems in bgv?? Please\nhelp me .I'm a fresher and selected for GET role", "top_comments": []}, {"post_id": 49, "title": "Home Cleaning Benefit? [CAN]", "score": 0, "total_comments": 7, "url": "https://www.reddit.com/r/AskHR/comments/1mvxf49/", "content": "Hey all! I lead my country’s org in Canada and have an interesting benefit come across my table that I think could benefit the organization.\n\nI was approached to introduce a home cleaning benefit where employees get 1 home cleaning credit per month (3-4 hours of cleaning) valued at around 150$ which I understand is taxable.\n\nI’d love to see if anyone else has had experience implementing something similar and what the results were? Appreciate all the input!", "top_comments": [{"comment_number": 1, "score": 2, "comment": "That’s awesome benefit ! I’d love to have my employer pick up that monthly fee for me. We get 75$ Instacart credit a month but cleaner would be clutch"}, {"comment_number": 2, "score": 0, "comment": "Who's at fault if there's an accident during the cleaning?  \n\nStuff going missing? \n\nEtc. Etc."}]}, {"post_id": 50, "title": "European people, where do you work?!", "score": 2, "total_comments": 2, "url": "https://www.reddit.com/r/WorkOnline/comments/1mw0zdo/", "content": "I have nothing in Appen, Outlier, Data annotation had work in May and nothing sense that (I don't do coding), oneforma is oneforma, Telus seems to be as shitty as oneforma.\nI have done multiple projects with appen and oneforma in the past.\nWhere can I find something 😅\nI'm desperate, we have thereable unemployment situation here in Finland and could not get even a phone sales job here :D", "top_comments": []}, {"post_id": 51, "title": "Lionbridge", "score": 1, "total_comments": 2, "url": "https://www.reddit.com/r/WorkOnline/comments/1muahn7/", "content": "Can you work for Lion Bridge in Australia?", "top_comments": []}, {"post_id": 52, "title": "OneForma Polly project - Grading", "score": 1, "total_comments": 2, "url": "https://www.reddit.com/r/WorkOnline/comments/1mtvz9q/", "content": "Hi, I always had transcript to grade Italian language), but today a message appear \"there are no available tasks at the moment\". Never happened before. \n\nAnyone in my situation?", "top_comments": []}, {"post_id": 53, "title": "Is SunRaycorp Legit?", "score": 3, "total_comments": 1, "url": "https://www.reddit.com/r/WorkOnline/comments/1mtze7o/", "content": "A person from SunRaycorp/ SunRaycorp Enterprise Inc. is on tiktok recruiting for a data entry/ payroll positions. Are they legit? Has anyone worked for them?", "top_comments": []}, {"post_id": 54, "title": "Best alternative to Omni Interactions?", "score": 0, "total_comments": 2, "url": "https://www.reddit.com/r/WorkOnline/comments/1mtumiz/", "content": "What's the best platform that does remote call center contracting? I just applied for a project with Omni Interactions against my better judgment. Omni has broken every promise so far. I've read that they pay for all the time you're in the call queue, but now they're saying you're paid only for productive time. They say [here](https://omniinteractions.com/gba/top-5-companies-remote-customer-service-contracts/) that there are no upfront costs, but that's not true either: it's $40 for each gig you apply to.\n\nI compromised on all that to proceed, until I got to their KYC using a company called IDMission. I made eight attempts to verify my driver license, in my bathroom with the card propped upright on a tray in the medicine cabinet, for perfect white lighting without glare. This is where I always do KYC, and it's always worked until now. The shots were crystal-clear as far as I could tell, but, every time, they say not clear enough, please try again. Apparently, they want counterfeitable ", "top_comments": [{"comment_number": 1, "score": 2, "comment": "I have sign up for Omni but haven't picked a job yet. So, you saying if you're schedule and work for 8hrs, you won't get paid the full 8hrs? I was reading over one of their gig contract overviews."}]}, {"post_id": 55, "title": "Is Alignerr legit?", "score": 14, "total_comments": 12, "url": "https://www.reddit.com/r/WorkOnline/comments/1mrsjbd/", "content": "Hi! I just wanted to know if any of you guys have tried working in Alignerr and if there were no problems receiving your payment", "top_comments": [{"comment_number": 1, "score": 7, "comment": "I've been working for them around 40 hrs a week for about a month now, they are legit."}, {"comment_number": 2, "score": 3, "comment": "Yes it is legit \nI have received payment from them"}, {"comment_number": 3, "score": 2, "comment": "They don't work in every country, however."}]}, {"post_id": 56, "title": "OneForma / Centific - witholding payments", "score": 7, "total_comments": 3, "url": "https://www.reddit.com/r/WorkOnline/comments/1mpdzse/", "content": "Hi all,\n\nSo I joined the OneForma Platform a while back to see some opportunities working from home. So I joined one of their project via Centific (I guess it's all the same company). And started to work on the project I got assigned too. \n\nOne day I was logging in to OneForma and got \"Disabled due to fraudulent activity\" - What happen was i had a VPN on that I usually have for other reasons, and they locked my account there. So I emailed them and told them about it directly when it happened. Nothing happened with my project account, so I continue to work for like a month (around 20–30 hours per week).  Now I got an email saying they removed me from the project because my account on OneForma is disabled. And they won't pay out for the work I have been doing. I wanna also state that they didn't pay for my full working hours previous payment period (they do like 20th to the 19th of the next month) before they kicked me out as well. \n\nI mean, can they legally do this? Because I know they ", "top_comments": [{"comment_number": 1, "score": 3, "comment": "I dont think they can withhold payment for work you did. I just filed an arbitration case against outlier for the same thing. They disabled my account for \"ai identification\" and won't pay me. I offered to send any necessary documents, do a zoom call, etc, but they just parrot the same line and refuse to engage at all.\n\nCheck the terms and conditions and if there is an arbitration clause find out what arbitrator it is. For outlier it's american arbitration adr.org\n\nYou can file your case online. There's a small fee $25 to $100  but you can ask for arbitration costs to be awarded back to you."}]}, {"post_id": 57, "title": "Has anyone worked as a Content Developer at Pearson?", "score": 12, "total_comments": 1, "url": "https://www.reddit.com/r/WorkOnline/comments/1mpgftz/", "content": "What was your hiring process like?\nHow long did the full process take?\n\nDo you/did you enjoy it?", "top_comments": []}, {"post_id": 58, "title": "Opinions on Scaled Solutions (Uber)?", "score": 3, "total_comments": 4, "url": "https://www.reddit.com/r/WorkOnline/comments/1mp4fuf/", "content": "Does anyone here contract with Scaled Solutions? Is there a good amount of work that pays decently? I signed up and completed the the pre-screening assessment, but am feeling uneasy about providing my bank details and a blank/void cheque through their third party as part of the onboarding process. I just figured they'd pay through PayPal/Payoneer like most platforms. I'm in Canada for reference.", "top_comments": [{"comment_number": 1, "score": 5, "comment": "Dont do it. I never gave my bank details and then they spammed me to no end. They will NOT stop emailing and any reputable company wouldnt do that. They arent supposed to chase so hard. I unsubscribed and blocked and still show up in my SPAM everyday. I messaged the recruiter and she said they would take my name off they will not. It is so sad there are so many job scams and people just want honest work"}, {"comment_number": 2, "score": 1, "comment": "Did you give your information?"}]}, {"post_id": 59, "title": "Telus - Online Rater eCommerce Analyst- UK", "score": 4, "total_comments": 4, "url": "https://www.reddit.com/r/WorkOnline/comments/1moe0mj/", "content": "[https://www.telusinternational.ai/cmp/contributor/jobs/available/127726](https://www.telusinternational.ai/cmp/contributor/jobs/available/127726)\n\nHas anyone worked with Telus in a similar role?\n\nI'm particularly confused by this line in the email I got about the role (absent from the link above):  \n\"*Payment will be made only if the tasks are approved in the QA phase.*\"\n\nI will email Telus, but anticipate that I will be ignored.", "top_comments": [{"comment_number": 1, "score": 3, "comment": "It is exactly what it is. Their approval process is an absolute crap, they hired a ton of people who had no basic knowledge and will approve/disappove arbitrary. It is a complete waste of time. Not paying for hours worked is also illegal in both Canada and UK but they really are doing this."}, {"comment_number": 2, "score": 1, "comment": "The line \"Payment will be made only if the tasks are approved in the QA phase\" means Telus only pays for work that passes their quality checks. Many workers report that if tasks do not meet Telus’s quality standards during review, payment can be withheld, which feels frustrating but is part of their policy."}]}, {"post_id": 60, "title": "[For Hire] Looking for any full time position in Chicago!", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/forhire/comments/1mw1lhj/", "content": "I have a criminal justice and psychology degree with a 4.0gpa. I have paraprofessional experience and behavial managmanet in classrooms, and student engagement assistant in a collage level. I'm looking for any full time position that is around $26/h \n\nI am very organized, love working with people and being a team player. I worked in office settings and planned events. I am desperate for a job that will cover bills. I would love to work with people again ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "\n#[Make sure you have included a budget/rate, they are required for all posts – ballpark or a range is fine as long as it's following the $15/hr minimum rule.](https://www.reddit.com/r/forhire/comments/abv5pw/meta_budgetsrates_are_now_required_for_all_posts/)\n\n---\n\nPositive and negative feedback about /u/Actuator_Sensitive is only allowed in /r/testimonials.\n\n#[You can see possible testimonials about /u/Actuator_Sensitive here.](https://www.reddit.com/r/testimonials/search?q=Actuator_Sensitive&restrict_sr=on&include_over_18=on&sort=relevance&t=all) \n\n>^To ^leave ^new ^feedback ^go ^here: ^[[POS](http://www.reddit.com/r/testimonials/submit?title=%5BPOS%5D+/u/Actuator_Sensitive+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEG](http://www.reddit.com/r/testimonials/submit?title=%5BNEG%5D+/u/Actuator_Sensitive+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEUTRAL](http://www.reddit.com/r/testimonials/submit?title=%5BNEU%5D+/u/Actuator_Sensitive+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)]\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/forhire) if you have any questions or concerns.*"}]}, {"post_id": 61, "title": "Crime Journalist [Hiring]", "score": 2, "total_comments": 1, "url": "https://www.reddit.com/r/forhire/comments/1mw190i/", "content": "**🔎 Crime Journalist – Freelance/Remote**\n\n💼 **Responsibilities:**\n\n* Track and research recent U.S. police-related incidents with video or news coverage\n* Compile key case details (date, agency, location, source links)\n* Identify incidents with strong public interest or viral potential\n* Write concise, clear summaries of findings for submission and follow-up\n\n✅ **Requirements:**\n\n* **MUST** have prior experience in crime journalism\n* Strong interest in crime reporting, investigative journalism, or true crime\n* Ability to identify FOIA-worthy cases quickly and reliably (bodycam footage, 911 calls, arrest records)\n* Excellent written communication and storytelling skills\n* Detail-oriented, meets deadlines, and responds promptly\n\n💻 **Remote | Flexible hours | Pay per batch or hour**\n\nIf you’re passionate about uncovering compelling crime stories and want to help spotlight cases that matter, we’d love to hear from you! Please send me a DM.\n\n💰 **Compensation:** Up to $20/hour depending on ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "\n#[Make sure you have included a budget/rate, they are required for all posts – ballpark or a range is fine as long as it's following the $15/hr minimum rule.](https://www.reddit.com/r/forhire/comments/abv5pw/meta_budgetsrates_are_now_required_for_all_posts/)\n\n---\n\nPositive and negative feedback about /u/No_Biscotti_8664 is only allowed in /r/testimonials.\n\n#[You can see possible testimonials about /u/No_Biscotti_8664 here.](https://www.reddit.com/r/testimonials/search?q=No_Biscotti_8664&restrict_sr=on&include_over_18=on&sort=relevance&t=all) \n\n>^To ^leave ^new ^feedback ^go ^here: ^[[POS](http://www.reddit.com/r/testimonials/submit?title=%5BPOS%5D+/u/No_Biscotti_8664+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEG](http://www.reddit.com/r/testimonials/submit?title=%5BNEG%5D+/u/No_Biscotti_8664+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEUTRAL](http://www.reddit.com/r/testimonials/submit?title=%5BNEU%5D+/u/No_Biscotti_8664+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)]\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/forhire) if you have any questions or concerns.*"}]}, {"post_id": 62, "title": "[HIRING] $1000 per Client for Website Development Booked Clients", "score": 2, "total_comments": 6, "url": "https://www.reddit.com/r/forhire/comments/1mw0vbc/", "content": "I own a website design and SEO company and need clients for HVAC industry. DM me to get more details. I can provide list of businesses scraped from Google Maps with their website, phone number and such metrics. Will pay $1000 USD for every booked client you deliver. Paying an absurd amount because I need to build more clients in this industry. Potential of becoming full-time employee if you delivery good results. US only. ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "\n#[Make sure you have included a budget/rate, they are required for all posts – ballpark or a range is fine as long as it's following the $15/hr minimum rule.](https://www.reddit.com/r/forhire/comments/abv5pw/meta_budgetsrates_are_now_required_for_all_posts/)\n\n---\n\nPositive and negative feedback about /u/Ecstatic_Plum_3464 is only allowed in /r/testimonials.\n\n#[You can see possible testimonials about /u/Ecstatic_Plum_3464 here.](https://www.reddit.com/r/testimonials/search?q=Ecstatic_Plum_3464&restrict_sr=on&include_over_18=on&sort=relevance&t=all) \n\n>^To ^leave ^new ^feedback ^go ^here: ^[[POS](http://www.reddit.com/r/testimonials/submit?title=%5BPOS%5D+/u/Ecstatic_Plum_3464+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEG](http://www.reddit.com/r/testimonials/submit?title=%5BNEG%5D+/u/Ecstatic_Plum_3464+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEUTRAL](http://www.reddit.com/r/testimonials/submit?title=%5BNEU%5D+/u/Ecstatic_Plum_3464+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)]\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/forhire) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "[removed]"}, {"comment_number": 3, "score": 1, "comment": "[removed]"}]}, {"post_id": 63, "title": "Looking for a Drone Pilot in Georgia [HIRING](Heavy-Lift Preferred) $250 a hour", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/forhire/comments/1mw03cu/", "content": "Hey folks,\n\nI’m looking to personally hire a drone pilot here in Georgia. Ideally, I need someone experienced with heavy-lift drones. If you already own your own setup, that’s great — but I also have a DJI S1000 available that can be used if needed.\n\nThis is for aerial shots for rap videos, and will be around a rap crowd/environment. Nothing too complicated — just need someone skilled and comfortable flying in that type of setting.\n[Looking to pay $250-$400 per hour depending on conditions]", "top_comments": [{"comment_number": 1, "score": 1, "comment": "\n#[Make sure you have included a budget/rate, they are required for all posts – ballpark or a range is fine as long as it's following the $15/hr minimum rule.](https://www.reddit.com/r/forhire/comments/abv5pw/meta_budgetsrates_are_now_required_for_all_posts/)\n\n---\n\nPositive and negative feedback about /u/silentthinker187 is only allowed in /r/testimonials.\n\n#[You can see possible testimonials about /u/silentthinker187 here.](https://www.reddit.com/r/testimonials/search?q=silentthinker187&restrict_sr=on&include_over_18=on&sort=relevance&t=all) \n\n>^To ^leave ^new ^feedback ^go ^here: ^[[POS](http://www.reddit.com/r/testimonials/submit?title=%5BPOS%5D+/u/silentthinker187+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEG](http://www.reddit.com/r/testimonials/submit?title=%5BNEG%5D+/u/silentthinker187+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEUTRAL](http://www.reddit.com/r/testimonials/submit?title=%5BNEU%5D+/u/silentthinker187+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)]\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/forhire) if you have any questions or concerns.*"}]}, {"post_id": 64, "title": "[For Hire] Photoshop Expert, i can do any edits you want.", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/forhire/comments/1mvz1l0/", "content": "Hello, I'm a Photoshop artist and freelance graphic designer with 5+ years of experience. My specialties are Photo Manipulation, Photo Restoration, Photo Colorization, Social Media Design, NSFW Photo Manipulation, Creating Professional Headshots and any general photo editing.\n\nMy professionalism, attention to detail, and ability to work under tight deadlines make me the perfect choice for your project. Contact me today to discuss further.\n\nServices i provide -\n\n• Photo manipulation\n\n• Photo retouching and enhancement\n\n• Photo Editing\n\n• Object Removal\n\n• Image Restoration\n\n• Old photo restoration/Colorization\n\n• Photo color correction and color grading\n\n• Swap faces\n\n• Pet portraits\n\n• Background Removing/Blurring/Changing\n\n• Color adjustments & Changing colors\n\n• Photo resizing/Enhancement/Cropping\n\n• Filters & Effects\n\n• High-End Retouch\n\n• Skin Toning \n\n• Hair coloring\n\n• Changing Outfits/Creating Professional Headshots.\n\n• Cartoonify your image\n\n• NSFW (£25+)\n\n• YouTube Thumbnails,", "top_comments": [{"comment_number": 1, "score": 1, "comment": "\n#[Make sure you have included a budget/rate, they are required for all posts – ballpark or a range is fine as long as it's following the $15/hr minimum rule.](https://www.reddit.com/r/forhire/comments/abv5pw/meta_budgetsrates_are_now_required_for_all_posts/)\n\n---\n\nPositive and negative feedback about /u/LxYagami is only allowed in /r/testimonials.\n\n#[You can see possible testimonials about /u/LxYagami here.](https://www.reddit.com/r/testimonials/search?q=LxYagami&restrict_sr=on&include_over_18=on&sort=relevance&t=all) \n\n>^To ^leave ^new ^feedback ^go ^here: ^[[POS](http://www.reddit.com/r/testimonials/submit?title=%5BPOS%5D+/u/LxYagami+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEG](http://www.reddit.com/r/testimonials/submit?title=%5BNEG%5D+/u/LxYagami+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEUTRAL](http://www.reddit.com/r/testimonials/submit?title=%5BNEU%5D+/u/LxYagami+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)]\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/forhire) if you have any questions or concerns.*"}]}, {"post_id": 65, "title": "[Hiring] Looking for creative reddit posters", "score": 2, "total_comments": 2, "url": "https://www.reddit.com/r/forhire/comments/1mvy5rm/", "content": "Seeking active Reddit users to assist with posting content (text, links, or images).\n\nYou are responsible for making sure the post is appropriate for the subreddit.\n\nRequirements for Applicants: Minimum 200+ Combined Karma and minimum 30 day old account\n\nPay: $0.75 per approved post (if the post gets deleted you must post again elsewhere). Make an easy $10+ per week, just by staying active and posting regularly. Payments will be given with crypto.\n\nYou just need to spend a couple minutes everyday posting.\n\nDM me if you are interested! ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "\n#[Make sure you have included a budget/rate, they are required for all posts – ballpark or a range is fine as long as it's following the $15/hr minimum rule.](https://www.reddit.com/r/forhire/comments/abv5pw/meta_budgetsrates_are_now_required_for_all_posts/)\n\n---\n\nPositive and negative feedback about /u/Notabot404lol is only allowed in /r/testimonials.\n\n#[You can see possible testimonials about /u/Notabot404lol here.](https://www.reddit.com/r/testimonials/search?q=Notabot404lol&restrict_sr=on&include_over_18=on&sort=relevance&t=all) \n\n>^To ^leave ^new ^feedback ^go ^here: ^[[POS](http://www.reddit.com/r/testimonials/submit?title=%5BPOS%5D+/u/Notabot404lol+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEG](http://www.reddit.com/r/testimonials/submit?title=%5BNEG%5D+/u/Notabot404lol+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEUTRAL](http://www.reddit.com/r/testimonials/submit?title=%5BNEU%5D+/u/Notabot404lol+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)]\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/forhire) if you have any questions or concerns.*"}]}, {"post_id": 66, "title": "[For Hire] Part-time DevOps / Cloud / Network Engineer (After Hours, Remote)", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/forhire/comments/1mvy0fq/", "content": "Experienced engineer available for **evening / after-hours projects (after 5 PM EST)**.\n\nSkills: **AWS (EKS, ECS, VPC, TGW, CloudFront, IAM/OIDC), Kubernetes (GitOps/Flux/Helm), Terraform, Networking (Direct Connect, Load Balancing, DNS/Route 53), Cost Optimization**.\n\nRecent project highlights:\n\n* Built a production **EKS cluster via GitOps serving 1M+ unique hits/day**. while reducing costs\n* Designed **cross-account AWS Transit Gateway networking**.\n* Automated **secrets + tagging enforcement** across accounts.\n* Cut **cloud costs** by eliminating unused NATs, EIPs, etc.\n\nLooking for **part-time contract work**: DevOps, Cloud, or Networking.\n\n📩 DM me if you need reliable after-hours help.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "\n#[Make sure you have included a budget/rate, they are required for all posts – ballpark or a range is fine as long as it's following the $15/hr minimum rule.](https://www.reddit.com/r/forhire/comments/abv5pw/meta_budgetsrates_are_now_required_for_all_posts/)\n\n---\n\nPositive and negative feedback about /u/CyramSuron is only allowed in /r/testimonials.\n\n#[You can see possible testimonials about /u/CyramSuron here.](https://www.reddit.com/r/testimonials/search?q=CyramSuron&restrict_sr=on&include_over_18=on&sort=relevance&t=all) \n\n>^To ^leave ^new ^feedback ^go ^here: ^[[POS](http://www.reddit.com/r/testimonials/submit?title=%5BPOS%5D+/u/CyramSuron+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEG](http://www.reddit.com/r/testimonials/submit?title=%5BNEG%5D+/u/CyramSuron+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEUTRAL](http://www.reddit.com/r/testimonials/submit?title=%5BNEU%5D+/u/CyramSuron+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)]\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/forhire) if you have any questions or concerns.*"}]}, {"post_id": 67, "title": "[For Hire] Let me handle the boring work", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/forhire/comments/1mvwq2z/", "content": "Hey everyone, I’m an AI engineer with experience building and integrating AI solutions into different platforms. I take repetitive, boring tasks and automate them so you can focus on other tasks.\n\nI’ve worked on things like setting up chatbots, building custom automations, making smart systems with Ai agents and adding AI features to existing products. If you’re working on a project, startup, or even just have a workflow you’d like to streamline, I can probably help.\n\nMy minimum rate is $25/hour depends on the task. Happy to chat and see your questions answered.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "\n#[Make sure you have included a budget/rate, they are required for all posts – ballpark or a range is fine as long as it's following the $15/hr minimum rule.](https://www.reddit.com/r/forhire/comments/abv5pw/meta_budgetsrates_are_now_required_for_all_posts/)\n\n---\n\nPositive and negative feedback about /u/Gold-Artichoke-9288 is only allowed in /r/testimonials.\n\n#[You can see possible testimonials about /u/Gold-Artichoke-9288 here.](https://www.reddit.com/r/testimonials/search?q=Gold-Artichoke-9288&restrict_sr=on&include_over_18=on&sort=relevance&t=all) \n\n>^To ^leave ^new ^feedback ^go ^here: ^[[POS](http://www.reddit.com/r/testimonials/submit?title=%5BPOS%5D+/u/Gold-Artichoke-9288+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEG](http://www.reddit.com/r/testimonials/submit?title=%5BNEG%5D+/u/Gold-Artichoke-9288+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEUTRAL](http://www.reddit.com/r/testimonials/submit?title=%5BNEU%5D+/u/Gold-Artichoke-9288+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)]\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/forhire) if you have any questions or concerns.*"}]}, {"post_id": 68, "title": "[HIRING] Brand Outreach Specialist for Influencer Paid Partnerships", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/forhire/comments/1mvurjg/", "content": "Looking for someone who can **secure brand collaborations and partnerships** for lifestyle, fashion, beauty and foodie influencer.\n\n**Responsibilities:**\n\n* Outreach to brands (lead funnels provided so you dont start from scratch)\n* Pitch collaborations\n* Track and update partnership progress for your invoicing\n\n**Requirements:**\n\n* Strong written English and professional communication\n* Organized, persistent, and results-driven\n* Experience in influencer partnerships, PR, or sales is preferred\n* Reliable internet and communication\n\n**Compensation:**\n\n* **15-20% Commission on paid brand deals closed**\n* **Flat rate for work and gifted partnerships (if pre-approved)**\n* No cap — the more you close, the more you earn\n\nFlat rate $15/hr - 1 hr per day\n\n📩 **Apply here:** [https://www.misssperu.com/contact-2](https://www.misssperu.com/contact-2)", "top_comments": [{"comment_number": 1, "score": 1, "comment": "\n#[Make sure you have included a budget/rate, they are required for all posts – ballpark or a range is fine as long as it's following the $15/hr minimum rule.](https://www.reddit.com/r/forhire/comments/abv5pw/meta_budgetsrates_are_now_required_for_all_posts/)\n\n---\n\nPositive and negative feedback about /u/misssperu is only allowed in /r/testimonials.\n\n#[You can see possible testimonials about /u/misssperu here.](https://www.reddit.com/r/testimonials/search?q=misssperu&restrict_sr=on&include_over_18=on&sort=relevance&t=all) \n\n>^To ^leave ^new ^feedback ^go ^here: ^[[POS](http://www.reddit.com/r/testimonials/submit?title=%5BPOS%5D+/u/misssperu+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEG](http://www.reddit.com/r/testimonials/submit?title=%5BNEG%5D+/u/misssperu+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEUTRAL](http://www.reddit.com/r/testimonials/submit?title=%5BNEU%5D+/u/misssperu+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)]\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/forhire) if you have any questions or concerns.*"}]}, {"post_id": 69, "title": "[Hiring] A few positions just opened at my company — I can refer if interested", "score": 18, "total_comments": 19, "url": "https://www.reddit.com/r/forhire/comments/1mvuri4/", "content": "Hey folks,\n\nI’m currently interning at AfterQuery, and a few positions have recently opened up across different teams (multiple domains/roles).\n\nWhy Apply:\n\nExcellent Compensation – Min. $35/hour, with top rates exceeding $75/hour\nStartup Exposure – Work with a YC-backed company creating next-gen AI training sets\nFlexible Role – Remote and asynchronous workflow\n\nIf you’re interested, feel free to DM me your resume + email along with the role/domain you’d like to apply for. I’ll go through and, if it looks like a good fit, I can submit a referral on your behalf.\n\nThis isn’t a guarantee, but referrals usually help in getting your profile noticed faster.\n\nHope this helps someone here!", "top_comments": [{"comment_number": 1, "score": 1, "comment": "\n#[Make sure you have included a budget/rate, they are required for all posts – ballpark or a range is fine as long as it's following the $15/hr minimum rule.](https://www.reddit.com/r/forhire/comments/abv5pw/meta_budgetsrates_are_now_required_for_all_posts/)\n\n---\n\nPositive and negative feedback about /u/Gold_You5142 is only allowed in /r/testimonials.\n\n#[You can see possible testimonials about /u/Gold_You5142 here.](https://www.reddit.com/r/testimonials/search?q=Gold_You5142&restrict_sr=on&include_over_18=on&sort=relevance&t=all) \n\n>^To ^leave ^new ^feedback ^go ^here: ^[[POS](http://www.reddit.com/r/testimonials/submit?title=%5BPOS%5D+/u/Gold_You5142+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEG](http://www.reddit.com/r/testimonials/submit?title=%5BNEG%5D+/u/Gold_You5142+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)] | ^[[NEUTRAL](http://www.reddit.com/r/testimonials/submit?title=%5BNEU%5D+/u/Gold_You5142+Short+Description&text=Write+a+description+about+your+experience+here+but+remember+to+include+NO+personal+information.)]\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/forhire) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "[removed]"}, {"comment_number": 3, "score": 1, "comment": "[removed]"}]}]