["\n            === POST 0 ===\n            Title: [OC] Obesity prevalence across Indian districts.\n            Score: 14 upvotes\n            Total Comments: 15\n            URL: https://www.reddit.com/r/dataisbeautiful/comments/1mmp46y/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Seems effectively same as a socio-economic map or human development index map, basically. Surely isn’t a coincidence.\n2. Score: 1 | Comment: Huh I wonder what about the coast that causes this.\n\n\nBut it more likely has to do with economic conditions with people having more money but not enough for what's needed to eat better. Well, I guess that's just a guess.\n3. Score: 1 | Comment: Is it obesity percentage, or overweight and obesity percentage? Because the post title says one thing and the chart title says something else.\n==============================", "\n            === POST 1 ===\n            Title: LLM's play Prisoner's Dilemma: smaller models achieve higher rating [OC]\n            Score: 17 upvotes\n            Total Comments: 9\n            URL: https://www.reddit.com/r/dataisbeautiful/comments/1mmmajk/\n            Content: source (data, methods, and info): [dilemma.critique-labs.ai](http://dilemma.critique-labs.ai)  \ntools used: Python  \n  \nI ran a benchmark where 100+ large language models played each other in a conversational formulation of the Prisoner’s Dilemma  (100 matches per model, round-robin).  \n\nInterestingly, regardless of model series as they get larger they lose their tendency to defect (choose the option to save themselves at the cost of their counterpart) , and also subsequently perform worse. \n\n**Data & method:**\n\n* 100 games per model, \\~10k games total\n* Payoff matrix is the standard PD setup\n* Same prompt + sampling parameters for each model\n\n\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Where is the key? Am I supposed to guess what the colors mean?  The labels are illegible.  They may be readable on a desktop, but on a mobile device (60% of reddit users), they are a blur.\n2. Score: 1 | Comment: Did models retain state between matches? If not, then there's no point in actually doing a round robin, just get a sample from each model to estimate defect/cooperate rate. That's enough to let you compute the expected scores.\n\nThe nature of the game means that the rating would be a function of the portion of cooperating peers, so it seems like ELO says more about the selection of the pool rather than general \"strength\" of a model. \n\nI'd be interested in seeing results for an iterated prisoners dilemma.\n\nI'm terms of the presentation itself, the \"clustered by variant\" isn't great since it's unclear how much data is being hidden. I wonder if a scatterplot of model size vs ELO / model size vs cooperation rate would be better. Points colored by model name.\n3. Score: 1 | Comment: > and also subsequently perform worse\n\nBy what definition of \"perform\"? LLMs are not designed to optimize short-term gains in thought experiments - they are designed to mimic what a *human* would say when given the same prompt. As models get better, they more accurately mimic what a human would say. Evidently, the humans in their training data would choose not to defect\n==============================", "\n            === POST 2 ===\n            Title: ISBN Visualization\n            Score: 18 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/dataisbeautiful/comments/1mmk0sa/\n            Content: No text\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 3 ===\n            Title: Visualizing Paul’s Journeys Across the 1st Century Roman World [OC]\n            Score: 39 upvotes\n            Total Comments: 3\n            URL: https://www.reddit.com/r/dataisbeautiful/comments/1mmiq4w/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 5 | Comment: I created an interactive map overlaying Paul’s 20,000km of journeys on a 1st century Roman Roads network - with modern vs. ancient cities and site photos. The base map utilizes the Digital Atlas of the Roman Empire (DARE), which was embedded into ArcGIS, with all four of Paul’s journeys with every stop added. The Roman Roads map can also be switched to a modern map to compare the ancient vs. modern locations.\n\nThis is part of a personal project I am embarking on called Kingdoms Collide, where I plan to retrace every step of Paul’s journeys across the ancient Roman Roads. Approximately 30% is complete, and I hope to finish it in the next couple years. I find it fascinating the relationship between the message what Paul brought versus that of the Roman Empire, where the world was never the same following those encounters. Hope you enjoy exploring through this map!\n\nSource: The Book of Acts and on-site research\nTool: ArcGis and the DARE Atlas\n2. Score: 2 | Comment: First I was like: Paul? Who is Paul and what is he doing in ancient Rome? \n\nUntil I realized you were writing about Saint Paul and of course during his travels he wasn't a saint yet.\n\nGreat work.\n==============================", "\n            === POST 4 ===\n            Title: [OC][Feedback] GINA v0 – 2D Galaxy of ~400k Argentine Official Gazette publications\n            Score: 3 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/dataisbeautiful/comments/1mm40lp/\n            Content: **Demo:** [https://gina.boa.com.ar](https://gina.boa.com.ar/)\n\nHi! I’m looking for honest feedback on the aesthetics, UX, usefulness, and performance of a data visualization tool we’re testing. **GINA v0** is the first public version of the *Interactive Galaxy of Argentine Regulations*. Each point represents a publication from the Official Gazette of the Argentine Republic (408,533 in total). I processed the content using 1,536-dimensional embeddings and reduced it to 2D so that the distance between points approximates semantic similarity. The app allows zoom/pan, real-time semantic search, filtering by date and regulation type, and viewing details on click.\n\nThis is a v0, so it sometimes crashes and performance varies greatly depending on the device. It runs well on a Mac M1 and iPhone 13, shows stuttering on a Google Pixel Tablet, and is very sluggish on mid/low-end Android devices. I’m considering dynamically reducing the number of points on screen or letting the user choose how man\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 5 ===\n            Title: [OC] TIL: Reddit spends 40% revenue on R&D 👀\n            Score: 1080 upvotes\n            Total Comments: 182\n            URL: https://www.reddit.com/r/dataisbeautiful/comments/1mm0x0j/\n            Content: Source : Reddit Investor Relations\n\nTool used : [https://sankeydiagram.ai](https://sankeydiagram.ai)\n\n            TOP COMMENTS:\n        1. Score: 1760 | Comment: For a company like Reddit, that’s just cost of employing developers. Almost everything developers work on is considered r&d so they can stuff that line item\n2. Score: 754 | Comment: Spending half income to fuck up your UI for the fourth time\n3. Score: 257 | Comment: Maybe they should have spent some of that money buying Apollo app or their devs. \n\nIt’s insane how amazing that app was vs the reddit one.\n==============================", "\n            === POST 6 ===\n            Title: North American “Big 4” League Presence by Metro Area - 2025 [OC]\n            Score: 1513 upvotes\n            Total Comments: 139\n            URL: https://www.reddit.com/r/dataisbeautiful/comments/1mltqlj/\n            Content: I've always found these venn diagrams interesting, so I decided to make a 2025 version.\t\n\n  \nNotes on methodology:\n\n\\-I'm using metropolitan statistical area (MSA) as defined by the US Office of Management and Budget and census metropolitan area (CMA) as defined by Statistics Canada (wikipedia: [https://en.wikipedia.org/wiki/Metropolitan\\_statistical\\_area](https://en.wikipedia.org/wiki/Metropolitan_statistical_area), https://en.wikipedia.org/wiki/List\\_of\\_census\\_metropolitan\\_areas\\_and\\_agglomerations\\_in\\_Canada)\n\n\\-Metro assignments are based firstly on team name (if it contains the city name) and secondly on the location of the team's arena (if team name doesn't contain the city name).\n\n\\-I'm using metro area instead of city due to the number of teams that play outside of city limits. Metro also just makes more sense for a lot of cases (i.e. Twin Cities)\n\n\\-For the sake of simplicity and for the majority of cases, I just list the main city in the metro when referring to a metro \n\n            TOP COMMENTS:\n        1. Score: 376 | Comment: This is awesome, nice work.\n2. Score: 170 | Comment: Having all 4 or just having an NHL team (lots of Canadian cities) is most common. And no cities have NBA/NFL/NHL and no MLB.\n3. Score: 42 | Comment: Fun fact: Raleigh is the only U.S. city with an NHL team, but without an NFL, NBA, MLB, or MLS team.\n\nTruly a hockey town.\n==============================", "\n            === POST 7 ===\n            Title: Who Captured $118 Trillion in New US Household Wealth Since 2000 [OC]\n            Score: 4162 upvotes\n            Total Comments: 333\n            URL: https://www.reddit.com/r/dataisbeautiful/comments/1mlsmcw/\n            Content: https://www.federalreserve.gov/releases/z1/dataviz/dfa/distribute/table/ \n\n            TOP COMMENTS:\n        1. Score: 451 | Comment: Would be interesting to see this per capita, the amount of wealth each group gains is probably relative to the amount of wealth they already have.\n2. Score: 160 | Comment: The 2008 GFC did enormous damage to the bottom 50% \n\nMany lost their life saving and homes \n\nI know families who spent $300k on a 50% down (to qualify for the mortgages because their income was not high) payment in 2006, then lost their job 2 years later and had their homes foreclosed with no equity left \n\nJust horrible \n\nReal estate bubbles are very very bad things, far more so than equity bubbles\n3. Score: 107 | Comment: If all distributed equally among the US population today, that would be $350,000 per person\n==============================", "\n            === POST 8 ===\n            Title: [OC] I built a site that lets people vote on what counts as a sandwich—help collect the data so we can actually analyze it\n            Score: 0 upvotes\n            Total Comments: 22\n            URL: https://www.reddit.com/r/dataisbeautiful/comments/1mlk8kf/\n            Content: This all started during late-night dorm debates at a STEM college: *Is a hot dog a sandwich? What about a quesadilla or a Pop‑Tart?*\n\nSo I created [**Votewich**]() — a lightweight, swipe‑based voting site where users decide whether a given food *is* (Yeswich), *isn’t* (Nopewich), or should *skip* the judgment. Each food also has structured features (like “uses sliced bread,” “served hot,” etc.), and eventually these votes will feed into a data-driven journey to understand what makes something sandwich-y.\n\nRight now, we're in **early days** — we don’t have significant insights yet because we need *more votes*. That’s where you come in:\n\n* Vote on controversial foods\n* Help shape feature tracking (via the **Add‑A‑Wich** tab)\n* Once we have enough data, you’ll see visualizations in the **Sandwich Brain** that reveal which features matter most\n\nAlso available:\n\n* **Tally tab** – See how the crowd is ruling\n* **My Votes** tab – Track your logic, compare with the collective\n\nI’d love to hear\n\n            TOP COMMENTS:\n        1. Score: 11 | Comment: https://preview.redd.it/34h7nne3hyhf1.png?width=953&format=png&auto=webp&s=8f47d2780d408c580b9b78a62471b54e2f69f68a\n\n\n\nI know you've been busted for vibe-coding, but come on, you can't describe it as a sandwich, and then ask if it's a sandwich.\n2. Score: 10 | Comment: Not sure I understand the visualisation: why do you have both true and false as well as yes and no for a single statement that you can either agree or disagree with?\n3. Score: 2 | Comment: I love it, but are you gathering location data to gain additional insights? I'd be interested to see how each differs by country. Why?....\n\nI'm an Australian that moved to America 9 years ago. So many things here get called a sandwich would never be called a sandwich in Australia. The fundamental criteria to call something a sandwich in Australia is there should be 2 slices of bread from a loaf of bread (let's not talk about those folks from South Australia and their double cut sandwich). If you toast that you usually call it a toasted sandwich (with exceptions).\n\nHam and cheese between 2 slices of bread. Australia = ham and cheese sandwich. America = ham and cheese sandwich\n\nHam and cheese in between 2 halves of a bread roll. Australia = ham and cheese roll. America = ham and cheese sandwich (probably.... never actually come across it here) \n\nGrilled or fried chicken breast between 2 slices of toasted bread from a loaf. Australia = chicken sandwich (usually noted a 'on toast' or 'toasted'). America = chicken sandwich\n\nGrilled or fried chicken breast between 2 halves of a bun. Australia = chicken burger. America = chicken sandwich\n\nWhole piece of steak between 2 slices of toasted bread. Australia = steak sandwich. America = I've never actually seen one on a menu.\n\nThinly sliced beef further chopped up and cooked then placed on a long roll with melted cheese. Australia = never saw one but we would probably call it hot beef and cheese roll. America = cheese steak sandwich\n\nI could go on, but I won't.\n==============================", "\n            === POST 9 ===\n            Title: [OC] Costco’s Operating Income Is Increasingly Driven by Merchandise Sales\n            Score: 1100 upvotes\n            Total Comments: 160\n            URL: https://www.reddit.com/r/dataisbeautiful/comments/1mlj7qx/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 657 | Comment: Meaning that they are selling more, or have higher margins?\n2. Score: 289 | Comment: I womder if this is an effect of goods inflation vs. membership fee inflation. Since i started going to costco 10-15 years ago, the fees have gone up like ~8% ($60 to $65). In that same time period the CPI has gone up more than 40%\n3. Score: 123 | Comment: Basically, it was said that Costco made money on membership sales. However, they're more traditional now with profits coming from selling items at profit.\n==============================", "\n            === POST 10 ===\n            Title: Salary raise expectations\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/BusinessIntelligence/comments/1mmhaze/\n            Content: No text\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 11 ===\n            Title: Analysing your SEO Metadata\n            Score: 0 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/BusinessIntelligence/comments/1mme516/\n            Content: I have always had a passion to help fix the internet. After all it is a mix of structured and unstructured data. The problem,  a lack of accurate metadata to support on page content.\n\nTo help understand the root cause:\n\n# Beyond Keywords: Why Deterministic SEO Principles Eliminate Hallucination\n\nThe SEO landscape is experiencing a fundamental shift. Traditional keyword-based optimisation, rooted in probabilistic guesswork, is giving way to deterministic approaches that leverage structured metadata and schema markup. This evolution isn't just about better rankings—it's about eliminating the \"hallucination\" that has plagued SEO for decades. Exacerbated by AI.\n\n## The Problem with Probabilistic SEO\n\nTraditional SEO operates on probability. We guess which keywords might work, estimate search volumes, and hope our content aligns with user intent. This approach creates several issues:\n\n- **Content-context disconnect**: Keywords often don't capture true user intent ( which is difficult to com\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 12 ===\n            Title: Does anyone use R Shiny at work ?\n            Score: 24 upvotes\n            Total Comments: 11\n            URL: https://www.reddit.com/r/BusinessIntelligence/comments/1mm36ib/\n            Content: I know Python is widely used, but I recently tried this approach. Honestly, it blows everything out including powerBI and tableau if you know some coding. We had to analyze very large datasets — over a million rows and more than 100 variables for 29 different datasets, around 100GB data.   A key part of the task was identifying the events and timeframes that caused changes in the target variable relative to others. A lot of exploratory analysis had to done in the beginning, where the data had to be zoomed in very close. Plotly in shiny was very helpful along with JavaScript functions to customize the hover behavior\n\n\nUsing R, along with its powerful statistical capabilities, Shiny and Plotly packages, made the analysis significantly easier. I was able to use Plotly’s event triggers to interactively subset the data and perform targeted analysis within the app itself. Data was queried from duckdb \n\nNo one in my company was aware of this approach before. After seeing it in action, and how\n\n            TOP COMMENTS:\n        1. Score: 9 | Comment: I used it years ago at work.  That's when I was department head, so got to choose.  These days, after I've switched jobs, leadership at most places will only consider software that's cool and popular, and if it has AI somewhere in the name of it.\n2. Score: 2 | Comment: We used to and then the dude got another job\n3. Score: 2 | Comment: shiny’s a sleeper hit for exactly that reason—if you can code, it wipes the floor with point and click tools for custom workflows  \nplus you own the logic instead of being boxed into whatever visual or calc options tableau/powerbi let you have\n\nbiggest wins: reproducibility, flexibility, and how fast you can go from concept to deploy  \ndownside is the learning curve for non coders, but in a team of analysts/engineers it’s a game changer\n\nThe [NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some sharp takes on picking the right tools for impact and getting your org to adopt them worth a peek!\n==============================", "\n            === POST 13 ===\n            Title: Quick thoughts on this data cleaning application?\n            Score: 0 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/BusinessIntelligence/comments/1mlxvhf/\n            Content: Hey everyone! I'm working on a project to combine an AI chatbot with comprehensive automated data cleaning. I was curious to get some feedback on this approach?\n\n* What are your thoughts on the design?\n* Do you think that there should be more emphasis on chatbot capabilities?\n* Other tools that do this way better (besides humans lol)\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 14 ===\n            Title: The dashboard is fine. The meeting is not. (honest verdict wanted)\n            Score: 8 upvotes\n            Total Comments: 22\n            URL: https://www.reddit.com/r/BusinessIntelligence/comments/1ml4qdw/\n            Content: *(I've used ChatGPT a little just to make the context clear)*\n\nI hit this wall every week and I'm kinda over it. The dashboard is \"done\" (clean, tested, looks decent). Then Monday happens and I'm stuck doing the same loop:\n\n* Screenshots into PowerPoint\n* Rewrite the same plain-English bullets (\"north up 12%, APAC flat, churn weird in June…\")\n* Answer \"what does this line mean?\" for the 7th time\n* Paste into Slack/email with a little context blob so it doesn't get misread\n\nIt's not analysis anymore, it's translating. Half my job title might as well be \"dashboard interpreter.\"\n\n# The Root Problem\n\nAt least for us: most folks don't speak dashboard. They want the so-what in their words, not mine. Plus everyone has their own definition for the same metric (marketing \"conversion\" ≠ product \"conversion\" ≠ sales \"conversion\"). Cue chaos.\n\n# My Idea\n\nSo… I've been noodling on a tiny layer that sits on top of the BI stuff we already use (Power BI + Tableau). Not a new BI tool, not another place\n\n            TOP COMMENTS:\n        1. Score: 35 | Comment: I mean, I think that’s exactly where our org is headed with the new stand alone copilot interface. We probably won’t focus on dashboards at all, just semantic layer so people can “google” their data answers without using any brain cells. Will it be accurate? No clue. I’ve been in data for 15 years. I’m starting to think people don’t actually give af about accuracy\n2. Score: 8 | Comment: I just assume either the dashboards are bad at telling the story or the stakeholders are idiots. I try to make my dashboards tell the story the way the stakeholders want it to be told. I add tabs that explain everything in detail and a tab for easily exporting tabular data into Excel if they need it.\n\nIt’s very rare for me to need to explain everything. \n\nBut my experience is at a F100 company, it might be a little different at a smaller company.\n\nMy gut instinct is if a stakeholder is too stupid to read a few charts then they are likely too stupid for their role. They wont be around long and I will never do their job for them.\n3. Score: 5 | Comment: Your idea is the actual Microsoft product strategy. \n==============================", "\n            === POST 15 ===\n            Title: When your team speaks 5 different data dialects\n            Score: 9 upvotes\n            Total Comments: 12\n            URL: https://www.reddit.com/r/BusinessIntelligence/comments/1ml3ida/\n            Content: It's interesting how a single metric can have 5 different meanings for 5 different people. Last month, we discussed \"conversion rate\" in a cross-department review. Sales thought it meant leads-to-customers. Marketing thought it referred to ad clicks to signups. Product saw it as trial-to-paid. The data team? We had our own definition.\n\nThis led to 20 minutes of back-and-forth, with everyone saying, \"Wait, that's not what I meant.\"\n\nThis situation happens more often than I’d like to admit. Each time, I wonder if our real problem isn’t data access but the language we use around data. You can have the best dashboard, but if everyone reads it in their own way, you’re just creating pretty graphs for confusion.\n\n\n\nWe’ve tried:\n\n\\- Creating a glossary in Notion (but half the team ignores it)\n\n\\- Adding metric definitions on the dashboards themselves (some people still skip them)\n\n\\- Holding weekly “data office hours” (where attendance is low)\n\n\n\nSometimes, I think the solution is less about t\n\n            TOP COMMENTS:\n        1. Score: 16 | Comment: You simply cannot use general colloquial phrases for measures. Everyone translates them however they see it rather than making sure their assumptions are correct. \n\nYou *have to* call it \"Lead to Customer Conversion Rate\",  \"Ad Click Conversion Rate\", etc. \n\n\"New Profit\" is a big one at my work. Everyone thinks of \"New\" as something different. Is it a customer that signed up this calendar year? Is it a customer that signed up sometime in the past 365 days? Is it a customer who signed up this month? The answer is yes, all of those are different types of \"new,\" so be clear on which type you're talking about in your measures and dashboards.\n2. Score: 5 | Comment: I can’t even get my team to decide what day is the beginning of the week\n3. Score: 5 | Comment: Having a data dictionary that clearly defines each metric helps but is often just another piece of dead documentation if you don't have regular discussions with the teams your dashboards serve.\n\nA proactive approach by teamleads/management/product management is necessary to keep most of the teams on the same page and is unfortunately an ongoing challenge.\n\nThe key group to invest in are the official (and non-official!) decision makers in the organization. If you can get them to understand how they can use the data and dashboards and actually employ the data to drive decisions, my experience is the teams themselves invest their time to understand the metrics as well. Because that understanding now affects their day-to-day.\n\nI would advise against using terms like just \"conversion\" or \"conversion rate\" on its own in your dashboards though. You can't police language in the organization but you can make sure you don't add to the confusion. Make sure you specify the metrics like \"add-to-click conversion rate\".\n\nI try to add buttons that give users context for the dashboards or even specific visualisations where i explain the data with explicit text like \"what's this?!\" or \"what am I looking at?!\" on the button.\n\nBut the main thing is, explain the data, in person, over, and over, and over, and over again. No way around it I'm afraid...\n\nBest of luck!\n==============================", "\n            === POST 16 ===\n            Title: If you could automate ONE annoying step in your reporting workflow, what would it be?\n            Score: 0 upvotes\n            Total Comments: 8\n            URL: https://www.reddit.com/r/BusinessIntelligence/comments/1ml01p1/\n            Content: Setting aside data quality for a second—what's the one repetitive task in your reporting process you'd automate instantly if you could?\n\nPersonally, I'm stuck on manual narrative creation—writing explanations that translate dashboards into actionable insights for execs.\n\nWould you trust a tool that auto-generated these narratives? What would it have to do (learn your internal KPIs, use company-specific language, etc.) to win your confidence?\n\n            TOP COMMENTS:\n        1. Score: 6 | Comment: Such a dumb thing but when I’m making dashboards I hate that when I have a list of metrics making metric - latest month, metric - MoM%, metric - YoY% \n\nSoooo annoying that I have to do this for each metric\n2. Score: 4 | Comment: Working at a company that builds AI agents and workflows, the manual narrative creation problem you mentioned is exactly what kills most reporting processes and honestly, most business intelligence tools completely ignore the \"so what\" question that executives actually need answered.\n\nThe automation I'd kill for is dynamic variance analysis that automatically identifies why metrics changed and provides business context. Not just \"sales dropped 15%\" but \"sales dropped 15% primarily due to delayed enterprise deals in Q4, with SMB segment actually growing 8% despite seasonal trends.\"\n\nFor narrative generation to work, the tool would need deep understanding of your business model, seasonal patterns, competitive landscape, and internal terminology. Generic \"insights\" are useless because they lack the business context that makes analysis actionable.\n\nThe trust factor comes from the system learning your company's specific reporting language and decision frameworks. If it can recognize that a 5% revenue dip in your SaaS business during January is normal but the same dip in March indicates a real problem, then it becomes valuable.\n\nMost automation tools are either too basic for real business intelligence or way too complex for everyday reporting workflows. The sweet spot is AI that understands your business metrics deeply enough to provide contextual analysis instead of just describing charts.\n\nI'd want the system to connect multiple data sources automatically and identify correlation patterns that human analysts miss. Like connecting customer support ticket volume to churn metrics to product release dates without manual analysis.\n\nThe key is making insights specific to your business instead of generic observations that any dashboard could provide.\n3. Score: 2 | Comment: I would ideally love to have a chat-based ai that can answer reliably on the report's data :)\n==============================", "\n            === POST 17 ===\n            Title: Everyone says that we need artificial intelligence, but nobody can explain what it really means for a real data analyst.\n            Score: 45 upvotes\n            Total Comments: 40\n            URL: https://www.reddit.com/r/BusinessIntelligence/comments/1mkujg0/\n            Content: Hey all, have you noticed how “AI” has become some sort of buzzword that everyone throws around? Lot of folks at my job say, “We should use AI for that,” but when you ask “for what, exactly?”—the room goes silent. Feels like AI is perceived as a magic fix without anyone really knowing how or why.\n\n\n\nI am curious, What are some real use cases where AI actually helped? And what are those “we want AI” moments that fell flat? I Would love to hear  your perspective on this?\n\n            TOP COMMENTS:\n        1. Score: 48 | Comment: It significantly, significantly reduces the learning curve and experience required to write any kind code. You still have to have *some* working knowledge, but you no longer need years of SQL experience to write straight forward queries to pull into Power BI for example. \n\nI still write all my own code, been doing it for a long time. But now I'll just write it quick and dirty, copy/paste into ChatGPT, and ask \"clean this up\" or \"make this more efficient\" or \"add one condition that does this\". Done in 15 seconds.\n2. Score: 8 | Comment: If the AI can be the equivalent of On-Prem and you feed it all the databases, it can potentially reduce the need for domain-specific analysts, have less of them. \n\nBecause you can ask in plain English for data and the AI will do the SQL code and/or help build the data warehouse. \n\nContext matters. As a DE I see myself using (soon) AI to help document existing workflows by tracking the data from source systems to unified Snowflake/Kimball data. Reverse engineering.\n\nA very simple AI will track all the SQL used in all reports and pipelines, and you ask for a result set in English, and if fed properly, will find an existing report out of hundreds or thousands what is very similar, and extrapolate any missing columns. \n\nThe business analysts would have the training responsibilities. A DE or sysadmin like me will build the LLM virtual machine for secure use within the company.\n3. Score: 7 | Comment: If you already handle Robotic Process Automation, then AI is just a more flexible version of this. \n\nAI does really well when you have a defined process, that has post ETL cleaned data, to make other processes in the business run. \n\nIf you treat AI like it's the dumbest fresh college hire, and leverage both coding expertise (object oriented frameworks) and project management, with well defined process documentation. AI can do incredible automations. \n\nFor example I consult with small businesses around their SEO. Because I have a well defined process, and the data is cleaned through an ETL I built, their A/B testing and campaigns now run about \\~10% better without outside intervention and outside the initial setup I spend about 30 mins a week on each account, instead of 4 hours. So I've been able to bring on twice as many clients and work about half as much. The prompt for this is about 3 pages so around 1500 words, I feed it a pdf explaining the SEO strategy, and upper and lower spend limits, as well as the process through the API. It leverages N8N and Claude.\n\nMost individuals are still just putting in prompts and expecting magic, we aren't there yet, but if you break down the process and have AI handle certain tasks, in an automated workflow. It takes a few human elements out, which in my experience so far has produced better results.\n==============================", "\n            === POST 18 ===\n            Title: What aspect of your work did you not think would require so much time?\n            Score: 0 upvotes\n            Total Comments: 8\n            URL: https://www.reddit.com/r/BusinessIntelligence/comments/1mk5eoq/\n            Content: I assumed that my days as a BI analyst would be spent delving deeply into data(learning,understanding,etc..) and identifying perceptive patterns. Rather, I've discovered that I'm wasting a large amount of my week just restating dashboards and charts to various executives and stakeholders. To be honest, I'm surprised at how much of my workflow is dominated by this manual translation. Which unforeseen task has grown more significant than you anticipated in your BI role?\n\n            TOP COMMENTS:\n        1. Score: 3 | Comment: Also, Op, the dirty secret of almost every data role is that people really just want something to point at. Or they want something that makes zero sense, like a pie chart with negative values.\n2. Score: 2 | Comment: ...have you tried inproving the charts?\n3. Score: 2 | Comment: Dashboards are for stakeholders…\n==============================", "\n            === POST 19 ===\n            Title: [Throwback Thursday] Exploring open-source alternatives to Confluence\n            Score: 0 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/BusinessIntelligence/comments/1mjuicm/\n            Content: No text\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 20 ===\n            Title: VBA Error Assistance Needed\n            Score: 0 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/excel/comments/1mmpiz5/\n            Content: I am using Macros for the first time and asked ChatGPT for assistance building one. I followed the instructions and run it but keep getting an error.\n\n**The error is \"Detected 12 teams. This Macro expects 13 teams. Continue?\". I have checked my reference worksheet and it has 13 teams with no extra spaces in the cells. Any suggestions on how I can fix this?**\n\nAlso open to suggestions on adjustments on the code since I know ChatGPT is definitely not perfect.\n\nHere are details about what my goal with the Macro is as well as the Macro code. Attached is a screenshot of the **Teams** Worksheet.\n\n**Goal:** Create an alternate WNBA 2025 Game Schedule to try to resolve players' concerns about current scheduling and it's impact on their health.\n\n**What the Code should do: G**enerate the full 2025 WNBA game schedule for 13 teams with:\n\n* **Balanced 44-game format** (4 games vs 8 regional opponents, 3 vs 4 distant ones)\n* **Regional clustering** to reduce travel\n* **2–4 days rest between games**,\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: /u/greenfae17 - Your post was submitted successfully.\n\n* Once your problem is solved, reply to the **answer(s)** saying `Solution Verified` to close the thread.\n* Follow the **[submission rules](/r/excel/wiki/sharingquestions)** -- particularly 1 and 2. To fix the body, click edit. To fix your title, delete and re-post.\n* Include your **[Excel version and all other relevant information](/r/excel/wiki/sharingquestions#wiki_give_all_relevant_information)**\n\nFailing to follow these steps may result in your post being removed without warning.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/excel) if you have any questions or concerns.*\n2. Score: 1 | Comment: \nI have detected VBA code in plain text. Please edit to put your code into a [code block](https://www.reddit.com/wiki/markdown#wiki_code_blocks_and_inline_code) to make sure everything displays correctly.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/excel) if you have any questions or concerns.*\n3. Score: 1 | Comment: I am guessing this line is the source of the error:\n\n    Set wsTeams = ThisWorkbook.Worksheets(\"Teams\")\n\nYou don't have a named range called Teams. If you do, it is not capturing all the teams.\n==============================", "\n            === POST 21 ===\n            Title: VBA for date stamp when TEL link is clicked\n            Score: 1 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/excel/comments/1mmolbf/\n            Content: If Col A has a formula =HYPERLINK(“TEL:”…), what is the code to insert the date and timestamp into Col B when the user clicks the link? Then Col C (D, E, etc.) if the user clicks it again?\n\nThank you in advance. \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: /u/RelevantPangolin5003 - Your post was submitted successfully.\n\n* Once your problem is solved, reply to the **answer(s)** saying `Solution Verified` to close the thread.\n* Follow the **[submission rules](/r/excel/wiki/sharingquestions)** -- particularly 1 and 2. To fix the body, click edit. To fix your title, delete and re-post.\n* Include your **[Excel version and all other relevant information](/r/excel/wiki/sharingquestions#wiki_give_all_relevant_information)**\n\nFailing to follow these steps may result in your post being removed without warning.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/excel) if you have any questions or concerns.*\n2. Score: 1 | Comment: Can you macro ctrl+shift+, ?\n==============================", "\n            === POST 22 ===\n            Title: What is the best way to identify double bookings?\n            Score: 3 upvotes\n            Total Comments: 13\n            URL: https://www.reddit.com/r/excel/comments/1mmnu92/\n            Content: I have a project management sheet that assigns employees to certain jobs on certain date ranges. I'm trying to get the sheet to warn us if we schedule the same worker on more than one job whithin the same day. In this example, there would be a conflict between lines 1 and 5. Different employees with overlapping date ranges are ok. \n\nhttps://preview.redd.it/l59wydf438if1.png?width=529&format=png&auto=webp&s=18f3c037059408379cc6dcfb411ea3f51c5f392f\n\n\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: /u/Cultural-Wonder-2735 - Your post was submitted successfully.\n\n* Once your problem is solved, reply to the **answer(s)** saying `Solution Verified` to close the thread.\n* Follow the **[submission rules](/r/excel/wiki/sharingquestions)** -- particularly 1 and 2. To fix the body, click edit. To fix your title, delete and re-post.\n* Include your **[Excel version and all other relevant information](/r/excel/wiki/sharingquestions#wiki_give_all_relevant_information)**\n\nFailing to follow these steps may result in your post being removed without warning.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/excel) if you have any questions or concerns.*\n2. Score: 4 | Comment: Try using the following formula in Conditional Formatting\n\nhttps://preview.redd.it/t58vu3h368if1.png?width=801&format=png&auto=webp&s=57d0bdcf019881eac9e0c2f367ecf7b796040eb7\n\n    =COUNTIFS($B$1:$B$6,$B1, $D$1:$D$6, \">=\"&$C1, $C$1:$C$6, \"<=\"&$D1)>1\n3. Score: 3 | Comment: Conditional formatting - duplicate values \n==============================", "\n            === POST 23 ===\n            Title: CELL-address function not working properly?\n            Score: 2 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/excel/comments/1mmmoxd/\n            Content: I do have a sheet with cell names in a range; assume Sheet2!$U$1:$AC$43.\n\nWhen I enter *=COUNTIF(Sheet2!$U$1:$AC$43;\"AB4\")* in a cell on Sheet3, the result is '1', which is expected.\n\nNow, when I fill on Sheet3 the range A1:BP38 with *=COUNTIF(Sheet2!$U$1:$AC$43;SUBSTITUTE(T(CELL(\"address\"));\"$\";\"\"))* the result in cell AB4 is not 1. How's that possible?\n\nPlaying around, when I just enter *=SUBSTITUTE(T(CELL(\"address\"));\"$\";\"\")* in cell A1, it will show 'A1'. But, when I then 'pull' to copy the function to the range A1:BP1, all cells A1:BP1 will suddenly show 'A1'. And again pulling to copy to cover the range A1:BP22, all cells in this range will show 'A1'. What's going on?\n\n  \n\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: /u/Simple-Chemist-4249 - Your post was submitted successfully.\n\n* Once your problem is solved, reply to the **answer(s)** saying `Solution Verified` to close the thread.\n* Follow the **[submission rules](/r/excel/wiki/sharingquestions)** -- particularly 1 and 2. To fix the body, click edit. To fix your title, delete and re-post.\n* Include your **[Excel version and all other relevant information](/r/excel/wiki/sharingquestions#wiki_give_all_relevant_information)**\n\nFailing to follow these steps may result in your post being removed without warning.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/excel) if you have any questions or concerns.*\n2. Score: 2 | Comment: You need to include the cell reference in the CELL function otherwise CELL function uses the \"active cell\", so use this formula in A1\n\n    =SUBSTITUTE(T(CELL(\"address\";A1));\"$\";\"\")\n==============================", "\n            === POST 24 ===\n            Title: Stocks and geography missing in Data Types\n            Score: 2 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/excel/comments/1mmm1nz/\n            Content: https://preview.redd.it/fx5ufoair7if1.png?width=1773&format=png&auto=webp&s=0d960f05e9e7d887bf22efe7d6fb0aab732c5d3b\n\nDo you guys have any idea why the stocks and geography doesn't appear? I tried removing the data types from the ribbon and tried putting it back and it still does not appear...\n\nUpdate: I changed my licence from microsoft office plus 2021 to microsoft 365... don't know what's the difference but it works now\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: /u/SzBaptiste26 - Your post was submitted successfully.\n\n* Once your problem is solved, reply to the **answer(s)** saying `Solution Verified` to close the thread.\n* Follow the **[submission rules](/r/excel/wiki/sharingquestions)** -- particularly 1 and 2. To fix the body, click edit. To fix your title, delete and re-post.\n* Include your **[Excel version and all other relevant information](/r/excel/wiki/sharingquestions#wiki_give_all_relevant_information)**\n\nFailing to follow these steps may result in your post being removed without warning.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/excel) if you have any questions or concerns.*\n2. Score: 1 | Comment: What's your version of Excel? [Excel data types: Stocks and geography](https://support.microsoft.com/en-us/office/excel-data-types-stocks-and-geography-61a33056-9935-484f-8ac8-f1a89e210877) are only in Excel 365 and Excel for the Web, iPad and Android. Your screenshot looks like neither of these.\n==============================", "\n            === POST 25 ===\n            Title: I am looking for a correction for a correction to my formula\n            Score: 3 upvotes\n            Total Comments: 10\n            URL: https://www.reddit.com/r/excel/comments/1mml50w/\n            Content: I have a formula that feels like Excel 101.\n\nI'm just multiplying values in a range:\n\"IMPRODUCT(B2,E2) -> (B31,E31)\"\n\nI'm then adding all the values in a range that are the product of that formula:\n\"=SUM(G3:G31)\"\n\nThe SUM function only ever comes out to 0. Can anyone advise where I failed? \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: /u/TennBornFilm - Your post was submitted successfully.\n\n* Once your problem is solved, reply to the **answer(s)** saying `Solution Verified` to close the thread.\n* Follow the **[submission rules](/r/excel/wiki/sharingquestions)** -- particularly 1 and 2. To fix the body, click edit. To fix your title, delete and re-post.\n* Include your **[Excel version and all other relevant information](/r/excel/wiki/sharingquestions#wiki_give_all_relevant_information)**\n\nFailing to follow these steps may result in your post being removed without warning.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/excel) if you have any questions or concerns.*\n2. Score: 6 | Comment: The arguments and results of the IMPRODUCT function are string representations of complex numbers (e.g. \"4-8i\"). To sum those, one needs to use the IMSUM function.\n3. Score: 3 | Comment: I'm guessing you need the `SUMPRODUCT()` function, not `IMPRODUCT()`\n\n    =SUMPRODUCT(B2:B31, E2:E31)\n==============================", "\n            === POST 26 ===\n            Title: Excel is my favorite software- I want to use it as a diary\n            Score: 7 upvotes\n            Total Comments: 13\n            URL: https://www.reddit.com/r/excel/comments/1mmjxly/\n            Content: I have all my databases on Excel including financial, movies, TV series and employee management. I want to use Excel as my diary for journaling. Will it work? I read about text wrap. \n\n            TOP COMMENTS:\n        1. Score: 12 | Comment: It's nonconventional.... you're limited to 32,767 characters in a given cell. It wouldn't be the most convenient for either making entries or reading past entries of significant size. Alt + Enter for line breaks will help you.... but there's no reason you couldn't use it.\n2. Score: 5 | Comment: Excel is a tool, and a particularly poor tool for what you’re describing. Perhaps look into tools made for word processing or notes. Can you? Probably. Should you? Probably not.\n3. Score: 3 | Comment: I use it since 2017, but it's quite schematic. Each raw it's a day, and I've divided every day in a column for morning, afternoon, evening. I've added a bonus column for when it happens something particular during the day for which I want to write more.\n\n\nI've a sheet for each year, and a recap sheet where it show what was happening =today() for each year.  \n==============================", "\n            === POST 27 ===\n            Title: plotting a specific clustered column\n            Score: 2 upvotes\n            Total Comments: 7\n            URL: https://www.reddit.com/r/excel/comments/1mmji4d/\n            Content: ok so, i have a table with 5 columns. column 1 is \"day\". column 2 and 3 are \"calls\" and \"calls 2, and columns 4 and 5 are \"online\" and \"online 2\". \"calls 2\" and \"online 2\" are a percentage of \"calls\" and \"online\".\n\nthe graph i would love to have is so that on the X axis it shows every day once, and on every day i want to have 2 bars. one bar showing \"calls\" and \"online\" as the total bar height, with \"calls 2\" and \"online 2\" being shaded/coloured portions within the entire graph. the Y axis being the value or \"calls\" or \"online\".\n\nfor \"calls 2\" and \"online 2\" i have absolute number but also percentages. not sure which one is better to use in excel.\n\nto show what i mean, i threw together this image quickly: https://i.imgur.com/GXwlNRl.png\n\nis this possible to do in excel? i am not sure how to accomplish this.\n\nwhen i put the entire table in excel, and highlight all columns except the \"days\" colums and create a stacked column, it gives me one bar for each day with all 4 values in it... so\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: /u/murfi - Your post was submitted successfully.\n\n* Once your problem is solved, reply to the **answer(s)** saying `Solution Verified` to close the thread.\n* Follow the **[submission rules](/r/excel/wiki/sharingquestions)** -- particularly 1 and 2. To fix the body, click edit. To fix your title, delete and re-post.\n* Include your **[Excel version and all other relevant information](/r/excel/wiki/sharingquestions#wiki_give_all_relevant_information)**\n\nFailing to follow these steps may result in your post being removed without warning.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/excel) if you have any questions or concerns.*\n2. Score: 2 | Comment: Your graphs and descriptions are vague... there's no legend nor data to intuit what you are trying to do in the graph you want. \n\nI assume per day one column represents calls and the other online. It's not clear to me from your post how you want to calculate the red portions... maybe something like:\n\n(Calls x (Calls / (Calls + Online))\n\nhttps://preview.redd.it/5ba0b91yb7if1.png?width=854&format=png&auto=webp&s=bb86e820db58e0b0e72ac0112494a512b4c2e7fb\n3. Score: 2 | Comment: It looks like you are trying to create a Clustered Stacked Column chart.\nThere are many youtube videos on this, but my personal favourite guide with a very detailed explanation is the one written by Jon Peltier here\nhttps://peltiertech.com/clustered-stacked-column-bar-charts/\n==============================", "\n            === POST 28 ===\n            Title: LAMBDA Function Game of Life\n            Score: 21 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/excel/comments/1mmj4ts/\n            Content: Wrote a no-VBA Game of Life spreadsheet, with configurable width, height, and starting state. Lambda function VSTACKs each step's frame into a named range, which is then indexed based on the step value shown in the video. Named lambdas below. I've left the boundaryType flag in as I plan to add neighbour-summing functions for different boundary conditions other than toroidal.\n\nhttps://i.redd.it/41h58k1567if1.gif\n\n        torusWrap = LAMBDA(v, n, MOD(v-1, n) + 1);\n    \n        torusSummer = LAMBDA(\n            width, height,\n            LAMBDA(\n                grid,\n                LET(\n                    row_i, SEQUENCE(height),\n                    col_i, SEQUENCE(width),\n                    gridShift, LAMBDA(\n                        grid_, dr, dc,\n                        LET(\n                            row_n, torusWrap(row_i+dr, height),\n                            col_n, torusWrap(col_i+dc, width),\n                            MAKEARRAY(height, width, LAMBDA(\n                        \n\n            TOP COMMENTS:\n        1. Score: 6 | Comment: Very cool but it should read \\*Conway's Game of Life (RIPIP [https://en.wikipedia.org/wiki/John\\_Horton\\_Conway](https://en.wikipedia.org/wiki/John_Horton_Conway)).\n2. Score: 2 | Comment: Nice job. Just an observation: I think `VSTACK` and `TAKE` are unnecessary here. If you define `calcSteps` as...\n\n    =LAMBDA(grid,boundaryType,steps,\n       REDUCE(grid, SEQUENCE(steps), LAMBDA(lastGrid,s, stepGrid(lastGrid, boundaryType)))\n    )\n\n... you shouldn't have to index the results from a named range. ;)\n\nOther approaches you may find interesting can be found here: [Utilizing Excel's turing capabilities to create Conway's 'Game of Life'](https://techcommunity.microsoft.com/discussions/excelgeneral/utilizing-excels-turing-capabilities-to-create-conways-game-of-life/4039893)\n3. Score: 1 | Comment: Acronyms, initialisms, abbreviations, contractions, and other phrases which expand to something larger, that I've seen in this thread:\n\n|Fewer Letters|More Letters|\n|-------|---------|---|\n|[LAMBDA](/r/Excel/comments/1mmj4ts/stub/n7z4yoy \"Last usage\")|[*Office 365*+: Use a LAMBDA function to create custom, reusable functions and call them by a friendly name.](https://support.microsoft.com/en-us/office/lambda-function-bd212d27-1cd1-4321-a34a-ccbf254b8b67)|\n|[REDUCE](/r/Excel/comments/1mmj4ts/stub/n7z4yoy \"Last usage\")|[*Office 365*+: Reduces an array to an accumulated value by applying a LAMBDA to each value and returning the total value in the accumulator.](https://support.microsoft.com/en-gb/office/reduce-function-42e39910-b345-45f3-84b8-0642b568b7cb?ui=en-US&rs=en-GB&ad=GB)|\n|[SEQUENCE](/r/Excel/comments/1mmj4ts/stub/n7z4yoy \"Last usage\")|[*Office 365*+: Generates a list of sequential numbers in an array, such as 1, 2, 3, 4](https://support.microsoft.com/en-us/office/sequence-function-57467a98-57e0-4817-9f14-2eb78519ca90)|\n|[TAKE](/r/Excel/comments/1mmj4ts/stub/n7z4yoy \"Last usage\")|[*Office 365*+: Returns a specified number of contiguous rows or columns from the start or end of an array](https://support.microsoft.com/en-us/office/take-function-25382ff1-5da1-4f78-ab43-f33bd2e4e003)|\n|[VSTACK](/r/Excel/comments/1mmj4ts/stub/n7z4yoy \"Last usage\")|[*Office 365*+: Appends arrays vertically and in sequence to return a larger array](https://support.microsoft.com/en-us/office/vstack-function-a4b86897-be0f-48fc-adca-fcc10d795a9c)|\n\nDecronym is now also available on Lemmy! Requests for support and new installations should be directed to the Contact address below.\n\n----------------\n^(*Beep-boop, I am a helper bot. Please do not verify me as a solution.*)  \n^([Thread #44748 for this sub, first seen 10th Aug 2025, 17:58]) \n^[[FAQ]](http://decronym.xyz/) [^([Full list])](http://decronym.xyz/acronyms/Excel) [^[Contact]](https://hachyderm.io/@Two9A) [^([Source code])](https://gistdotgithubdotcom/Two9A/1d976f9b7441694162c8)\n==============================", "\n            === POST 29 ===\n            Title: Random number generator acting up\n            Score: 2 upvotes\n            Total Comments: 13\n            URL: https://www.reddit.com/r/excel/comments/1mmieqc/\n            Content: For some reason, when I set my random number generator from 0 to 1, the top number is obscurely low, like 0.0000004863, but everything else is normal like 0.83727 or something. I'll drop a picture in the comments. Any idea why?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: /u/Disastrous_Egg4518 - Your post was submitted successfully.\n\n* Once your problem is solved, reply to the **answer(s)** saying `Solution Verified` to close the thread.\n* Follow the **[submission rules](/r/excel/wiki/sharingquestions)** -- particularly 1 and 2. To fix the body, click edit. To fix your title, delete and re-post.\n* Include your **[Excel version and all other relevant information](/r/excel/wiki/sharingquestions#wiki_give_all_relevant_information)**\n\nFailing to follow these steps may result in your post being removed without warning.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/excel) if you have any questions or concerns.*\n2. Score: 2 | Comment: How are you generating those numbers\n3. Score: 2 | Comment: Show the formula in the first cell there.\n==============================", "\n            === POST 30 ===\n            Title: Business focused data science\n            Score: 20 upvotes\n            Total Comments: 20\n            URL: https://www.reddit.com/r/datascience/comments/1mly9hm/\n            Content: As a microbiology researcher, I'm far away from the business world. I do more -omics and growth curves and molecular techniques, but I want to move away from biology.\n\nI believe the bridge that can help me do that is data. I have got experience with R and excel. I'm looking at learning SQL and PowerBI.\n\nBut I want to do it away from biology. The problem is, if I was to go from the UK, as a PhD microbiologist, and approach GCC consulting/business analyst recruiters, I get the sense that they'd scoff at me for thinking too highly of my \"transferrable skills\" and tell me that I don't have experience in the world of business.\n\nHow would I get myself job-ready for GCC business-focused data science roles. Is there anyone out there that has made the switch that can share some advice?\n\nThanks in advance\n\n            TOP COMMENTS:\n        1. Score: 30 | Comment: I can tell you as someone who hires data scientists, if someone like you was sat in front of me at interview, I’d be wanting to you to convince me that you’re ready half bake something to meet a deadline, rather than endlessly refine something which will never deliver.\n\nI’ve worked with DSs who made the move and hated it, and some who made the move and never even realised they weren’t able to make (the right kind) of progress.\n2. Score: 7 | Comment: Honestly it’s gonna be super hard in this market. I have a PhD in Math Evolutionary Bio and experience as a data scientist in clinical trials and it’s mostly just reporting, really no ML. Only thing I could get since I can’t get in other industries. I did projects to help me move into more tech focused roles that involved LLMs and data engineering, and really have not had any luck tbh. \n\nThat being said, if you want to be a data analyst, my suggestion is to focus on healthcare insurance companies. Your Microbio experience may be helpful because you maybe handling biological data. You should work on projects using SQL, Python, and Power BI that involve healthcare data, namely handling EHR datasets or just even calculating business metrics in the space. Do your research to get a lay of the land, and then choose a project and show an end to end data pipeline. Extract your data and transform using Python, and load your data into a database to analyze using SQL. Boom. First project.\n3. Score: 2 | Comment: I’m a data scientist at a biotech company and we make money off of growth curves and -omics. \n\nThere are even people in the R&D department just like you that use R. In my department we use python because we have things in production.\n==============================", "\n            === POST 31 ===\n            Title: Burnout, disillusionment, and imposter syndrome after 1 year in DS. Am I just an API monkey? Reality check needed.\n            Score: 73 upvotes\n            Total Comments: 31\n            URL: https://www.reddit.com/r/datascience/comments/1mluc12/\n            Content: Hey folks,\n\nI am about a year into my first data science job. It took roughly a year and more than 400 applications to land it, so the idea of another long search is scary.\n\nEarly on I worked with an internally built causal AI model that captures relationships for further analysis. I did not build the model. I ran experiments to make it more explainable and easier for others to use. I also built data orchestration pipelines using third party tools that are common in industry and cloud providers like AWS and GCP.\n\nThe last six months have shifted to LLM and NLP work. A lot of API calls, large text analysis. The next six months look even more LLM heavy since I am leading an internal tool build.\n\nOn paper there are wins:\n- I have led projects and designed tools from scratch.\n- My communication and client skills have improved.\n\n\nMy concerns:\n\n- I am not doing much classical DS or rigorous modeling.\n- LLM work often feels like API wrangling rather than technical depth.\n- Work life balance i\n\n            TOP COMMENTS:\n        1. Score: 89 | Comment: IMO, life is too short to work on weekends. If you start looking now, it may take you 6 months to land a role anyway. So no harm in starting to brush up on interview prep.\n2. Score: 40 | Comment: Most data science work is software engineering lite and data engineering. Modeling is a tiny sliver, and you often have to scope and sell modeling as something to work on in any company. If LLMs sell, then convince people to work on prompt experimentation frameworks, fine tuning, and representation modeling, for example. The latter is important for interviews and discussing what models you built in prior roles.\n3. Score: 22 | Comment: That’s about where you should be. You won’t get to do the really exciting stuff for another two or three years. You have to put in the hours and build your reputation first.\n\nEdit: new hires and entry levels always want to start doing the really exciting and fun stuff right off the bat. The issue is that such stuff also comes with a huge amount of responsibility and knowing the foundations and grunt work inside and out. It usually takes 3-5 years of grunt work and proving yourself, and realizing what you *don’t* know in order to get to do the stuff you actually trained to do.\n==============================", "\n            === POST 32 ===\n            Title: AI isn't taking your job. Executives are.\n            Score: 1108 upvotes\n            Total Comments: 127\n            URL: https://www.reddit.com/r/datascience/comments/1mlmwk0/\n            Content: If AI is ready to replace developers, why aren't developers replacing themselves with AI and just taking it easy at work?\n\nI'm a Director at my company. I'm in the meetings and helping set up the tools that cost people their jobs. Here's how they work:\n\n1. Claude AI writes some code\n\n2. The code gets passed to a developer for validation\n\n3. Since the developer's \"just validating\", he can be replaced with an overseas contractor that'll work for a fraction of the pay\n\nWe've tracked the tools, and we haven't seen any evidence that having Claude take a crack at the code saves anybody any time - but it does let us justify replacing expensive employees with cheap overseas contractors.\n\nYou're not getting replaced by AI.\n\nYour job's being outsourced overseas.\n\n            TOP COMMENTS:\n        1. Score: 319 | Comment: To validate anything in a larger system, you need to know how it works and why certain implementations were added. You need to know the logical and business context. And you can't learn that quickly. Most of the systems I have worked with lack comprehensive documentation and testing. So replacing a developer with contextual knowledge with someone cheaper will take years.\n2. Score: 78 | Comment: It’s the same playbook as past automation waves. The tool is secondary. The real change is the org deciding they can get 70% of the quality for 30% of the cost and calling it a win.\n3. Score: 58 | Comment: BS, LLM don't write complex code nor analysis. I wish I could use LLm models like you are saying but it does not work like that at all.\n\nPs.: I have a junior working for me who thinks he can vibe code all the way. I asked him to produce a **little** MVP for API. Dude, he made a multiple instance app over engineered at maximum. Something like dozens of files and THOUSANDS lines of code.I deleted everything and wrote a 100 line single app in flask. Yeah, good luck with vibe coding.\n==============================", "\n            === POST 33 ===\n            Title: Just bombed a technical interview. Any advice?\n            Score: 60 upvotes\n            Total Comments: 36\n            URL: https://www.reddit.com/r/datascience/comments/1ml6fxs/\n            Content: I've been looking for a new job because my current employer is re-structuring and I'm just not a big fan of the new org chart or my reporting line. It's not the best market, so I've been struggling to get interviews. \n\nBut I finally got an interview recently. The first round interview was a chat with the hiring manager that went well. Today, I had a technical interview (concept based, not coding) and I really flubbed it. I think I generally/eventually got to what they were asking, but my responses weren't sharp.* It just sort of felt like I studied for the wrong test. \n\nHow do you guys rebound in situations like this? How do you go about practicing/preparing for interviews? And do I acknowledge my poor performance in a thank you follow up email?\n\n*Example (paraphrasing): They built a model that indicated that logging into a system was predictive of some outcome and management wanted to know how they might incorporate that result into their business processes to drive the outcome. I ini\n\n            TOP COMMENTS:\n        1. Score: 47 | Comment: \"causation/correlation, so I talked about controlling for confounding variables and natural experiments.\"\n\n  \nYour post doesn't contain enough information to determine why you think this was wrong?  I mean conducitng natural experiments is one of the ways you try to get causal effects. Switch Back and Synthetic control methods for example are common ways people try to assess this.\n2. Score: 21 | Comment: I bombed a few. It is hard. I feel for you. I bombed one in April of 2022. But I got my current job in June of that year, and I love it. It’s gonna be ok, friend! You can learn and recover from this!\n3. Score: 10 | Comment: The best thing you can do is study up on the questions they asked and prepare for the next one. I have over a decade experience and a few years back I bombed an interview. It happens. \n==============================", "\n            === POST 34 ===\n            Title: Resources/tips for someone brand new to model building and deployment in Azure?\n            Score: 17 upvotes\n            Total Comments: 5\n            URL: https://www.reddit.com/r/datascience/comments/1mkzhvp/\n            Content: Context: my current company is VERY (VERY) far behind, technologically. Our data isn't that big and currently resides in SQL Server databases, which I query directly via SSMS.\n\nWhenever a project requires me to build models, my workflow would generally look like:\n\n1. Query the data I need, make features, etc. from SQL Server.\n2. Once I have the data, use Jupyter Notebooks to train/build models. \n3. Use best model to score dataset.\n4. Send dataset/results to stakeholder as a file.\n\nMy company doesn't have a dedicated Dev team (on-shore, at least) nor a DE team. And this workflow works to make ends meet. \n\nNow my company has opened up Azure accounts for me and my manager, but neither one of us have developed anything in it before.\n\nMicrosoft has PLENTY of documentation, but the more I read, the more questions I have, and I feel like my time will be spent reading articles rather than getting anything done.\n\nIt seems like quite a shift from doing everything \"locally\" like what we have been\n\n            TOP COMMENTS:\n        1. Score: 13 | Comment: first tip: ignore 90% of Azure’s menu  \nit’s a labyrinth built for enterprise IT guys, not data folks trying to ship models\n\nyour local → cloud shift should start small:\n\n1. **Azure ML Studio** — this is your Jupyter replacement in the cloud spin up a compute instance drop your notebooks there same workflow, now in Azure\n2. **Blob Storage** — dump raw data here instead of files on your laptop pull from blob, not SSMS (use Data Factory or just python SDK to move files if needed)\n3. **Azure SQL** — mirror the prod SQL server if possible keeps you from breaking live stuff while testing\n4. **ML Pipelines** — once you’ve got a model that works, wrap it in a pipeline to retrain or batch score you’re not deploying to the world yet you’re just creating repeatable steps\n\nskip reading endless docs  \nfind one end-to-end tutorial with *your stack* (SQL → notebook → model → endpoint)  \ncopy it  \nthen tweak it for your use case\n\n[NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some clean, no-bloat strategies on transitioning messy local workflows into clean cloud pipelines worth a peek\n2. Score: 5 | Comment: Checkout ProjectPro project templates.. you may not want to subscribe but you can refer to them for ideas at least. Look at how their projects use different Azure services to solve real world problems and see which one aligns with you. Explore the details on their page further.\n3. Score: 1 | Comment: I feel very seen by this post haha\n==============================", "\n            === POST 35 ===\n            Title: \"SemiAuto\" Fully Automated Machine Learning Lifecycle by Just API Calling\n            Score: 0 upvotes\n            Total Comments: 6\n            URL: https://www.reddit.com/r/datascience/comments/1mkov0u/\n            Content: So for the last 4 months I have been working on this project which was first supposed to be a upgrade of AutoML, but I later recognised it's potential.\n\nThis project could be one of the best things in ML reasearch, This project is just that good.\n\nFor context, I have the knowledge around ML for about 1.5 years now and thanks to the tools available, I have been able to build a grand project like this,\n\nThe Project's or you can say the Tool name is 'SemiAuto', A full fledged ML lifecycle Automation tool. It has 3 microservice, Regression, Classification, and Clustering.\n\nI have completely build the Version 1 of this project.\n\n\nIt has 6 parts, First ingest the Data.csv file and the target column.\n\nSecond choose whatever preprocessing you want to and apply them.\n\nThird use feature tools to build new features and then SHAP to select the amount of features you want.\n\nFourth choose any algorithm you want with the hyper params and build the model.\n\nFifth choose the optimization technique and g\n\n            TOP COMMENTS:\n        1. Score: 4 | Comment: Don't really want to dehype you on your project which you're passionate about, but a slight reality check.\n\nFirst, this likely won't be used for research. Research needs a high degree of customization, while this looks like a low-code (i.e. functionally limiting) wrapper aimed for non-ML product people or juniors.\n\nSecond, you should clearly document what exactly your tool is/will be capable of. Which input formats it can work with, what preprocessing steps and models are available, what kind of model optimization can be done, etc.\n\nThird, you didn't mention how do you interact with it. Is it a pypi package, or a web app, or do you run it in CLI, or something else? Open sourcing it would be a plus too.\n\nLastly, you say it's mind blowing and the best thing ever. That's a bold claim without solid evidence behind it, this might hurt your credibility. Also such hype combined with little technical detail suggests you maybe still be early in your ML career. Maybe try to gain more work experience first to better understand which parts of ML pipelines are the most problematic. Irl projects differ significantly from uni/online course practice projects.\n\nAnyway, don't be discouraged, this looks like a solid project, likely will attract attention of many hiring managers.\n2. Score: 2 | Comment: Hi, congratulations on this project. Please provide the link to try out.\n3. Score: 1 | Comment: Well, if you already have a data.csv with tabular data and a target you have done 99% of the work of a professional data scientist :D \n\nSo nice work, it's good you have learned a few things but I don't really see a useful application for this.\n==============================", "\n            === POST 36 ===\n            Title: How would you visualize or analyze movements across a categorical grid over time?\n            Score: 11 upvotes\n            Total Comments: 8\n            URL: https://www.reddit.com/r/datascience/comments/1mkmjje/\n            Content: I’m working with a dataset where each entity is assigned to one of N categories that form a NxN grid. Over time, entities move between positions (e.g., from “N1” to “N2”).\n\nHas anyone tackled this kind of problem before? I’m curious how you’ve visualized or even clustered trajectory types when working with time-series data on a discrete 2D space.\n\n            TOP COMMENTS:\n        1. Score: 16 | Comment: Is the probability of transition from one category to another time invariant?\n\n\nIf so, a discrete time Markov chain approach would be suitable.\n2. Score: 7 | Comment: If the time component is discrete then a Sankey is an option depending on your data and the end goal.\n3. Score: 4 | Comment: Do you think this is a graph problem?\n==============================", "\n            === POST 37 ===\n            Title: How do you analyse unbalanced data you get in A/B testing?\n            Score: 25 upvotes\n            Total Comments: 26\n            URL: https://www.reddit.com/r/datascience/comments/1mkdy7a/\n            Content: Hi \nI have two questions related unbalanced data in A/B testing. Would appreciate resources or thoughts. \n\n1. Usually when we perform A/B testing, we have 5-10% in treatment, after doing power analysis we get the sample size needed, we run tge experiment, by the time we get required sample size for treatment we get way more control samples, so now when we analyse, which samples do we keep in control group? For example by the time we collect 10k samples from treatment we might get 100k samples of control. So what to do now before performing t-test or any kinds of test? \n (In ML we can downsample or over sample but what to do in causal side) \n\n2. Again similar question Lets say we are performing test on 50/50 but if one variant get way more samples as more ppl come through that channel and common for users, hiw do we segment users such as way? And again which samples we keep once we get way more sample than needed? \n\nI want to know how it is tackeled in day to day, and this thing happen \n\n            TOP COMMENTS:\n        1. Score: 16 | Comment: There’s no need to downsample your control group. You get a bit more power with the larger group and you can still get all the same metrics for your significance testing. For sample size calculations, there are ways of adjusting for imbalanced sets, but you can simplify by using the smaller set as your sample size for all variants. \n\nIf you are getting more people in treatment than control when expecting 50/50, you have a sampling bias. Make sure you aren’t using business rules to approximate a balanced sample; users should be randomized. Ie if you have some users entering your app via paid marketing and half via organic, half of those marketing-attributable users should be in treatment and half of the organic users should be in treatment.\n2. Score: 5 | Comment: You need to assign to control and treatment randomly. It seems you are only selecting into the treatment random units from the population, and the rest is in the control? That's not how it works.\n3. Score: 1 | Comment: Isn’t there a paper by Netflix’s data science team on solving a similar problem, but with sampling over time and repeated p-testing?\n==============================", "\n            === POST 38 ===\n            Title: What elective course should I take\n            Score: 5 upvotes\n            Total Comments: 17\n            URL: https://www.reddit.com/r/datascience/comments/1mk7lpa/\n            Content: Hey all,\n\nAbout to start my last semester for my masters in computer science, with a concentration in AI. I’m a veteran data scientist, this is more of a vanity degree and an ability to say “yes I do have a masters degree” on a job application, but I have enjoyed the studying overall. \n\nI have room for one elective class, and I’m trying to decide what I should take. None of them that fit my schedule seem particularly appealing:\n\n- data analysis: hyper redundant given my background\n- computer networks: possibly useful, but I’d much rather learn something like distributed systems\n- intro to cybersecurity: maybe good, but seems like it would be mostly terminology and not so much a deep dive on anything \n- object oriented design: could be nice for refining my actual design choices, but programming seems like the least valuable skill to upskill on in computer science now (as compared to, say, cloud computing, which is and will continue to be good to know). \n\nIt’s not exactly the most pressi\n\n            TOP COMMENTS:\n        1. Score: 16 | Comment: Object oriented design would almost certainly be the most useful. Personally, I took a cryptology and security course as part of my CS minor that was _super_ fascinating, but mostly from a weird math perspective, so intro to cybersecurity could be interesting, but likely isn’t going to be useful material.\n2. Score: 9 | Comment: \\> programming seems like the least valuable skill to upskill on in computer science now\n\nThis could not be more wrong. LLMs are not useful if you aren't able to tell if they're producing good code or not. The fact that they can write the boilerplate for you means to stay relevant you need to be skilled at the bigger picture software design stuff. The fact that they're getting smarter means you need to deepen your knowledge to continue to use them effectively. It doesn't matter how good they get - as soon as you're taking the correctness of their code on faith, you're cooked. AI is a tool, not an outsourcing opportunity.\n\nProgramming and cloud computing are not competing disciplines. Cloud computing is the setting for programming. If you want to say, build a product that delivers inference from AI models, you need to be strong in both.\n\nIf you're aiming for job titles like ML Engineer or AI Engineer in your future, 1000% take the OOP class.\n3. Score: 7 | Comment: > Programing seems like the least valuable skill to up skill on in computer science now\n\nlol?\n==============================", "\n            === POST 39 ===\n            Title: Title: In a toxic dead-end job. Receive a job offer I'm not excited about. Is it unreasonable to turn down any job offer in this market?\n            Score: 87 upvotes\n            Total Comments: 58\n            URL: https://www.reddit.com/r/datascience/comments/1mk4wap/\n            Content: I've been in a role for a little over a year that's both very toxic and a bad fit for me. At this point, I'm basically tech lead managing a steadily growing group of people (started at 1, now it's 4) and multiple projects. I did not not ask for this type of role and did not get a title change or pay increase. I spend almost all of my day shielding my direct reports from absolutely unhinged requests from management. \n\nI have a PhD in statistics, and my previous roles were more R&D focused. My primary career motivation is to work on challenging, technical problems. I am looking for more Applied Scientist or Research Scientist type roles. Unfortunately, I'm not getting interviews for these kinds of jobs. I suspect a big reason is my location and inability to relocate right now\n\nI just got an offer with better pay and a seemingly healthier culture, but the work is still not aligned with my interests. Probably simple modeling and not a lot of technical depth. I’ve already turned down simila\n\n            TOP COMMENTS:\n        1. Score: 168 | Comment: Once you take the new role, you don't have to stay there either. Focus on you.\n2. Score: 59 | Comment: Take it. You know your current job is bad. The new one at least has a chance of being better and you get better pay\n3. Score: 42 | Comment: It sounds like you’re not doing the work you want to now anyway. Why not take more money and healthier culture, and continue to look for a job you really want?\n==============================", "\n            === POST 40 ===\n            Title: I'm a student learning Data Analytics and just finished my first big project – a Football Agent Influence Dashboard. Would love your feedback!\n            Score: 4 upvotes\n            Total Comments: 3\n            URL: https://www.reddit.com/r/analytics/comments/1mmkayv/\n            Content: Hey everyone,\nI've spent the last few weeks building this project from scratch to practice my data analytics skills, and I'd be grateful for any feedback or ratings from the community.\nThe Project: Football Agent Influence Dashboard\nThe idea was to go beyond typical football stats and look at the influence of player agents in the transfer market. I built a Python scraper (using BeautifulSoup and Requests) to collect transfer and agent data from Transfermarkt for the Premier League, \nAll the data is cleaned and stored in an SQLite database. The final dashboard is built with Dash and Plotly and features:\n * A \"Top 10 Agents by Total Deal Value\" chart.\n * Key spending metrics for each league.\n * A transfer network graph showing player-club connections.\n * A fully searchable data table of all the scraped data.\nThis was a huge learning experience for me, especially working through all the debugging on the scraper and building the interactive dashboard with callbacks.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules or isn't flaired correctly, [please report it to the mods](https://www.reddit.com/r/analytics/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/analytics) if you have any questions or concerns.*\n2. Score: 1 | Comment: would love to take a look on it, feel free to share a preview\n==============================", "\n            === POST 41 ===\n            Title: Is Tableau or PowerBI the more modern platform\n            Score: 56 upvotes\n            Total Comments: 60\n            URL: https://www.reddit.com/r/analytics/comments/1mm357m/\n            Content: Saw a company talk about migrating from legacy platforms (Tableau) to modern (PowerBI) was their mission and thought the two were rather synonymous - am I wrong here and has anyones company ever done something similar?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules or isn't flaired correctly, [please report it to the mods](https://www.reddit.com/r/analytics/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/analytics) if you have any questions or concerns.*\n2. Score: 172 | Comment: Tableau was bought by Salesforce and left to rot. Microsoft is still pouring billions into their Fabric Platform of which Power BI is the visualization layer.\n3. Score: 66 | Comment: I've seen (at different places)\nQlik to Tableau, \nCognos to Tableau, \nStreamlit to PowerBI, \nLooker to Omni\n\nI don't think anyone is happy with their current BI tool, whichever one it is 😄\n==============================", "\n            === POST 42 ===\n            Title: First Internship in Nonprofit Data Management. Is It Worth It for Analytics Career?\n            Score: 6 upvotes\n            Total Comments: 3\n            URL: https://www.reddit.com/r/analytics/comments/1mlh0be/\n            Content: I just got my first internship as a Development Intern at a nonprofit, where I’ll be managing their database, cleaning and organizing data, and assisting with research on funding opportunities.\n\nI know this internship doesn’t involve the more complicated data analytics skills like modeling, coding, or advanced analysis that I want to learn.\n\nMy long-term goal is to work in corporate analytics, and I’m planning a more analytics-focused internship next summer. Still, I’m conflicted about how relevant this role is for that path. I’ve spoken to a few people, and some say any experience is valuable, while others think this might not be the most solid experience to get. \n\nHas anyone else started in a nonprofit internship doing similar work? Was it helpful for your career in analytics or data science? I’d appreciate any advice/insights. \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules or isn't flaired correctly, [please report it to the mods](https://www.reddit.com/r/analytics/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/analytics) if you have any questions or concerns.*\n2. Score: 9 | Comment: I didn't start that way, but as a hiring manager - that is definitely an experience that stands out for me - it's not a project and it shows initiative, especially for something you believe in. \n\nWell done for starting!\n3. Score: 2 | Comment: Any internship is better than no internship IMO. This is also analytics focused it sounds like so that’s great. I worked for many years in nonprofit research and analytics and it was highly fulfilling and I made decent income still. With the recent US federal spending cuts I had to pivot to private sector but did not have too hard of a time doing so. You’ll be fine.\n==============================", "\n            === POST 43 ===\n            Title: I am Bookkeeper and VA and currently 3rd year data analytics nagtake po ako second degree online but lately sobrang confuse ako if bookkeeping or data analytics or Should I mix or any career path na aligns sa finance or bookeeping and data\n            Score: 0 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/analytics/comments/1mlfyol/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules or isn't flaired correctly, [please report it to the mods](https://www.reddit.com/r/analytics/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/analytics) if you have any questions or concerns.*\n==============================", "\n            === POST 44 ===\n            Title: The dashboard is fine. The meeting is not. (honest verdict wanted)\n            Score: 13 upvotes\n            Total Comments: 13\n            URL: https://www.reddit.com/r/analytics/comments/1ml4r6j/\n            Content: *(I've used ChatGPT a little just to make the context clear)*\n\nI hit this wall every week and I'm kinda over it. The dashboard is \"done\" (clean, tested, looks decent). Then Monday happens and I'm stuck doing the same loop:\n\n* Screenshots into PowerPoint\n* Rewrite the same plain-English bullets (\"north up 12%, APAC flat, churn weird in June…\")\n* Answer \"what does this line mean?\" for the 7th time\n* Paste into Slack/email with a little context blob so it doesn't get misread\n\nIt's not analysis anymore, it's translating. Half my job title might as well be \"dashboard interpreter.\"\n\n# The Root Problem\n\nAt least for us: most folks don't speak dashboard. They want the so-what in their words, not mine. Plus everyone has their own definition for the same metric (marketing \"conversion\" ≠ product \"conversion\" ≠ sales \"conversion\"). Cue chaos.\n\n# My Idea\n\nSo… I've been noodling on a tiny layer that sits on top of the BI stuff we already use (Power BI + Tableau). Not a new BI tool, not another place\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules or isn't flaired correctly, [please report it to the mods](https://www.reddit.com/r/analytics/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/analytics) if you have any questions or concerns.*\n2. Score: 25 | Comment: As an analyst, I really hate this phrase but, \"you're overthinking it.\"\n\nYou are over functioning in your capacity of offering business intelligence. If you are clearly reporting what is happening in any given area, and presenting analysis as to why, offered tips on how to use and read what you have presented, and the people who want to see this information cannot be bothered to read what is there, or lack the knowledge to understand it... You've done all there is to do. You cannot read or think for them. \n\n\"You can lead a horse to water, but you can't make it drink.\" They have to do their own work reading the dashboard and digesting it. If you're not careful, people will delegate doing all the work to you at the expense of their own understanding, and your career. \n\nNow if you wanted to learn how to make this happen for your own interests... Go ahead. But don't bother throwing effort down an endless black hole of \" I don't understand. Make it easier.\" Your function is not to understand for them. Your function is to offer them reasonably fast/accessible and accurate data that can help them make business decisions. You may have found the end of improvements possible at your current employer.\n\nYou are not wrong thinking that this is a translation issue. Can two people who speak different languages communicate if one doesn't want to bother making any effort? 'Everything in my language' is an unrealistic expectation. You have made an effort to translate. Wait until you see reciprocation.\n3. Score: 20 | Comment: I’m going to be honest, translating data into business insights is LITERALLY what you’re being paid to do. If they’re not getting it, it’s a communication failing on your part.\n\nThat said, I think turning your dashboard into a self-service tool rather than putting everything into PPTX could do a lot for you, if you’re willing to spend a significant amount of time on training.\n==============================", "\n            === POST 45 ===\n            Title: Multi touch attribution model is a mess - what's the alternative?\n            Score: 10 upvotes\n            Total Comments: 20\n            URL: https://www.reddit.com/r/analytics/comments/1mkyney/\n            Content: I'm at my wit's end with our MTA setup. Between iOS updates completely gutting our view-through data & the general signal loss we're all seeing, the outputs just feel like educated guesses at best.\n\r\nThe model keeps telling me to add more money into branded search and retargeting, but I feel that's not where real growth is coming from. \n\nIt feels like I'm just measuring who's already showing up at the finish line, not what convinced them to start the race. It gives zero credit to our podcasts, our community efforts, or any of our TOF video campaigns.\n\r\nSo, what are you all actually using instead of traditional MTA? How are you measuring incremental impact in a way that you can confidently stand behind?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules or isn't flaired correctly, [please report it to the mods](https://www.reddit.com/r/analytics/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/analytics) if you have any questions or concerns.*\n2. Score: 11 | Comment: The biggest change for us was the conversation with our finance team. They don't care about attribution models. \n\nBut when we started showing them charts that said, 'This channel has a proven incremental ROI of 3:1, here's the lift study to back it up,' we started getting the budgets we actually needed. It changes the entire conversation when you can prove causality. \n\nAnd MTA doesn’t give that. I would highly recommend you shift to causal attribution. That will help you\n3. Score: 3 | Comment: Not using Lifesight, that’s for sure. Mediocre platform with annoying marketing techniques, particularly in this sub. You can do waaaaay better than them.\n==============================", "\n            === POST 46 ===\n            Title: Simple expense manager\n            Score: 1 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/analytics/comments/1mkyhqc/\n            Content: Which is the best expense tracker app that you use?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules or isn't flaired correctly, [please report it to the mods](https://www.reddit.com/r/analytics/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/analytics) if you have any questions or concerns.*\n2. Score: 2 | Comment: Google sheets\n3. Score: 1 | Comment: For 100 USD he created an app for you\n==============================", "\n            === POST 47 ===\n            Title: Why AI engines cite some websites over others - key patterns I'm tracking\n            Score: 2 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/analytics/comments/1mkygt2/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules or isn't flaired correctly, [please report it to the mods](https://www.reddit.com/r/analytics/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/analytics) if you have any questions or concerns.*\n==============================", "\n            === POST 48 ===\n            Title: Offering mentoring and training in Data science\n            Score: 0 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/analytics/comments/1mkxnsg/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules or isn't flaired correctly, [please report it to the mods](https://www.reddit.com/r/analytics/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/analytics) if you have any questions or concerns.*\n2. Score: 7 | Comment: with no links to your experience why should one look for your mentorship?\n3. Score: 1 | Comment: For which kind of projects?\n==============================", "\n            === POST 49 ===\n            Title: MVP of a marketing mix model\n            Score: 2 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/analytics/comments/1mkrq2k/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules or isn't flaired correctly, [please report it to the mods](https://www.reddit.com/r/analytics/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/analytics) if you have any questions or concerns.*\n2. Score: 1 | Comment: I want to understand whether the channels  perform differently than what we get from last click, get an idea about the potential without commiting to a months-long 100.000€ project\n==============================", "\n            === POST 50 ===\n            Title: First Look at GPT-5 on an NL2DAX Benchmark\n            Score: 4 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/PowerBI/comments/1mmjc3o/\n            Content: Latest benchmark on how well ChatGPT handles DAX code.\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 51 ===\n            Title: Enough with the \"rate my dashboard\" threads\n            Score: 232 upvotes\n            Total Comments: 53\n            URL: https://www.reddit.com/r/PowerBI/comments/1mmeq60/\n            Content: I'm tired of seeing these “Please rate my first PBI dashboard” posts every single day.\nYou totally miss the point.\n\nDesign and appearance matter for user adoption, but say nothing about:\n- The quality (or messiness) of your semantic model\n- How you handled your data with layers of Dax, MQuery, and Fabric notebooks all at once.\nProbably all in dax, when it should not, not documented and not reusable.\n- How maintainable your report is\n- How reusable your data is\n\nSpend less time perfecting the look of your report, and more time on understanding data modeling, building solid technical foundations, and making your data truly reusable and adaptable.\n\nPowerBI is NOT about doing the best looking report!!\nIt's about modeling and processing the data in the most efficient way.\nThis is what will make you valuable on the job market.\n\n\n\n            TOP COMMENTS:\n        1. Score: 70 | Comment: I think they're generally okay if it's clearly from a beginner, getting feedback from experts definitely helps you learn faster. \n\nBut I swear a lot of the 'first dashboard' posts do not look like first attempts, they're using advanced functionality and complex hacks to make the UI more aesthetic or interactive. Like why do they feel they need to lie about their skills?\n2. Score: 48 | Comment: Ooooh, can we get some \"Please rate my first semantic model\" threads?\n3. Score: 34 | Comment: They are much better than the daily “how do I learn power bi” threads\n==============================", "\n            === POST 52 ===\n            Title: Power BI as a Sales Tool??\n            Score: 14 upvotes\n            Total Comments: 6\n            URL: https://www.reddit.com/r/PowerBI/comments/1mmdj4y/\n            Content: https://reddit.com/link/1mmdj4y/video/bptjim3cn5if1/player\n\nI'm excited to share a demo of a recent project I worked on using **Power BI Desktop**. This demo (not the actual report, of course!) showcases how we leveraged Power BI’s capabilities to create dynamic dashboards for our team.\n\nIn this project,  I used Autodesk’s Power BI visualization tools to build two tailored dashboards:\n\n* One for **executives**, providing a high-level view of sales performance with interactive 3D models.\n* Another for our **sales team**, offering detailed, actionable insights to drive their daily work.\n\nWhile this is a simplified version, the actual dashboard is packed with advanced features and is honestly pretty awesome—I can’t wait to share more someday!\n\nI’d love to hear your thoughts! Are you using Power BI with 3D visualizations in your industry? Have you explored similar applications, or is this something that could add value to your work? Drop a comment or DM me to share your experiences or idea\n\n            TOP COMMENTS:\n        1. Score: 6 | Comment: You can combine it with a synoptic panel as clickable offices for example. This would be relevant for shopping malls\n2. Score: 3 | Comment: It turned out great!\n\nI dream of making a similar project to visualize the stages of construction of an object with monitoring of the materials used in construction\n3. Score: 3 | Comment: I had no idea you could do this. My brain has exploded. This is awesome!\n==============================", "\n            === POST 53 ===\n            Title: power BI for data analysis\n            Score: 0 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/PowerBI/comments/1mmc0rh/\n            Content: Hi there \na simple question but important for me \nfor a data analysis junior how much time i need to learn about power Bi \nand what is the essentials that I have to know ?\nThanks.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: After your question has been solved /u/Left-Nature-9116, please reply to the helpful user's comment with the phrase \"Solution verified\".\n\nThis will not only award a point to the contributor for their assistance but also update the post's flair to \"Solved\".\n\n------\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PowerBI) if you have any questions or concerns.*\n==============================", "\n            === POST 54 ===\n            Title: First Power BI dashboard, Feedback please\n            Score: 4 upvotes\n            Total Comments: 7\n            URL: https://www.reddit.com/r/PowerBI/comments/1mmbnq7/\n            Content: https://preview.redd.it/uhnqb6jx35if1.png?width=1201&format=png&auto=webp&s=72f6a9d04a50ba11b1cef80566e8569ed3f30a14\n\nhttps://preview.redd.it/rhif6lyy35if1.png?width=1187&format=png&auto=webp&s=fcf2e7ded4f2b81a1a0ed1a4aa4ca6b0f207eee8\n\n\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: For those eager to improve their report design skills in Power BI, the Samples section in the sidebar features a link to the weekly Power BI challenge hosted by [Workout Wednesday](https://www.workout-wednesday.com/power-bi-challenges/?utm_source=reddit&utm_medium=social_media&utm_campaign=r_powerbi), a free resource that offers a variety of challenges ranging from beginner to expert levels. \n\nThese challenges are not only a test of skill but also an opportunity to learn and grow. By participating, you can dive into tasks such as creating custom visuals, employing DAX functions, and much more, all designed to sharpen your Power BI expertise.\n\n------\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PowerBI) if you have any questions or concerns.*\n2. Score: 1 | Comment: Nice!!!\n\nFor the driver comparison, which visual are you using? And how to set it up like this?\n3. Score: 1 | Comment: Looks great. One thing to keep in mind that I learned is they won’t always be based on what you want to show, it’ll be based on what questions need to be answered. I have built quite a few in the past only for it to not be really used because I thought I knew what people wanted.\n==============================", "\n            === POST 55 ===\n            Title: What exactly is my job title…\n            Score: 16 upvotes\n            Total Comments: 13\n            URL: https://www.reddit.com/r/PowerBI/comments/1mm62p7/\n            Content: Serious question. I’ve been working on an accounting team for a while, so my title in the company system is “Accountant”. However what I actually do instead of accounting work is this:\n\n- create/maintain different sorts of automated workflows, macros, code etc. to pull data consistently and quickly (whether it’s for actual accounting tasks directly or for reporting)\n- develop power BI reports with some of this data to make the data more accessible (and look prettier/give better insights)\n\nBased on what comes up on Google, I’m guessing “BI Analyst”. But I’m not sure if there is a more fitting job title.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: After your question has been solved /u/brycejk27, please reply to the helpful user's comment with the phrase \"Solution verified\".\n\nThis will not only award a point to the contributor for their assistance but also update the post's flair to \"Solved\".\n\n------\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PowerBI) if you have any questions or concerns.*\n2. Score: 10 | Comment: Business Intelligence Analyst, IT Analyst, Finance controller, Reporting Consultant.\n\nOrient towards the department you want to align with.\n3. Score: 3 | Comment: BI Analyst, Data Manager, Business Analyst, Commercial Analyst are all roles I've been given on various projects to the client.\n\nMy official title at work is a Project Manager but it's just a empty title and I might as well be called Head Data Boy or Excel Guy.\n==============================", "\n            === POST 56 ===\n            Title: Don't reference the table name after double-checking\n            Score: 1 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/PowerBI/comments/1mm4rb5/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: After your question has been solved /u/Hamza0059, please reply to the helpful user's comment with the phrase \"Solution verified\".\n\nThis will not only award a point to the contributor for their assistance but also update the post's flair to \"Solved\".\n\n------\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PowerBI) if you have any questions or concerns.*\n2. Score: 1 | Comment: Check the “examples” section of the documentation.\n\nI believe the issue is that you are putting your table name in brackets when it should be in single quotes.\n\nExample:\n\n    = COUNTROWS('Orders')\n\n\nhttps://learn.microsoft.com/en-us/dax/countrows-function-dax\n==============================", "\n            === POST 57 ===\n            Title: ¿Cómo hago para que un mapa coroplético Microsoft Bing funcionen en un Power Bi cuando el origen de los datos es en una carpeta de SharePoint ?\n            Score: 2 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/PowerBI/comments/1mm44ln/\n            Content: Tengo un dashboard en Power BI cuyo origen de datos, inicialmente, era un archivo de Excel (xlsx) almacenado en un equipo local. En esa configuración, el visual de mapa coroplético de Microsoft Bing mostraba correctamente todos los municipios de Colombia en su ubicación correspondiente, con el color asignado según el valor de cada dato. Ahora, al cambiar el origen al mismo archivo ubicado en SharePoint, el mapa dejó de representar la totalidad de los municipios. Anteriormente me funcionaba con \\[municipio\\] & \", \" &\\[depto\\] & \", Colombia\" pero ahora no me ubica todos los municipios. Ayudaaa\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: After your question has been solved /u/Grand_Money_982, please reply to the helpful user's comment with the phrase \"Solution verified\".\n\nThis will not only award a point to the contributor for their assistance but also update the post's flair to \"Solved\".\n\n------\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PowerBI) if you have any questions or concerns.*\n==============================", "\n            === POST 58 ===\n            Title: How do you handle report change requests and stakeholders that make changes on their own?\n            Score: 5 upvotes\n            Total Comments: 7\n            URL: https://www.reddit.com/r/PowerBI/comments/1mm2o8z/\n            Content: I’m a PBI developer for a sales org with a small team under me and communicate primarily with international stakeholders who are sales analysts. They are in different time zones. \n\nCurrently, we use Microsoft Lists to track new report and report change requests. The stakeholder submits a requests with necessary info, assigns a priority level, and I update the status as it moves through the process and provide updates when relevant. This was working fine until I noticed one particular stakeholder will assign all of her asks as top priority, demand a specific due date, while also altering the ask almost daily.\n\nThis same stakeholder has taken it upon themselves to make changes to reports such as layout, slicers, visible tabs, and charts without requesting it or consulting me first. Major changes that are not built correctly nor communicated adequately. \n\nHow do you handle these situations? What are best practices? This is my first time being responsible for the request process. I don’t w\n\n            TOP COMMENTS:\n        1. Score: 12 | Comment: >This was working fine until I noticed one particular stakeholder will assign all of her asks as top priority, demand a specific due date, while also altering the ask almost daily.\n\nThe issue here is that the team responsible for taking requests and making the updates (your team) should assign the priority levels. End users should not dictate whether their request is more important than the requests of others.\n\n>This same stakeholder has taken it upon themselves to make changes to reports such as layout, slicers, visible tabs, and charts without requesting it or consulting me first. Major changes that are not built correctly nor communicated adequately.\n\nWhy do they have the permissions in the workspace or to the specific report allowing this? \n\nThey shouldn't have permissions to make changes period. If it's a requirement that they do have those permissions, then it needs to be clearly stated that any alterations made outside of the appropriate request channel will add significant time to any fixes much less updates. \n\nMoreover, I'd make it abundantly clear that any updates made by them are not supported, and if they request updates to the report, your team will make updates to the most recent version your team was responsible for.\n2. Score: 4 | Comment: Your team should assign priority levels and, imo, stakeholders shouldn't have edit permissions on the List once their request is made. \n3. Score: 4 | Comment: Understand that once you give in to their demands, they will keep asking for more and if you say no down the line, they will view and treat you as the problem and try to escalate.\n\nSteps you can take to mitigate the problem put out a general message with guidelines including:\n\n\\-any changes to existing requests will result in revised delivery times.    \n\\-when all requests are assigned the same priority level, your department will decide the order in which requests are treated.  \n\\-due dates are determined by your department, but stakeholders are encouraged to list their desired date.  \n\\-modified reports become the responsibility of the person introducing the changes as the reports no longer follow your departments format, guidelines, and standards.  \n\n\nIt's a clear don't be an asshole message that normal people will understand and that you can fall back to \"sorry it's policy\" when you ignore all her asks for the next month until she gets the point and falls in line.  It covers your ass by laying down the rules to make it fair for everyone, not being rude, and not targeting her.  So now if she escalates you can point to your policies and how they make it fair for everyone and that you can't favor one person.\n==============================", "\n            === POST 59 ===\n            Title: How do you work with your business ?\n            Score: 2 upvotes\n            Total Comments: 7\n            URL: https://www.reddit.com/r/PowerBI/comments/1mm18sw/\n            Content:  You spend weeks building what you think is the perfect report, nail all the technical specs, and deliver it, only for the stakeholder to say, \"This is great, but it's not quite what I had in mind.\" It feels like bridging that gap between a business need and a technical spec is a constant battle. A \"simple\" request often hides a dozen complex decisions about data sources, logic, and security that stakeholders haven't even thought about.It's an exercise in trying to solve the real business problem, not just the one they initially described. I'm curious how you all handle this. What are your go-to strategies for gathering stakeholder requirements and avoiding that painful rework cycle? I am interested in hearing gaps from platform to platform and business to stakeholder  to developer to end user .\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: After your question has been solved /u/Twinuno_, please reply to the helpful user's comment with the phrase \"Solution verified\".\n\nThis will not only award a point to the contributor for their assistance but also update the post's flair to \"Solved\".\n\n------\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PowerBI) if you have any questions or concerns.*\n2. Score: 4 | Comment: Kurt has a good blog post  \n[https://data-goblins.com/power-bi/report-requirements](https://data-goblins.com/power-bi/report-requirements)\n3. Score: 4 | Comment: This is on you for not getting stakeholder input during the whole process.  Involve the people who will be using the report early and often.\n==============================", "\n            === POST 60 ===\n            Title: Data field in tableau from a tabby python script\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/Tableau/comments/1mlpwng/\n            Content: No text\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 61 ===\n            Title: Data field in tableau from a tabby python script\n            Score: 2 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/Tableau/comments/1mlpw9t/\n            Content: I have a calculated field that contains a python script. The script results in a single row or cell of text data. It looks like a single cell that contains a paragraph of text, lets call it text result. I want to take text result and parse out ID numbers into a file that contains the one ID number per row. I tried using regexp operators but they throw an error saying 'can't do this on another database file', it's like tableau thinks text result as a new database file. Desired end result, be able to parse out the ID numbers and use as a filter on original database file. Any ideas?\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 62 ===\n            Title: Weekly /r/tableau Self Promotion Saturday - (August 09 2025)\n            Score: 3 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/Tableau/comments/1mlh4cu/\n            Content: Please use this weekly thread to promote content on your own Tableau related websites, YouTube channels and courses. \n\nIf you self-promote your content outside of these weekly threads, they will be removed as spam. \n\nWhilst there is value to the community when people share content they have created to help others, it can turn this subreddit into a self-promotion spamfest. To balance this value/balance equation, the mods have created a weekly 'self-promotion' thread, where anyone can freely share/promote their Tableau related content, and other members choose to view it.\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 63 ===\n            Title: The dashboard is fine. The meeting is not. (honest verdict wanted)\n            Score: 0 upvotes\n            Total Comments: 10\n            URL: https://www.reddit.com/r/Tableau/comments/1ml4p5s/\n            Content: *(I've used ChatGPT a little just to make the context clear)*\n\nI hit this wall every week and I'm kinda over it. The dashboard is \"done\" (clean, tested, looks decent). Then Monday happens and I'm stuck doing the same loop:\n\n* Screenshots into PowerPoint\n* Rewrite the same plain-English bullets (\"north up 12%, APAC flat, churn weird in June…\")\n* Answer \"what does this line mean?\" for the 7th time\n* Paste into Slack/email with a little context blob so it doesn't get misread\n\nIt's not analysis anymore, it's translating. Half my job title might as well be \"dashboard interpreter.\"\n\n# The Root Problem\n\nAt least for us: most folks don't speak dashboard. They want the so-what in their words, not mine. Plus everyone has their own definition for the same metric (marketing \"conversion\" ≠ product \"conversion\" ≠ sales \"conversion\"). Cue chaos.\n\n# My Idea\n\nSo… I've been noodling on a tiny layer that sits on top of the BI stuff we already use (Power BI + Tableau). Not a new BI tool, not another place\n\n            TOP COMMENTS:\n        1. Score: 19 | Comment: So… everything you said is real and true and it is your job.  That layer you described is you.  If you can make it programmatically, great.  But it won’t work in my business. It will only work where you are with the current stakeholders. \n\nFor this to work, you would have to have tightly integrated LLM with an insane semantic layer.  You’d basically have to have every user explain what every metric meant to them, then have the LLM make a user specific description for every user.  This is actually technically possible now, but would still be very challenging to build and maintain. \n\nBut natural language analytics has been a thing for years.  About 10 years ago, someone in the community made a completely paragraph readout dashboard. Where it was just paragraphs. \n\nThe problem is that you are fighting two forces:\n\n1 people don’t care\n\n2 people do care\n\nIf you put a ton of text on your dashboard, people will ask you to remove it eventually.  \n\nIf tell people what to do with the numbers, they will get defensive about thier jobs. \n\nIf you don’t tell them what to do, they will think you don’t know what you are doing. (even though it is NOT your job to execute)\n\nToo simple? Not useful.\nToo deep? Can’t understand. \n\nWalking the tight rope on ALL of these concepts and more is the job.  \n\nThis is also why this isn’t an IT job. It’s an internal design and consulting job.\n\nMy suggestion is to have chat gpt or copilot re write your complaint into  accomplishments, skills, and goals and use it to show your value.  Then just find everything funny instead of annoying.\n2. Score: 11 | Comment: The issue I’ve found is that rarely if ever does a dataset have the qualitative, or industry, or company context needed to write meaningful analysis. \n\nSure, an AI might be able to write basic analysis of “this category is up 12% driven by this segment of data etc etc etc” \n\nBut it probably doesn’t know that last month you had a fallout with one of your retailers over price increases, so they’ve pulled back your stock as retaliation. Or that there’s a children’s flu news article just come out, and so children’s medicine sales are going up, or something else that’s less quantifiable, but equally important to insight. \n\nThis is the key to insightful analysis, and something that really needs a human with industry and company knowledge to carry out. \n\nSure, maybe someone has a perfect dataset with ALL that extra info in. But my company doesn’t, and neither does yours, or most other people’s. \n\nAs a result, you are (at least for now) the missing piece you are looking for.\n3. Score: 7 | Comment: This sounds like a real time saver! Just be SO FUCKING CAREFUL about loading sensitive information into third party tools.\n\nIt's a little sus that you've posted this across \\~20 subreddits. Bot or stealth marketing?\n==============================", "\n            === POST 64 ===\n            Title: When your team speaks 5 different data dialects\n            Score: 0 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/Tableau/comments/1ml3ihr/\n            Content: It's interesting how a single metric can have 5 different meanings for 5 different people. Last month, we discussed \"conversion rate\" in a cross-department review. Sales thought it meant leads-to-customers. Marketing thought it referred to ad clicks to signups. Product saw it as trial-to-paid. The data team? We had our own definition.\n\nThis led to 20 minutes of back-and-forth, with everyone saying, \"Wait, that's not what I meant.\"\n\nThis situation happens more often than I’d like to admit. Each time, I wonder if our real problem isn’t data access but the language we use around data. You can have the best dashboard, but if everyone reads it in their own way, you’re just creating pretty graphs for confusion.\n\n\n\nWe’ve tried:\n\n\\- Creating a glossary in Notion (but half the team ignores it)\n\n\\- Adding metric definitions on the dashboards themselves (some people still skip them)\n\n\\- Holding weekly “data office hours” (where attendance is low)\n\n\n\nSometimes, I think the solution is less about t\n\n            TOP COMMENTS:\n        1. Score: 10 | Comment: Can I ask- what's your caper? This is your third post in 4 days, you post to multiple BI subs - same thing at the same time - and don't interact with the comments. \n\n\nAre you building blog content, are you building a list of names to message after, do you just like reading the replies? \n2. Score: 2 | Comment: This is written by ChatGPT without question\n==============================", "\n            === POST 65 ===\n            Title: If you could automate ONE annoying step in your reporting workflow, what would it be?\n            Score: 1 upvotes\n            Total Comments: 17\n            URL: https://www.reddit.com/r/Tableau/comments/1ml01kr/\n            Content: Setting aside data quality for a second—what's the one repetitive task in your reporting process you'd automate instantly if you could?\n\nPersonally, I'm stuck on manual narrative creation—writing explanations that translate dashboards into actionable insights for execs.\n\nWould you trust a tool that auto-generated these narratives? What would it have to do (learn your internal KPIs, use company-specific language, etc.) to win your confidence?\n\n            TOP COMMENTS:\n        1. Score: 15 | Comment: Copy paste special formatting.\n2. Score: 13 | Comment: Tableau formatting and templating in general sucks. Like if I want to change all headers to a different font and color, I have to do them individually unlike PowerPoint which has templates.\n3. Score: 3 | Comment: The automated Narrative tool currently in pilot in Power BI is pretty great.\n\nSomething similar in Tableau would be more useful than the AI stuff they are currently pushing.\n==============================", "\n            === POST 66 ===\n            Title: Trying to make idiot proof dashboards has made me a better designer (plus it's fun)\n            Score: 37 upvotes\n            Total Comments: 7\n            URL: https://www.reddit.com/r/Tableau/comments/1mkzhbl/\n            Content: I'm not sure if designer is the exact word for it. Solution builder? Tableau developer? \n\nAnyway. I work with fairly technical data daily. Emissions, energy, that kind of stuff.\n\nEach time I have to improve upon old dashboards (whether it be mine or someone else's that I've inherited), it presents a new challenge for me. Moreover, if I get a new request for a dashboard, I consider the following points that I've learned over the years:\n\n- the stakeholders viewing my dashboards \n\n- the technical knowledge (or lack thereof) of these stakeholders \n\n- what questions are being asked?\n\n- what questions haven't been asked but can offer equally important insights?\n\n- how long would it take for someone to understand, navigate through and understand the metrics?\n\n- can an old person or a college student understand the dashboards? If not, what can I improve to make it idiot proof?\n\n- adding annotations, descriptive texts and tooltips definitely help. I do not shy away from them. I also utilise tit\n\n            TOP COMMENTS:\n        1. Score: 13 | Comment: It doesn't load well on my Smartphone (Nokia handheld)\n2. Score: 5 | Comment: After 20 years what I've learned is they will just promote bigger idiots.\n3. Score: 1 | Comment: My biggest issue has always been “I want all of these bells and whistles, and my data sources are absolutely massive, but I want my reports to load in the blink of an eye.”  We’re talking filters parameters built on filters created with various calculations pulling from multiple data sources running multiple years’ worth of data. But if changing any of those filter takes more than a few seconds to load, then we need to fix it….\n==============================", "\n            === POST 67 ===\n            Title: Data Quality issue Extract v Live Connection\n            Score: 2 upvotes\n            Total Comments: 6\n            URL: https://www.reddit.com/r/Tableau/comments/1mkx7ck/\n            Content: I have an issue where I have the exact same workbook, one of which is a live connection and the second is an extract.  Apart from that these are identical.  But the numbers on them for some metrics are different (not all of them though).\n\nHas anyone else seen this before or have any ideas as to the cause?\n\n            TOP COMMENTS:\n        1. Score: 2 | Comment: What is the timing on the data refresh? If you refresh the extract then immediately compare it to the live copy, are you still seeing significant differences?\n2. Score: 2 | Comment: You don't happen to have a filter applied when the extract is generated/refreshed, do you? When you go to 'Edit Data Source' check that there aren't any filters applied. If there aren't any, try generating an extract on the live version of the workbook and see how it looks.\n\nhttps://preview.redd.it/20ja5ofbethf1.png?width=456&format=png&auto=webp&s=07b13e4b0ace36d0333756cc4c01fd5a9df29d62\n3. Score: 2 | Comment: OP do you know if the records are updated often? That is, data being changed in the backend \n==============================", "\n            === POST 68 ===\n            Title: Everyone says that we need artificial intelligence, but nobody can explain what it really means for a real data analyst.\n            Score: 54 upvotes\n            Total Comments: 26\n            URL: https://www.reddit.com/r/Tableau/comments/1mkujyj/\n            Content: Hey all, have you noticed how “AI” has become some sort of buzzword that everyone throws around? Lot of folks at my job say, “We should use AI for that,” but when you ask “for what, exactly?”—the room goes silent. Feels like AI is perceived as a magic fix without anyone really knowing how or why.\n\n\n\nI am curious, What are some real use cases where AI actually helped? And what are those “we want AI” moments that fell flat? I Would love to hear  your perspective on this?\n\n            TOP COMMENTS:\n        1. Score: 28 | Comment: AI is a buzz word that company decision makers are just throwing around at the moment.  Don’t get me wrong, AI will definitely be a big part of society and it is probably going to be the biggest change since the internet.  However, it is not there yet and many people need to understand data literacy better to fully grasp how AI can help.  Basically, what the intended use for the end stakeholders is to simply ask questions on a type of AI interface based on the database.  However, first the database has to be really clean in order for it to be accurate.  For most companies, that is rarely the case.  So you will still need people to clean the data before being loaded in.  AI may be able to do that someday but it can’t right now, at least effectively.  Second, the executives still need to be able to understand the context behind the data and how to prompt AI.  I do not have confidence the majority of executives are comfortable in being able to do that.  Maybe the ones who are more data-inclined can do it, but that is not most executives.  Data analysts will still be needed for at least for the near future, depending on how fast AI progresses\n2. Score: 28 | Comment: First I’d like to get people to login to tableau and look at the actual reports, then we can talk about AI\n3. Score: 21 | Comment: Recently someone in my team sent round an email to the department, there was a response from an upper manager saying they should have put the email through AI to make it better, he followed saying he put the email in chat gpt and asked it to review the email and it scored it 5.5 out of 10. \n\nMy colleague ever the pedantic one, proceeded to put the email through chat gpt 10 times in incognito browsers using the same prompt the manager did, he got 10 different scores and sent all of them back in an email. \n\nThat's the pointless use case of AI. \n\nI have personally used it for when I couldn't remember some DAX I needed for something and it was helpful, I'd didn't give the exact answer needed but reminded me and I built it up from that reminder\n==============================", "\n            === POST 69 ===\n            Title: What aspect of your work did you not think would require so much time?\n            Score: 22 upvotes\n            Total Comments: 10\n            URL: https://www.reddit.com/r/Tableau/comments/1mk5dd9/\n            Content: I assumed that my days as a BI analyst would be spent delving deeply into data(learning,understanding,etc..) and identifying perceptive patterns. Rather, I've discovered that I'm wasting a large amount of my week just restating dashboards and charts to various executives and stakeholders. To be honest, I'm surprised at how much of my workflow is dominated by this manual translation. Which unforeseen task has grown more significant than you anticipated in your BI role?\n\n            TOP COMMENTS:\n        1. Score: 30 | Comment: Trying to work out if the reason I can't achieve what I want is because Tableau can't do it, Tableau should do it but it's a bug, Tableau can do it but requires you to go about it in a nonsensical way that's completely unintuitive or if it's me just being thick. \n\nEasily lose a morning because of that.\n2. Score: 19 | Comment: Acting as the mediator between different business stakeholders who each think that _their_ hand-crafted-for-best-KPI-result filters/business rules/etc should be the ones implemented into the overall dashboard suite.\n3. Score: 16 | Comment: Usually it's convincing the users to use the dashboard that they specifically asked me to make, instead of asking me to use the dashboard I made them to retrieve the number they want\n==============================", "\n            === POST 70 ===\n            Title: Stuck on naming my Business / Brand\n            Score: 1 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/smallbusiness/comments/1mmpvz9/\n            Content: I’m starting a small business selling **dog shampoo** in the U.S. and Canada, with plans to expand into **dog treats and other pet care products**, and I need help coming up with a brand name. \n\nI need something 1 or 2 words, catchy, memorable, and easy to say/spell, unique enough to trademark in both countries, and not so specific that it locks me into shampoo only.\n\nI’ve already tried AI tools and even hired a naming agency, but neither gave me results I loved, so I’m hoping the community can bring some real-world suggestions.\n\nThank you!\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*\n==============================", "\n            === POST 71 ===\n            Title: How do you all handle clients who don't pay on time? Looking for strategies...\n            Score: 1 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/smallbusiness/comments/1mmptua/\n            Content: Dealing with a client who's 3 weeks late on payment right now 😑\n\nGot me thinking - what do you all do when clients are late? Do you have a system?\n\nPut together a short survey to see how everyone handles this: [https://forms.gle/MHH7k2g2PsPCq4Yn8](https://forms.gle/MHH7k2g2PsPCq4Yn8)\n\nReally curious about:\n\n\\- How common this issue is\n\n\\- What tools/methods work best\n\n\\- How much time we all waste on this\n\nAnyone have success stories or horror stories to share?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*\n==============================", "\n            === POST 72 ===\n            Title: I lost my dev job and now work night shifts. So I built this $4.99 name tool to take back control.\n            Score: 2 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/smallbusiness/comments/1mmpt9c/\n            Content: I worked as a developer for 7 years. Last year, I was laid off.  \nBecause of loan pressure, I had no choice but to take a night shift customer support job.\n\nThe constant night shifts have taken a toll on me physically.  \nI have a family history of heart issues, and recently I’ve been feeling chest discomfort more and more often. Mentally, it’s been exhausting.  \nTo make things worse, when I requested sick leave, my manager was clearly unhappy about it and refused to approve it.\n\nI’ve had enough of this draining and meaningless routine.\n\n  \nSo I used what little energy I had after work to build a small tool that might help me take back some control of my life. \n\nIt helps people understand what their name might communicate to others, especially in first impressions, professional settings, and cross-cultural situations.\n\n# 👥 Who it’s for\n\n* New parents looking to choose an English name that feels right for their baby\n* Adults curious about the origin, meaning, and impression their name gi\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*\n2. Score: 1 | Comment: 🔗 Here’s the tool: [https://www.bypaw.net/](https://www.bypaw.net/)\n\nIt’s currently just $4.99. If it sounds useful to you, I’d really appreciate the support.\n==============================", "\n            === POST 73 ===\n            Title: How to promote your book even after no response from advertising\n            Score: 1 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/smallbusiness/comments/1mmpjqm/\n            Content: I’m a college student and I have created a handwritten solution book in a question answer format regarding the 20 year previous year question papers solution for the subject. It includes theoretical and practical exams notes. I printed 20 copies in march”25 from my savings and since then have sold only 3 copies in last 5 months i.e till August”25 . I created a message with its salient features and a sample pdf to be forwarded in gc on WhatsApp. But through online mode I’m able to sell only 1 copy. The other 2 copies were sold by going behind my juniors and explaining them the need and salient features. But this also resulted from approaching 10 juniors. I recently created an advertisement regarding the book and its Similarities in the questions of the recent examination which explains how many questions are repeated from the pyq paper . But still there’s no reply from our junior . Me and friends also called about 10 juniors but fail to pitch them\n\nWhat else can be done so that I can se\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*\n==============================", "\n            === POST 74 ===\n            Title: Roast my website — I can take it… probably\n            Score: 3 upvotes\n            Total Comments: 6\n            URL: https://www.reddit.com/r/smallbusiness/comments/1mmpg15/\n            Content: I just launched my bookkeeping/tax prep website: [**www.htxbookkeeping.net**]()\n\nI own two boba shops myself, so I know firsthand how messy the back office can get when you’re busy running a business. Now I’m trying to help other café owners and small business owners get their books in order so tax season isn’t a nightmare. But after staring at this thing for hours on end, I can’t tell if it’s good… or if I’ve just grown attached to it like a houseplant I forgot to water.\n\nSo please, roast away:\n\nDoes it look trustworthy and professional right off the bat?\n\nIs it crystal clear what I do and who I help?\n\nAnything that makes you want to click away instantly?\n\nWould YOU reach out based on this site?\n\nPlease don’t hold back — I promise I can handle the truth.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*\n2. Score: 4 | Comment: Super minor - I would use a sans-serif font (like on your contact page)\n3. Score: 3 | Comment: It’s ok.\n\nPick a pronoun on the site - is it “my” or “our”? \n\n“Our” makes you seem bigger and more established.\n\nI’d take the services menu lists and make it easier to tell what’s added on at each level -“everything in the Basic plan, plus:”\n\nJust do t expect a tiny web site to drive business. You’re going to have to do sales work.\n==============================", "\n            === POST 75 ===\n            Title: Do small businesses really spy on customers online? Let’s be honest here…\n            Score: 0 upvotes\n            Total Comments: 5\n            URL: https://www.reddit.com/r/smallbusiness/comments/1mmpbv2/\n            Content: Okay, I’ll just say it — I think most small and medium businesses do search for customer info online, even if they don’t openly admit it.\n\nChecking LinkedIn, Facebook, Google reviews, maybe even digging through public records — it’s all technically “public info,” but where’s the line between research and straight-up creeping?\n\nI want to know:\n1. Do you look up potential clients before working with them?\n2. How far is too far when it comes to digging into their online presence?\n3. Have you ever found something that completely changed your decision to work with someone?\n4. Is this smart business… or just bad ethics?\n\nNo judgement (okay, maybe a little) — but be honest. What’s your take?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*\n2. Score: 3 | Comment: I don’t know if that’s the definition of spying on somebody\n\nNo, I’m not googling every customer who walks into my store to learn about them or dig into their lives, but it makes sense to learn about a customer (most of my customers are businesses)\n\nSo if I have a contact at ABC corporation, I might check their LinkedIn page to see what other jobs they might’ve had \n\nAnd believe it or not customers using your definition, spy on well business employees are owners… but I don’t accept the premise of it being spying\n\nAre you saying you’ve never went to a store and googled the employees name you were working with and checked out their Facebook \n\nAs a rule, I don’t think I spy on customers, but I’ll research a company. I’m doing business with the find out ways I can maximize our relationship\n\nBut I have been guilty of googling a vendor, for example .. if there’s somebody I talk to on the phone every time I call to place an order I might google their name out of curiosity is that spying on them?\n3. Score: 2 | Comment: I think you may suffer from paranoia.\n\nSmall businesses don’t have time to google everyone. If you are asking for a quote and they have some concerns about if it’s worth the time to actually respond to you I can see someone googling you. That might happen maybe 1/500 times? \n\nRelax,  random businesses don’t care about you that much. \n==============================", "\n            === POST 76 ===\n            Title: Small biz owners, what’s the No 1 thing you wish could be made ridiculously simple?\n            Score: 0 upvotes\n            Total Comments: 5\n            URL: https://www.reddit.com/r/smallbusiness/comments/1mmozoo/\n            Content: As someone who works with hundreds of small business I’ve seen a lot but I wonder if there are some  common things between these small biz owners, could be finance related, marketing related or operational related. \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*\n2. Score: 3 | Comment: Health insurance, both the cost and complexity.\n3. Score: 1 | Comment: Shift scheduling for multiple jobs (up to 10 different positions) in the store based on training for said jobs and written around their availability and hours wanted to work.\n==============================", "\n            === POST 77 ===\n            Title: Home bakery owners making under 10k, which licenses do you have to operate?\n            Score: 1 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/smallbusiness/comments/1mmoov2/\n            Content: In my state, if you gross under 10k you can file for a cottage food licensing exemption. However, I want to make sure I do have the right permits and such.\n\n\nBasically, I’m trying to operate entirely online and ship to other states which i think is problematic. I’m technically not “selling” my baked goods and am instead collecting donations to fund everything. Then I have those interested fill out an order form.\n\nI am currently looking into commercial kitchens in my area per previous posts and advice. But other than that, what can I do to protect myself? Do I need an LLC? \n\nI have a food handler’s permit and I completed a health and safety course.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*\n==============================", "\n            === POST 78 ===\n            Title: [Nebraska] Amend Trade Name Application\n            Score: 1 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/smallbusiness/comments/1mmo28u/\n            Content: I messed up my DBA but it has been approved, now I need to file an Amendment. Does the publication deadline requirement start over once I submit the Amendment or does it stay with the original trade name application?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*\n2. Score: 1 | Comment: When you called the Nebraska Secretary of State office and asked, what did they tell you?\n==============================", "\n            === POST 79 ===\n            Title: Business owners: what’s been the hardest part of using AI automations in your business?\n            Score: 0 upvotes\n            Total Comments: 7\n            URL: https://www.reddit.com/r/smallbusiness/comments/1mmnwhb/\n            Content: Hey everyone,\n\nI’m curious to hear from business owners who’ve already added AI automations into their operations — whether that’s for sales, marketing, customer service, admin, or anything else.\n\nAfter the initial hype and setup, what’s been your experience so far?\n\n\\- What parts have worked well and genuinely saved you time/money?\n\n\\- What’s been harder than expected?\n\n\\- Have any new bottlenecks or frustrations popped up since going “AI-powered”?\n\n\\- If you could wave a magic wand and fix one AI-related issue, what would it be?\n\nCurrently doing a research report on the implementation of AI in businesses and would love your guys input.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*\n2. Score: 4 | Comment: You’ve made this identical post 7 times so far  \n\nDid you have a more specific “how to fix my small business “ question …..  \n\n\n….. or you just want us to do your school homework for you?\n3. Score: 2 | Comment: Ugh\n==============================", "\n            === POST 80 ===\n            Title: Co-Pilot (Enterprise version) for Marketing. What’s doable and what’s not AI-wise?\n            Score: 4 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/marketing/comments/1mmlxhz/\n            Content: Please, no Microsoft naysayers. This is a practical question. I’m CMO of a B2B firm and organizationally there is a strong preference for security reasons to utilize Co-Pilot (paid version) for as much as possible at our 250 person firm. We are M365 shop. I am looking to develop a list of what CP can and can’t do Marketing task/activity wise. If you’ve had to do this exercise, would love to see what you’ve come up with.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*\n2. Score: 2 | Comment: Hoping you get some responses here; I too am interested!\n3. Score: 1 | Comment: Same here. Also B2B tech CMO and would like to here more.\n==============================", "\n            === POST 81 ===\n            Title: Has anyone here run multichannel outreach with Lemlist?\n            Score: 3 upvotes\n            Total Comments: 5\n            URL: https://www.reddit.com/r/marketing/comments/1mmkk9v/\n            Content: I usually handle cold email campaigns manually or through lightweight automation, but it’s not scalable when running multiple lists and follow-ups. I’m testing tools that can manage sequences across email and LinkedIn without turning into a full CRM, and Lemlist came up in my search.\n\nThey have a 14-day free trial, so I’m considering putting it through a live campaign. If you’ve used it, how’s the deliverability, personalisation options, and LinkedIn automation compared to other outreach platforms?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*\n2. Score: 1 | Comment: [removed]\n3. Score: 1 | Comment: [removed]\n==============================", "\n            === POST 82 ===\n            Title: Should a company that operates in 4 regions only focus on improving marketing in one stable region?\n            Score: 1 upvotes\n            Total Comments: 5\n            URL: https://www.reddit.com/r/marketing/comments/1mm4oc0/\n            Content: Fictional company.\n\nPreviously, marketing expenditures have increased to be significantly higher compared to that of the competitors. A stable region is one that has kept its market share constant throughout the years. Last year, marketing expenditures were reduced as the company was like to go into default. On the other hand, market share decreased by 1% in other 3 regions due to these cuts.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*\n2. Score: 1 | Comment: It's hard to know without the specifics. However, a stable region is often associated with the maturity stage in the product lifecycle, usually followed by decline. And we usually don't want to rely too much on that region because then the company is expected to decline too.\n\nIf possible, I want to have a combination with other region. For example, a region which isn't stable yet and still has potential for a lot of growth.\n3. Score: 1 | Comment: [removed]\n==============================", "\n            === POST 83 ===\n            Title: New Job Listings\n            Score: 3 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/marketing/comments/1mlxk27/\n            Content: Are you looking to hire? \n\nShare your opening to the marketing professionals here on r/marketing. Please include title, description, full-time or part-time, location (on-site location or remote), and a link to apply. \n\n[Don't forget to add to our community job board for more exposure](https://lookingformarketing.com/jobs).\n\nIf you are looking to be hired, this is not the place to post that and your post will be removed.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*\n2. Score: 1 | Comment: [removed]\n3. Score: 1 | Comment: I'm hiring marketers specifically with Reddit experience, in US timezones. My dms are open!\n==============================", "\n            === POST 84 ===\n            Title: What AI for marketing purposes?\n            Score: 22 upvotes\n            Total Comments: 63\n            URL: https://www.reddit.com/r/marketing/comments/1mltdlx/\n            Content: Always used ChatGPT ever since its launch without even considering anything else. After this week's lackluster ChatGPT 5 update I found myself looking at alternatives... and quickly realized I've no clue how to actually compare the two (or some other AI I haven't considered).\n\nSo just wondering what the reddit marketing community is using for their daily marketing related tasks?\n\nWith \"marketing related tasks\" I mean anything you might find yourself needing help with at work, not just writing or coding.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*\n2. Score: 37 | Comment: I just cancelled my ChatGPT subscription and switched to Claude. Creativity and copywriting skills are next level. Only frustrating thing is the limit is quite low, even after paying for the subscription\n3. Score: 20 | Comment: I feel like there's a lot of shallow understanding of AI in this thread. \n\nChatgpt, Claude, Gemini etc are all LLMs which is really only a portion of the AI landscape. I work solely in a Google Cloud stack so the LLMs i use are always a version of Gemini (it's contextual memory is far superior compared to other LLMs on the market, and when you're a heavy user, this is incredibly important). \n\nOne of the misunderstandings i see a lot is people saying \"don't use it for generating copy\". Sure, I wouldn't use chatgpt to write articles for me from a simple prompt, but I will 100% use the custom thought leadership agent I built for clients to generate copy because that's exactly what it was trained to do. It's been trained to conduct in depth interviews and then generate long form content in the companies tone of voice.\n\nChatgpt, Gemini, Claude or any other LLMs aren't what's going to be taking people's jobs. It's the custom agents that are built on top of the LLMs that will be taking people's jobs. I'm currently working with a client on a custom agent that is driven by structured datasets pulled from all their business systems. CRM, xero, MailChimp, OneDrive + office data is all fed to a SQL database and used by the agent as it's data stores. The business owner can now ask it real time questions on processes and procedures and it helps to improve operations. On our end, we are monitoring the questions and answers coming back from the agent to drive the future development. \n\nThese agents can now trigger webhooks and invoke functions so once trained you can set them to automate digital processes and this is what's replacing humans.\n==============================", "\n            === POST 85 ===\n            Title: Is it appropriate to do outreach on WhatsApp?\n            Score: 0 upvotes\n            Total Comments: 30\n            URL: https://www.reddit.com/r/marketing/comments/1mlk4ps/\n            Content: I'm interested to hear your views.\n\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*\n2. Score: 26 | Comment: If I get a cold reach out on my WhatsApp I’m blocking the number and reporting it as spam, but maybe that’s just me.\n3. Score: 7 | Comment: No\n==============================", "\n            === POST 86 ===\n            Title: Roofing Company \"Ad\"\n            Score: 13 upvotes\n            Total Comments: 13\n            URL: https://www.reddit.com/r/marketing/comments/1mlh8pk/\n            Content: Spotted this on a run. Before tiles, and then the After tiles.\n\nFirst time seeing this type of advertising presented this way.\n\nAnyone seen this before?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*\n2. Score: 19 | Comment: Without the added context, I would have no idea what I were looking at in this image.\n3. Score: 8 | Comment: Amateurish, hack-job image, definitely could be improved, but those who are looking for roofing service would know enough and that's the point. I've seen pages with visual style from '99 that sells way more products than super-refined, beautiful landing pages.\n==============================", "\n            === POST 87 ===\n            Title: What sales percentage works best between 25% and 50% off?\n            Score: 4 upvotes\n            Total Comments: 16\n            URL: https://www.reddit.com/r/marketing/comments/1mle8hw/\n            Content: Hi, I run an online jewelry business and am needing to put on a flash sale to cover some unforseen costs, so I need to give a pretty deep discount, I would prefer not to cut it in half though, and 25% seems like it won't really catch peoples attention and think \"wow, I should get this before the chance is gone\" So are there any sweet spots that people respond to well in that range? Thanks\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*\n2. Score: 11 | Comment: Honestly prob not the answer you want but it’s never about the number. It’s about what that particular segment of customers wants, how you market it and the value of the product you’re offering. \n\nExample - if you email all of your previous customers with a loyalty / reward sale with 25% off the same collection they purchased from previously, that will likely perform better than a blanket 40% off that you throw at everyone.\n3. Score: 5 | Comment: 40% always worked (sports retail)\n==============================", "\n            === POST 88 ===\n            Title: Meta: Automatic audience a/b test\n            Score: 5 upvotes\n            Total Comments: 3\n            URL: https://www.reddit.com/r/marketing/comments/1ml8o32/\n            Content: I created a campaign and selected a/b test but rather than selecting my own variable I just selected “audience” for Meta to choose how it tests. \n\nCurrently Meta’s test is outperforming my original campaign by about 50%, but the problem is I don’t know what meta changed about the audience. I’ve checked both adsets side by side but see no difference, seems like a black box. \n\nIs there a way to see what meta changed about its test so I know how to better focus my ads in future campaigns?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*\n2. Score: 1 | Comment: If you follow reputable marketers/academics, you'd know that a meta a/b test is not a a/b test. \n\nThe samples are not random;, it's really an \"A and B\" test that is incomparable statistically meaning the effet  would be statistically the same if you just ran 2 ads with different setups that you yourself selected.   \n  \nTLDR: They lie by not telling the full story, who could have thunk.\n==============================", "\n            === POST 89 ===\n            Title: What have you found most effective for finding influencers to partner with, without dropping hundreds on those expensive influencer marketing platforms?\n            Score: 3 upvotes\n            Total Comments: 8\n            URL: https://www.reddit.com/r/marketing/comments/1ml83lc/\n            Content: Everything I can find either says \"Use this platform!\" and the platform looks great, but is like $200 / month, or they say \"Just search hashtags in Instagram,\" which doesn't feel very effective.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*\n2. Score: 2 | Comment: manual research (like hashtags on IG, or other ways directly on your platform of choice) and manual outreach. \n\nit is the way, and it is effective, but it may not be as efficient.\n3. Score: 1 | Comment: If you have existing customers (or an ICP profile), you can also reach out to them and survey who and what they follow. Sometimes your own guesses at the right hashtags make assumptions that don't align with your audience.\n==============================", "\n            === POST 90 ===\n            Title: Solo founder building an AI assistant - what tasks would you trust it with?\n            Score: 0 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/Entrepreneur/comments/1mmpk4w/\n            Content: I run a small service business and I’ve been experimenting with building AI assistants that do the bulk of a task before pausing for me to approve or reject the output.  The idea is to automate 90 % of the work while retaining control at the final step.  So far it’s helped me draft proposals and respond to routine emails, saving hours each week.\n\nFellow entrepreneurs ￼, if you had an AI helper like this, what parts of your business would you hand off first?  Have you had success (or horror stories) with AI automation?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Welcome to /r/Entrepreneur and thank you for the post, /u/Sensitive-Ad-4660! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*\n==============================", "\n            === POST 91 ===\n            Title: How do you get over the phase of doubting yourself and everything you’re working on?\n            Score: 1 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/Entrepreneur/comments/1mmpi8h/\n            Content: I’ve been hit hard with this this past week, and I can’t get over thinking I’m a fraud, and doubting everything that I’m building and working towards. I know it’s a phase but I’ve recently started going full-time on my startup, and doubt is slowly starting to creep in.\n\nI think it might be because I started posting on LinkedIn for the first time (hate the platform), and it’s exposing myself to all my previous coworkers and bosses.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Welcome to /r/Entrepreneur and thank you for the post, /u/hydroflame7! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*\n2. Score: 1 | Comment: make a new LinkedIn account\n==============================", "\n            === POST 92 ===\n            Title: Wanna know everyone's opinion- What would be the best product to sell on own e-commerce website with a high chance of profit?\n            Score: 1 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/Entrepreneur/comments/1mmphbw/\n            Content: Everyone's opinion will be appreciated\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Welcome to /r/Entrepreneur and thank you for the post, /u/TripTales41! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*\n==============================", "\n            === POST 93 ===\n            Title: What can you even do as a technical cofounder pre-validation?\n            Score: 1 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/Entrepreneur/comments/1mmowx3/\n            Content: Partner is in the industry our product will be in, I’m not; no ides how to connect with potential customers as a result. I really want to learn the pain points of this industry firsthand but it just seems impossible without any merit in it. So what do I even do pre-validation? \n\nBuilding mvps or prototypes seems like a waste of time - we have a very rough outline of the problem but want to talk to customers first before making it concrete. It’s abstract and as a result hard to make a concrete product. Also, we don’t even know if anyone would be interested in it yet, so we invest time into building it?\n\nAny ideas?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Welcome to /r/Entrepreneur and thank you for the post, /u/I-already-redd-it-! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*\n==============================", "\n            === POST 94 ===\n            Title: I Increased price by 30% and Sold More, Crazy right?\n            Score: 1 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/Entrepreneur/comments/1mmooyb/\n            Content: That sounds surreal, I know. However, the world of business is quite dynamic. It isn’t always predictable. A few months ago, I did something very unpredictable by increasing the price of my products by 30%. At first, I was very skeptical, but on second thought, I said to myself, “What’s the worst that could happen?” Then my brain gave me a truckload of answers on what could go wrong, one of which is that I could lose my returning customers. This could even lead to more financial strain, but what is life without risks? I  just had to make the decision.\n\nI know you are wondering what brought about this decision. I deal with a very niche product that I source from an international online marketplace, Alibaba. I have always sold them at an affordable rate just because I didn’t want to overprice them. This didn’t work out as planned because at the end of the day, I wasn’t getting many returns. I was making sales, but with very little or no profit. \n\nIt was at that point that I realised my b\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Welcome to /r/Entrepreneur and thank you for the post, /u/Brilliant-Structure3! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*\n2. Score: 1 | Comment: Other than making it priced premium, the way U marketed it changed amirite. Was it more layman/understandable jargon or premium marketing talk?\n3. Score: 1 | Comment: Docker did this a couple years ago. They were so loved by the developer community they literally doubled the price - it was crazy - watching their numbers as an investor their revenue just doubled from march to April one year and they barely increased churn. Obviously they can’t do that regularly - it’s about finding your value to customers and pricing just below that to keep retention high so they are happy but paying for the value you are creating.\n\nAlways an interesting problem.\n==============================", "\n            === POST 95 ===\n            Title: what’s one thing about Slack you wish worked better?\n            Score: 0 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/Entrepreneur/comments/1mmokb9/\n            Content: Not looking for general complaints. I mean something specific that would make your day easier or your team more productive if Slack actually handled it well. Curious what’s at the top of your list.\n\nA lot of people are complaining about how much feature bloat slack has. So wondering what people actually want changed or improved. \n\n\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Welcome to /r/Entrepreneur and thank you for the post, /u/Jaydgaitin! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*\n==============================", "\n            === POST 96 ===\n            Title: Have you hired out direct marketing? How did it go?\n            Score: 1 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/Entrepreneur/comments/1mmo9jm/\n            Content: Am considering hiring a freelance marketer to help me set up a marketing program for a professional service to a targeted group. I bring in experts to help with technical aspects (servers, data, etc) but I've always assumed I could handle marketing, with no professional experience.  \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Welcome to /r/Entrepreneur and thank you for the post, /u/bravo_ragazzo! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*\n2. Score: 1 | Comment: Hiring a single person and not an agency is best.  They could work 15-20 hours a week and do great things for your business! I did this for my company too.\n==============================", "\n            === POST 97 ===\n            Title: Cold Calling Advice?\n            Score: 2 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/Entrepreneur/comments/1mmo67d/\n            Content: Been working on a GBP management business/ review automation system for local businesses. Had a few successes, but still struggling getting on the phone with the owners. Any advice for cold calling, pitching a service like this? \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Welcome to /r/Entrepreneur and thank you for the post, /u/i-might-be-retardedd! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*\n==============================", "\n            === POST 98 ===\n            Title: How do you prioritize business functions when resources are limited?\n            Score: 1 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/Entrepreneur/comments/1mmn269/\n            Content: Hi everyone,\n\nI’m running a small business and facing a challenge I think many entrepreneurs can relate to. With limited capital, I’m trying to figure out how to prioritize my efforts.\n\nOn one hand, I need to focus on sales to generate cash flow. On the other hand, I know brand building and marketing are crucial for long-term success. The problem is, I don’t have the budget to fully commit to all areas at once.\n\nHow do you approach this balance?\n\n* Do you put most resources into immediate sales and build the brand later?\n* Or do you try to invest in both at a smaller scale?\n* Any tips for achieving mass-market reach without burning through limited funds?\n\nWould love to hear from those who’ve been in the same situation.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Welcome to /r/Entrepreneur and thank you for the post, /u/Such_Boysenberry_760! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*\n2. Score: 1 | Comment: Do what is profitable and then use the profits to build the brand.\n==============================", "\n            === POST 99 ===\n            Title: My freelancer put in less and less effort everyday as if he just want to get it done and collect money ? How to deal with it ?\n            Score: 4 upvotes\n            Total Comments: 42\n            URL: https://www.reddit.com/r/Entrepreneur/comments/1mmkncl/\n            Content: So I hired a freelancer for my small business, and he was good and delivered well for the first few weeks.\n\nThen the quality of his work just got worse and worse. The tasks are still the same, and we’ve been really nice to each other, but I feel like he just wants to get it done and take the money, putting in less and less effort.\n\nBack then, he would deliver every 3 days; now it’s once a week.\n\nI’m not sure how to deal with it. I don’t want to tell him that it’s taking him way too long and that his work isn’t as good as it used to be cause it's not going to be pleasant to both parties. \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Welcome to /r/Entrepreneur and thank you for the post, /u/Moonnnz! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*\n2. Score: 55 | Comment: > I don’t want to tell him that it’s taking him way too long and that his work isn’t as good as it used to be cause it's not going to be pleasant to both parties\n\nthen there are two of you that arent doing your job\n3. Score: 16 | Comment: You need to communicate, you can’t choose not to - it’ll cost you more. Discuss your concerns, and if you don’t see any improvements after it. Get rid of them.\n=============================="]