[{"post_id": 0, "title": "Made $200 in a week — all from ONE loyal user", "score": 0, "total_comments": 0, "url": "https://www.reddit.com/r/NoCode/comments/1mowvni/", "content": "Last week something happened that gave me a huge confidence boost — I made $200 in 7 days.\n\nNot from a job. Not from freelancing. But from someone actually paying — and continuing to pay — for something I built.\n\nI launched [lumi.new](https://lumi.new/) about a week ago. It’s a vibe coding tool — think AI coding, but with stronger handling of complex scenarios compared to other products out there (though it’s not easy to show this off in a quick demo).\n\nI honestly didn’t expect much. Maybe some curious clicks, a few trials, and that’s it.\n\nBut then I met my first loyal user. Someone who not only subscribed but kept using it — and told me they wanted more credits to keep going. That’s what got me to $200 in a week.\n\nFor some, that’s nothing. But for me, it’s proof that this thing might have a real future. I’m grateful to that user — and I believe this product will bring in a lot more.", "top_comments": []}, {"post_id": 1, "title": "Built a no-code Airtable + Stripe invoicing system for service businesses, free guide included", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/NoCode/comments/1mowqry/", "content": "Hey all,\n\nI put together a no-code invoicing system that connects Airtable and Stripe. It works on Airtable Free or Team+, so no paid plan is needed.\n\n\n\n**What it does**\n\n* Create and send Stripe invoices directly from Airtable\n* Automate delivery with [Make.com](http://Make.com) or optional Airtable scripts (if you actually like coding)\n* Update payment status in real time\n* See revenue and performance in a simple dashboard\n\n\n\n**What You’ll Learn**\n\n\\> You’ll be able to **create invoices** (digital & pdf)\n\n\\> send them to your clients\n\n\\> and track payments (if using Airtable Team+ or [Make.com](http://Make.com) Pro)\n\n\n\n**Two setup options**\n\n1. Script version using Airtable’s scripting block to connect to Stripe (Needs Airtable Team+)\n2. [Make.com](http://Make.com) version using webhooks and modules (No code required, Airtable Free OK)\n\n\n\n**Free step-by-step guide:** [https://launch.whyfaithe.com](https://launch.whyfaithe.com)  \n**Demo video:** [https://share.vidyard.com/watch/VHzieA", "top_comments": []}, {"post_id": 2, "title": "What’s the best no-code AI website builder for running a 24/7 subscription-based tutoring platform with group booking?", "score": 0, "total_comments": 3, "url": "https://www.reddit.com/r/NoCode/comments/1moqgu7/", "content": "I’m building a platform for tutors and I need a no-code AI website builder that can handle some specific features. Ideally it should have user accounts, a 24/7 group booking system with limits on participants, recurring subscription billing, mobile optimization, a member-only announcements page, and optional AI chatbot integration. If anyone has used a builder that can handle all that, I’d love to hear your suggestions.\n\n", "top_comments": [{"comment_number": 1, "score": 1, "comment": "What you want is a learning management system. Search around and find vendors that offer a system and just purchase it"}, {"comment_number": 2, "score": 1, "comment": "You can build a educational portal with site.com and a third-party AI chat builder."}, {"comment_number": 3, "score": 1, "comment": "I use [Macaly](https://youtu.be/XViRIkJI8UM?si=HI5Uxc4CBzaWed6B)"}]}, {"post_id": 3, "title": "AI no code app builder", "score": 0, "total_comments": 13, "url": "https://www.reddit.com/r/NoCode/comments/1mogkhb/", "content": "Hey all,\n\nCan anyone recommend recommend an AI app builder which isn't one of the most well known ones?\\]\n\nI just want to support a smaller company", "top_comments": [{"comment_number": 1, "score": 1, "comment": "[removed]"}, {"comment_number": 2, "score": 1, "comment": "Libra AI"}, {"comment_number": 3, "score": 1, "comment": "You can try \n\n[https://devproai.com/](https://devproai.com/)\n\nBuilt by a small but lighting team of 3 full time developers.\nWe focus on building business web applications really really well ☺️."}]}, {"post_id": 4, "title": "The weather’s getting waaay hotter lately, so I built a website to remind myself to live more eco-friendly.", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/NoCode/comments/1moeuyn/", "content": "Over the past three years, I’ve clearly felt summers getting longer and the heat becoming almost unbearable.\n\n\nSo I built a site that tracks temperature rise and hazards, to remind myself to live more eco-friendly.\n\n\nWhat do you think about the weather these days? Should I add more local data layers?\n\n  \n", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Love the visuals. Is the data real-time?"}]}, {"post_id": 5, "title": "24 Apps in 12 months ( Need Advice on how to keep cost to minimal to maintain them )", "score": 1, "total_comments": 3, "url": "https://www.reddit.com/r/NoCode/comments/1moei87/", "content": "Equipping my expertise in AI agent management to now deploy 24 apps in the next 12 months. I want to work on impactful tech here and would appreciate ideas that you would want me to work on. If you can work with me to build it with me to its full potential then terrific else let it keep growing organically to find its own community.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "I will say do less but with quality and focus on generating revenue.. as geenrating revenue is mix of product Development + Sales and marketing + Customer support/engagement"}, {"comment_number": 2, "score": 1, "comment": "24 apps on 12 months You're going to burn out and you're going to achieve nothing besides wasting 2 years of your time. Spend 6 months on one application and move on to the next one. Anything that's quick to build means that competitors can build it just as quickly."}]}, {"post_id": 6, "title": "APP #2 built with Claude Code as my sidekick. I built an app that helps remote workers easily add activity into the workday.", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/NoCode/comments/1modk8u/", "content": "No text", "top_comments": []}, {"post_id": 7, "title": "Is AI Content Creation Actually Working for Monetization & Freelancing? What Are the Best Niches?", "score": 0, "total_comments": 1, "url": "https://www.reddit.com/r/NoCode/comments/1mocqfn/", "content": "Hey everyone,  \nI'm exploring AI tools for content creation—things like blogs, videos, social posts, etc.—with a goal to build my own personal brand, find a profitable niche, and maybe offer freelance services as well.\n\n* Has anyone here successfully monetized content made with AI?\n* Do you see good results in specific niches, or is it too saturated?\n* What’s the best way to start as a freelancer with AI tools?\n* Does AI really help in building a unique personal brand, or does it make things more generic? Would love any tips on what works, what doesn’t, and how to stand out. Thanks!\n\n", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Are you selling something or looking for someone to give you a tutorial how to get rich?"}]}, {"post_id": 8, "title": "What’s your biggest headache with Wix/Shopify or no code builders in general? Built something to fix it, need your thoughts", "score": 1, "total_comments": 5, "url": "https://www.reddit.com/r/NoCode/comments/1mobbmz/", "content": "Hey all,\n\nI’ve been working on a project for a while now because I kept seeing the same thing over and over — people getting excited to set up a website on Wix, Shopify, Squarespace, etc., but then… hitting that wall.\n\nSome of the most common pain points I’ve seen/heard:\n\n* Spending hours tweaking layouts and still not loving the look\n* Templates that look “locked in” and hard to customize\n* Surprise costs for things you thought were included\n* Needing features that should be simple but aren’t\n\nSo I decided to try something different. I put together a platform called **Pixeocommerce** where instead of you wrestling with the builder, you:\n\n1. Pick from 100+ templates (or tell us your idea from scratch)\n2. Fill in a short “vision form”\n3. We just build the site for you, tweak it to your taste, and hand it over ready to go\n\nI’m not here to hard-sell (we do have a £9 package with a free domain for a year, but that’s not the point) — I really want to know:\n\n**If you’ve used Wix, Shopify, or", "top_comments": [{"comment_number": 1, "score": 2, "comment": "sounds like working with an indian on fiver."}, {"comment_number": 2, "score": 1, "comment": "[deleted]"}]}, {"post_id": 9, "title": "Which No code are good to build websites SEO friendly?", "score": 3, "total_comments": 15, "url": "https://www.reddit.com/r/NoCode/comments/1mo6vao/", "content": "I’ve been trying to create a website with custom page functions on lovable, but Lovable is not really friendly with SEO.\n\nDo you guys know any No code platform that are SEO friendly?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "I'd expect you sort of have to do it yourself in a way by prompting. Do you reckon if Lovable had a \"SEO\" integration, that would be helpful? Like be able to sort SEO easily on-platform."}, {"comment_number": 2, "score": 1, "comment": "Can you share what you are building?"}, {"comment_number": 3, "score": 1, "comment": "Have you tried Framer or webflow?"}]}, {"post_id": 10, "title": "Our first customer completely changed how we think about the tool we're building. Has anyone ever faced this? (I will not promote)", "score": 3, "total_comments": 4, "url": "https://www.reddit.com/r/startups/comments/1mowdwz/", "content": "It's funny how you build something thinking you're solving one problem, and a user shows you a much more interesting one.\n\nWe're building a visual tool to organise cluttered information. We were convinced our main users would be academics working with complex research papers.\n\nThen our first paying customer came in. He's a founder, and he's using it for something we all struggle with: strategic planning and team collaboration. He said it helped him get his company's strategy out of his head and share with his team.\n\nThis was a different thought process to use a tool. Has anyone ever experienced this?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is obviously promotional. But you got me, what's the tool?"}, {"comment_number": 2, "score": 1, "comment": "You could either build for both markets or focus on the higher value one. Business strategic planning tools like think Miro, Figma for strategy, can command much higher prices than academic tool ..."}]}, {"post_id": 11, "title": "\"I will not promote\" I made a tool for rating personalities. What kind of people would want this?", "score": 2, "total_comments": 4, "url": "https://www.reddit.com/r/startups/comments/1mou0sy/", "content": "So, a few weeks ago, I decided to create a personality rating site/app to help me date better. Initially I made it for myself but now I want to share it with other people. \n\nThe way it works is, you enter qualities you want (and how important they are to you) and then it let's you assess how much of those qualities the person you are dating has (it has rating feature) and final score. \n\nMy hope is that something like this would allow people to date with more clarity and understand their partner holistically (not seeing a lot of great qualities because of a single flaw or the reverse).\n\nWhat demographic of people do you think would be interested in something like this? \n", "top_comments": [{"comment_number": 1, "score": 3, "comment": "[Actor-Observer Bias](https://en.wikipedia.org/wiki/Actor%E2%80%93observer_asymmetry)"}, {"comment_number": 2, "score": 1, "comment": "We used to have something similar in Middle School for Valentine’s Day.\n\nMiddle School and High school demographics will respond the best to this for sure."}, {"comment_number": 3, "score": 1, "comment": "Hmm.. this feels like it would appeal to the spreadsheet crowd. Like people who already track their workouts budget in detail and like data-driven decisions\n\nHave u tested it with friends yet?"}]}, {"post_id": 12, "title": "Should non-technical founders become technical? I WILL NOT PROMOTE", "score": 9, "total_comments": 32, "url": "https://www.reddit.com/r/startups/comments/1mot1u8/", "content": "As a non-technical founder, I’ve found it extremely hard to bring one on board. Even with traction, a working prototype, paying customers, a validated idea, and strong founder-market fit, it still feels like you need an existing network or close technical connections to succeed.\n\nSo I’m wondering: should non-technical founders learn to code at least enough to build an MVP, or keep pitching to potential technical co-founders?\n\nFor context: my background is in marketing and sales, with a proven track record.", "top_comments": [{"comment_number": 1, "score": 11, "comment": "I've been a software engineer for 25 years. I learn every day. For me, at least, it's not something you can just pick up in a couple of afternoons. However, if you have built an MVP and got customers without a tech founder, what do you need one for?"}, {"comment_number": 2, "score": 8, "comment": "If your background is in marketing and sales, become the best at that you can be. It's pointless to be mid at coding when good coding is a commodity nowadays."}, {"comment_number": 3, "score": 3, "comment": "I think so. But there's no point in learning full full-stack stuff. So much of the job is gluing things together and updating dependencies and just stuff that you need dedicated heads-down devs to do. BUT - as a founder, you can certainly understand how everything works in an idealized way, goal-drive dev, story, how all the parts fit together -- and be able to lead with confidence. But it's tricky to find a way to actually learn that. But - maybe it's just not for you. I HATE doing the marketing and stuff, so - someone like me would be very happy to have you on that full time."}]}, {"post_id": 13, "title": "Best way to begin my startup( I will not promote)", "score": 4, "total_comments": 6, "url": "https://www.reddit.com/r/startups/comments/1momv0b/", "content": "I'm a Zimbabwean, trying to create a startup focused on the health sector, I have little to no resources but I have managed to create a website and for now that's it, but due to a lack of resources thats all, wanted to know how y'all have managed to build and what tips can I get, any tools to make my life easier (free ones) for now, any help would be greatly appreciated.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Your biggest mistake is building a website first instead of talking to actual people with health problems. Working at an agency that handles campaigns for healthcare startups, most founders waste time on tech instead of validating demand.\n\nStart with WhatsApp groups and Facebook communities where your target users hang out. Healthcare is all about trust and relationships, especially in emerging markets.\n\nSkip fancy tools and focus on direct outreach to potential customers. Find people complaining about health services online and offer to help solve their specific problems.\n\nOur clients in the healthcare space always start with manual processes before building anything automated. Prove people want your solution by delivering it manually first.\n\nAlso try partnering with local clinics or healthcare workers who already have patient relationships. Way easier than building an audience from scratch.\n\nThe website means nothing without real users who actually need what you're offering."}, {"comment_number": 2, "score": 1, "comment": "Curious, is chatgpt or other llms not available in Zimbabwe?"}, {"comment_number": 3, "score": 1, "comment": "u/erickrealz  give you good advice, i can add just one thing, you can build landing page and it's enough for start"}]}, {"post_id": 14, "title": "Audio-only social platform - solving phone addiction or just shifting it? I will not promote", "score": 2, "total_comments": 10, "url": "https://www.reddit.com/r/startups/comments/1momlq4/", "content": "I’ve been trying to reduce my screen time but still want social content, so I started just listening to TikToks/Instagram posts with audio while doing other stuff - especially while at work. It’s way less addictive than visual scrolling.\n\nGot me thinking: what if there was a social app that was purely audio? Like Twitter but with 30-second voice memos instead of text posts. \n\nBasically voice messages as social media posts. Would you use something like this? What features would make or break it for you?", "top_comments": [{"comment_number": 1, "score": 2, "comment": "Sounds like podcasts, and similar to delivery of \"daily\" audio newsletters. But IMO there's a gap with audio shorts and a real opportunity!"}, {"comment_number": 2, "score": 2, "comment": "I think it would work (people will like it). Is going to be good for humanity? Probably not."}, {"comment_number": 3, "score": 1, "comment": "Podcasts?\n\nThis is how I use YouTube for educational stuff"}]}, {"post_id": 15, "title": "Is it crazy to go against a giant in the industry? (I will not promote)", "score": 3, "total_comments": 33, "url": "https://www.reddit.com/r/startups/comments/1mokix1/", "content": "So I’ve been working on an idea in a space that’s already dominated by a huge, well established player.\n\nPart of me thinks “why bother, they own the market” but another part thinks “giants can be slow, and maybe there’s room for something fresh.”\n\nHas anyone here actually gone up against a massive competitor? Was it worth it? Any lessons or regrets?", "top_comments": [{"comment_number": 1, "score": 15, "comment": "No, it's not crazy so long as what you are doing is different in either the problem framing, solution/approach or GTM. \n\nIt is counter-intuitive, but the idea that big tech have a lot of resources and therefore can quickly and easily replicate what startups competitors are doing is actually more fiction than reality. Try to find some examples if you wanna prove me wrong. You will find very few. \n\nSomething that has the potential to generate 1B ARR in 10 years is a pot of gold for startups, but it doesn't move the needle much for a big tech who has >100B ARR. It will likely not be high priority. \n\nAnd besides, do people really think that big tech has spare engineers, prod managers, and sales people just sitting around waiting for their management to come up with the next big idea? They have lots of resources because there is a lot of existing demand for those resources."}, {"comment_number": 2, "score": 10, "comment": "if you have an angle to sell your product to them, maybe. Otherwise you run the risk of getting swallowed up. Giants may look slow from the outside but there’s a reason they are giants. Their product is generally very deep or at least very well-funded"}, {"comment_number": 3, "score": 7, "comment": "Sure, you just have to do it better for some group of people. Do stuff that doesn’t scale - like great customer service"}]}, {"post_id": 16, "title": "Looking for the best crowdfunding platform to target multiple types of creators (artists, musicians, filmmakers, writers, etc.) I will not promote.", "score": 2, "total_comments": 1, "url": "https://www.reddit.com/r/startups/comments/1moe759/", "content": "Our founders are considering a crowdfunding campaign to 1) bring in funds for marketing, and 2) raise awareness. We've looked at the usual players--Kickstarter, Indigogo, Fundrazer, etc. The problem is that our business does not fit well into the pre-selected categories of the sites.\n\nI respect the anti-promotion rules, so I won't describe what the company does, but it sells to all types of creators, providing certificates to them for something they do or do not do. So, for example, an artist, musician, filmmaker, or writer can go to the site and get a certificate allowing him or her to represent that a creative work was of a particular nature and quality. The site has been live for about a year, but we need to get the word out more.\n\nOur target crowdfunders will obviously be the creators themselves, but the problem is that Kickstarter, for example, requires you to choose a category, like art, or music, or film. But we fit into all of them, and we don't want to leave possible funders o", "top_comments": [{"comment_number": 1, "score": 1, "comment": "It doesn't matter what the categories are or which site. Pick the one with the least fees that you don't violate the terms of. Every crowd funding site might as well be your own stripe page at this point because you have to market to your audience anyway. People are not going to find and fund your company on a crowd funding site. The site is where you send people who want to fund you to complete their payment."}]}, {"post_id": 17, "title": "Has anyone here used Disciplined Entrepreneurship - i will not promote", "score": 2, "total_comments": 3, "url": "https://www.reddit.com/r/startups/comments/1mob80c/", "content": "As the question says has anyone tried Disciplined Entrepreneurship (by Bill Aulet). It seems to me that it is a lot more granular and specific than the typical startup advice.\n\nIf you did use it how’d you find it? What are the advantages? What is it missing? When was it helpful and when did you feel lost?", "top_comments": [{"comment_number": 1, "score": 2, "comment": "It's perfect if you have no clue what you are doing. Only book I have found that gives you real instruction, everything else is just theory and BS."}]}, {"post_id": 18, "title": "Let's Discuss: Bridging Tech Founders and Industry Experts for Better Product Development. I will not promote", "score": 0, "total_comments": 5, "url": "https://www.reddit.com/r/startups/comments/1moanjy/", "content": "Many founders here are building startups. They're often strong technically, and many grasp marketing basics. However, very few possess deep operational knowledge of the specific industries they aim to disrupt.\n\nConsider this: What real value can we offer an oil company if our only insight is knowing oil prices? Even a small, well placed automation could save them millions monthly. The core challenge? You need precise knowledge of **what** to automate, and you absolutely require a pilot project to validate your solution. For an outsider, securing this is incredibly difficult.\n\nMeanwhile, inside large corporations, there are experienced individuals: managers, engineers, lawyers, department leads, skilled frontline workers. They possess profound industry understanding. They know the daily operational pains and can identify solutions their company would actually pay for. Many have likely considered entrepreneurship but leaving stable employment for a high risk venture isn't always practica", "top_comments": [{"comment_number": 1, "score": 2, "comment": "I am a former product manager, sales director, coo, industry expert and coach for production methodologies in a few industries.  I’ve worked for multiple startups and a scale up, as well as had development roles in some listed companies. Now I’m a small time investor and coach for some startups and I have my own consulting business.\n\nI feel like you are kind of jumping from a terrible startup mistake to a remedy that is in the same mindset than the original mistake.\n\nSo we understand rationally that we can’t just lock ourselves in for a year to build and come out the other end and believe it’ll be a good product.\n\nSo now we want to ask experts what we should make. That is certainly a bit better, but it still has the same mindset of trying to come up with anything but exposing ourselves to the customers.\n\nI mean sure, we do need experts for the nitty gritty details sometimes.\n\nBut what we need more is constant exposure to the users and the buyers. The experts are often neither. \n\nSo my proposal is - let’s stop the insane mental gymnastics designed to avoid the demoralising and brutal exposure to users and buyers - and just accept that we have to get our asses kicked for a long time to make something good. \n\nIf you change expert to user I’m all aboard with your post - and sometimes it’s the same thing. But the difference in wording is crucial. \n\nAnd besides - one or two experts will derail you. They have their own narrow perspective and need, and they will drive you to solve that, but what about the rest of them? Volume matters, and no product decision should ever be dictated by one or two experts (or users). In that case you’re just building custom solutions.\n\nSorry to rail on your post like this, and it is a great first step, but talking to experts is still too hygienic to make something great unless the expert is the ICP buyer and/or user.\n\nI say this as an industry expert who has made several solutions with industry experts. I’ve been the only or one of a few customer facing people, and the experts’ arrogance and distance has often driven far from what customers/users need or want. It’s been tiring fighting the windmills to try to balance between expert vision and actual market need."}, {"comment_number": 2, "score": 2, "comment": "20% for an advisor is an insane number. 1-2 calls weekly gets you a fifth of the company ??"}, {"comment_number": 3, "score": 2, "comment": "This sounds like technical consulting. "}]}, {"post_id": 19, "title": "Anyone to Learn vibe coding together? I will not promote", "score": 4, "total_comments": 5, "url": "https://www.reddit.com/r/startups/comments/1mo99oz/", "content": "Anyone to learn together vibe coding, ux ui by project based learning?\n\nNot through traditional tutorials but via getting involved in some idea (maybe ur mvp or any idea) and learn step by step through AI and different sources as we progress in a funny creative way", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Bro what step by step? The whole point of vibe coding is that you don't learn and fail at 75% of the way to finish."}, {"comment_number": 2, "score": 1, "comment": "explain please"}]}, {"post_id": 20, "title": "With Inflation and Increased Costs, Is there a Business Model That Actually Has Great Profit Margins in 2025?", "score": 3, "total_comments": 6, "url": "https://www.reddit.com/r/Entrepreneur/comments/1mowf0j/", "content": "I'm not sure it's just me, but for the last several years I've attempted or researched a lot of business models, and it seems like every business model I come across, the profit margins always seem so slim, that while the idea might be great, none of the business models I've looked at make financial sense to pursue. With inflation and increased costs on the rise, along with potential tariffs, it seems like this is only going to get worse. \n\nFor instance, I know any business model that involves a physical product, will always involve incredibly expensive labor, storage costs, and shipping. Any food-related business is already known to have horrible profit margins, talking in the 10-15% range. And anything software-related, especially for folks that can't code, will involve hiring software engineers or workers with specialized knowledge that's incredibly expensive to hire. \n\nThe only business model I can think of that might have great profit margins are anything service based, so for ins", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to /r/Entrepreneur and thank you for the post, /u/LifeInAction! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "You're spot on about margins getting crushed everywhere. Even decent sourcing from Alibaba gets killed by fulfillment costs and Amazon competition.\n\nOnly thing still working seems to be boring local services (septic, cleaning) or productizing expertise instead of selling hours.\n\nHonestly, corporate ladder climbing probably has better risk-adjusted returns than most businesses now."}, {"comment_number": 3, "score": 1, "comment": "u/TryQuillBot how is this?"}]}, {"post_id": 21, "title": "Would you drink your morning coffee if it already had your daily creatine in it?", "score": 0, "total_comments": 13, "url": "https://www.reddit.com/r/Entrepreneur/comments/1mow01o/", "content": "I noticed more people mixing creatine into their coffee lately.\n\nHypothetically, if there was an instant coffee that already had the 5g creatine dose mixed in (no taste change, no grit), would that be appealing to you?\n\nIm curious about two things:\n\n1. Do you see value in the convenience vs just adding your own creatine?\n2. If you were interested, would you prefer this marketed as a fun, lifestyle coffee brand (like flavored iced coffee vibes) or a masculine, gym performance style brand? Why?\n\nTrying to understand if this is just a gym bro thing or if regular coffee drinkers would be into it too.\n\nNot selling anything here.. genuinely curious what people think.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to /r/Entrepreneur and thank you for the post, /u/ZookeepergameNo6424! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "Regular coffee drinkers want good coffee. That's it."}, {"comment_number": 3, "score": 1, "comment": "You’d probably want to make them k-cups. Instant feels gross, and won’t justify premium pricing. You might also want to add in some other nootropic-like supplements like lions mane. \n\nGym bros aren’t really the market but with new research showing creatines effects on longevity and cognition, there’s a massive push in the non-lifting community to take creatine"}]}, {"post_id": 22, "title": "Seeking Flexible Work Ideas to Stay Afloat While Growing My Business", "score": 1, "total_comments": 3, "url": "https://www.reddit.com/r/Entrepreneur/comments/1movp9o/", "content": "I recently graduated with my bachelor’s in business and have been running my own professional organizing company. While I love what I do, finding new clients has slowed down, and it’s become difficult to keep up with my financial obligations.\n\nRight now, my necessary monthly bills total about $3,478 not including food, gas, or other expenses. I’ve already used up my savings, have some credit card debt, and I’m looking for ways to bridge the gap while keeping my business going.\n\nI’ve been applying for part-time jobs, but many employers assume a degree means I’m looking for something temporary. I have past serving experience and could do that again, but I’d like to find something that’s less physically demanding and more in line with my skills, ideally paying more than $100 a shift.\n\nCurrently, I’m supplementing income with Instacart and Uber Eats, but it’s not enough to make a real dent. I also hold my real estate license and plan to start selling, but I know it can take months before s", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to /r/Entrepreneur and thank you for the post, /u/Icy_Caterpillar_1551! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "Part time or full time job if you need to. The fact you have credit card debt indicates your financial position is poor.\n\nUnderstand you want to pursue your business but maybe you need to work say Monday Friday and Saturday for the business and Tuesday Wednesday Thursday for someone else.\n\nIf you have such few clients and are struggling, i can't see a requirement to spend 50 to 70 hours a week that would make a part time job impossible. \n\nAlternatively, fast food nightshifts if you really want to maintain flexibility?"}, {"comment_number": 3, "score": 1, "comment": "I’d lean into virtual assistant or freelance admin work since it’s flexible, pays better than gig apps, and lines up with your business skills while you grow your main hustle."}]}, {"post_id": 23, "title": "competition is stupid", "score": 0, "total_comments": 8, "url": "https://www.reddit.com/r/Entrepreneur/comments/1mov0di/", "content": "# EVERY MOMENT IN BUSINESS happens only once. The next Bill Gates will not build an operating system. The next Larry Page or Sergey Brin won’t make a search engine. And the next Mark Zuckerberg won’t create a social network. If you are copying these guys, you aren’t learning from them\n\nI am  looking for a cofounder, I am decent on the gtm side (did 5 figs in 6 months with $300) but bad at the backend. looking for OG developers who want to build x5 products, someone who have high standards & doesn't believe in competition.\n\ncan provide proof the results that i can get, also am good with design (frontend+adobe), so we postpone hiring on that end too.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to /r/Entrepreneur and thank you for the post, /u/shoman30! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 13, "comment": "I couldn’t imagine carrying the ego associated with this post with five figures in 6 months being your crowning achievement."}, {"comment_number": 3, "score": 3, "comment": "Competition isn’t stupid, it’s necessary. Because without it there’s no drive to innovate, improve or push boundaries so therefore you just get complacency.  If you're looking for a Co founder, this post has pretty much squashed all hopes......"}]}, {"post_id": 24, "title": "how a few small copy tweaks helped an ecommerce store cut cart abandonment by 40 percent", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/Entrepreneur/comments/1moutyu/", "content": "hey everyone been testing how tiny changes in copy can actually move the needle for online stores\n\nso i worked with an ecommerce brand struggling with a high cart abandonment rate and decided to experiment by rewriting their product page and email copy while keeping everything else the same\n\nthe ai tools and “prettier” copy tweaks only gave a small bump in conversions like 5 to 7 percent but when we went deeper and really understood the audience pain points and storytelling angles we could add, the cart abandonment dropped by 30 to 40 percent\n\nit was wild to see how much impact messaging that actually resonates can have compared to just making it look nicer\n\nbiggest takeaway for me is that copy alone isn’t magic it works best when it’s paired with empathy for the customer and understanding what drives their decisions\n\ncurious if anyone else has experimented with copy changes or messaging tweaks that actually changed the numbers in a measurable way would love to hear what worked or flop", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to /r/Entrepreneur and thank you for the post, /u/Street_Outside7270! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*"}]}, {"post_id": 25, "title": "Intent based targeting", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/Entrepreneur/comments/1mouj1o/", "content": "For a while now I've been running a linkedin outreach saas\n\nIf anyone is reading this, im not going to promise the world, because i can't. I can however shares learnings I've tried and tested.\n\n(forgive me for any spelling mistakes its 4:54am as i type this)\n\nlet dive straight to it\n\n1. profile\n2. The difference in conversion rate between a profile with a bio, and one without a bio is 20%+\n\nThe lesson here is to have a bio, but not any bio. it has to be value driven. I dont just mean, list a bun of stuff you do. i mean, create a persona of the prospects you're contacting, figure out all of their pain points, and drop these in bullet points. The first thing someone sees when you reach out to them, is your: profile picture, banner picture and bio description, in that order. their decision will take max 30sec to be made\n\n2) prospects\n\nLike the title for this states. \"intent\", spraying and praying aint going to work. You're dealing with real people. Here's a few tricks to get intent. Posts", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to /r/Entrepreneur and thank you for the post, /u/FunnyAlien886! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*"}]}, {"post_id": 26, "title": "Has anyone ever heard about these franchises?", "score": 4, "total_comments": 3, "url": "https://www.reddit.com/r/Entrepreneur/comments/1motrky/", "content": "Hey guys!\n\nI’m a mechanical engineer with more than 8 years of experience in the water/wastewater industry (municipal treatment plants and sewage network/hydraulic design).\n\nEven though I’m a mechanical engineer, I’ve worked from the process standpoint most of that time. My role included project management as well, so I’m also familiar with the electrical and civil part of the projects.\n\nI’m really interested in starting a business in this industry and I came across “Trinity Water Solutions”, who apparently offers franchises related to water/wastewater treatment processes/consultancy (I cannot share the link to their website, but it’s the first result if you google it).\n\nThe only doubt I have is that I did some research about it and I couldn’t find any franchisees experiences or anything like that.\n\nI was wondering if anyone has ever heard or worked with this company before.\n\nThank you!\n", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to /r/Entrepreneur and thank you for the post, /u/Anthony_Bandana! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 3, "comment": "Also an ME but from the product development side. Background is aerospace but I've worked independently on a consultant/freelance/fractional basis for over 10 years.\n\nI'm having a hard time conceptualizing the value in a franchise model for a solo-consultancy type operation. The barriers to entry are basically zero. Theres no brand value in the franchise. Theres zero need for a complex process manual. \n\nMaybe there's aspects to your industry that give it value I'm not aware of. \n\nSo I'd encourage you to trade the opportunity costs associated with whatever they offer vs doing it your own way and repurposing whatever they're gonna charge you. \n\nIf they can deliver clients then that has big value for sure. But I just cant imagine doing the kind of work I do under the constraints of someone else's branded system. \n\nI am gonna look at this more though because you've got me curious about the angle here. \n\nGood luck regardless!"}]}, {"post_id": 27, "title": "How do you maximize your focus so you can keep building for longer?", "score": 2, "total_comments": 10, "url": "https://www.reddit.com/r/Entrepreneur/comments/1morbfq/", "content": "Pretty much title. What are your best ways to keep your focus sharp for long periods of time, preferably without nuking your nervous system.\n\nI had a few burnout episodes in this year alone, so I'm trying to be more mindful in how I approach my work. \\*context: Im a solo founder and work out of cafes in a different country (more on why I mention that in a sec). Here's a few things I do that help me stay focused throughout the day:\n\n1. L-theanine + Caffeine\n2. Strict work end time\n3. Micro breaks + 5-min breathing exercise at least once a day\n4. A huge one that I just realized recently - working with someone. Since I'm almost always the only foreigner wherever I go, loneliness is a b\\*tch. Recently, a friend that is off from his Master's Program has started joining me for work sessions, and just pairing the micro breaks with 5-10 min of having someone to talk to about anything else other than work has made a huge difference for my psyche, and im able to plow through 10+ hour sessions wi", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to /r/Entrepreneur and thank you for the post, /u/thatkhoe! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 2, "comment": "Non directive meditation like TM or NSR"}, {"comment_number": 3, "score": 2, "comment": "Ample sleep (naps if needed) and I quit coffee. I also fast and stopped eating sugar and breads that spike blood sugar and make me crash. Focus went through the roof."}]}, {"post_id": 28, "title": "Considering franchising", "score": 1, "total_comments": 7, "url": "https://www.reddit.com/r/Entrepreneur/comments/1moqws5/", "content": "I’m curious if anyone has franchising experience to share.  My wife and I are considering a couple franchise options right now - one is a cleaning and restoration business, the other is an early childhood gym business. Both are smaller franchises, which I like as I’ve had most my experience in startups and prefer less leadership to deal with.\n\nAny experience to share? Happy to answer more questions as it’s helpful in sharing guidance.\n\nBonus - do you believe there are any interesting/standout franchising opportunities you’d encourage me to consider?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to /r/Entrepreneur and thank you for the post, /u/apr35! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "As in you want to create a franchise or become a franchisee and buy one? Like the whole thing or one location?"}, {"comment_number": 3, "score": 1, "comment": "Do you have experience in either domain? What is the cost for both? I would go for the one with the highest chance of success rather than the highest payout"}]}, {"post_id": 29, "title": "Is there anything to manufacture at individual scale in the US?", "score": 0, "total_comments": 18, "url": "https://www.reddit.com/r/Entrepreneur/comments/1moqrvp/", "content": "Looking to manufacture something to sell in the US. B2B but B2C is okay too. Located Upstate, NY. Bootstrap ideally - $2-4K upfront cost. I know it is low but that's the max I can on CC debt.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Welcome to /r/Entrepreneur and thank you for the post, /u/webdevyorker! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 10, "comment": "Your budget will buy you maybe 3-5 influencer shoutouts at best.\n\nBuy a hot plate or a grill, a tent, a tank of gas, some supplies and start making hotdogs or some other junk food on the corner of a busy intersection."}, {"comment_number": 3, "score": 10, "comment": "If you have no idea what to even manufacture you have no chance. Get a job and stop wasting your time."}]}, {"post_id": 30, "title": "i built this landing page for sub member's Saas", "score": 0, "total_comments": 0, "url": "https://www.reddit.com/r/SaaS/comments/1mox074/", "content": "If you remember, i posted \"List your Saas and i'll build a website for free\", he contacted me after seeing that post, btw he paid for it, didn't wanted anything for free, he runs an Agency for 10 years now and launching a saas now, \n\nPreview here- [https://turbolaunch.framer.website/authority-boost](https://turbolaunch.framer.website/authority-boost) ( currently it is not responsive for all devices, preview it on desktop only)  \nPS, the design is approved by client and we are now moving to other pages.", "top_comments": []}, {"post_id": 31, "title": "Who’s actually buying from the “quote-a-day” coaches on X?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SaaS/comments/1mowzij/", "content": "Lately my X feed has turned into a wall of motivational fridge magnets.  \nEvery morning it’s:\n\n* *“Discipline > motivation.”*\n* *“Ship daily.”*\n* *“You don’t need permission.”*\n\nMeanwhile I’m over here celebrating if my one post of the week scrapes together 4 likes (two of them from friends who felt sorry for me).\n\nThese folks are pulling 10k+ followers in months, while I’m still in the “please click my link I swear it’s not a scam” stage.\n\nSo… what’s their secret sauce? And more importantly, what’s actually going on *after* the likes roll in?\n\nI keep seeing “writer/coach/marketer” accounts on X post daily bite-size motivation + belief/discipline mantras. They grow followers crazy fast. But… who’s actually buying from them? How are they turning this into a business?\n\nIf you’ve **hired** one of these folks — what did you actually get? Was it a landing page rewrite, an email series, a content plan, or something else? How did it turn out? Would you work with them again?\n\nIf you **are** on", "top_comments": []}, {"post_id": 32, "title": "PropTech Free Trial Upgrade", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SaaS/comments/1mowy9h/", "content": "A free trial isn’t a sales pitch — it’s a trust exercise.\nThe goal? Prove you solve their problem before you ask for the card.\nEarn belief → earn the sale.\n\n#SaaS #PropTech #Copywriting\n\n", "top_comments": []}, {"post_id": 33, "title": "If you had to start a tech company today, what would you do?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SaaS/comments/1mowr3m/", "content": "No text", "top_comments": []}, {"post_id": 34, "title": "I can't decide what AI SaaS to make", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SaaS/comments/1mowq76/", "content": "I am seeing people are making same TODO apps or Routing like OpenRouter. I know how to make Ai apps.\n\nI can't decide which app or topic to pick and start Micro Ai SaaS.  \nHow can i get Ideas ?", "top_comments": []}, {"post_id": 35, "title": "Yesterday I created a post about an app I am working on. Today I have made a demo video.", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SaaS/comments/1mowopf/", "content": "Hi all,\n\nI have been working on an app that can address issues with storing/sharing data in Excel files for a long time. The purpose is to provide a centralized place for small to large teams to store, manage, and access their data. \n\nTeams can benefit from the app with the following reasons:\n\n1. Little resource for app development \n2. Access from anywhere\n3. Improved data accuracy \n4. Easy team collaboration \n5. Built in file storage \n\nHere is the link to a demo video: [Demo Video](https://fb.watch/BrTMIT9hIL/)\n\n[Last Reddit Post](https://www.reddit.com/r/SaaS/comments/1mnpyfi/first_time_building_app_that_might_be_dead_later/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nThank you", "top_comments": []}, {"post_id": 36, "title": "API-first vs. UI-first for web automation SaaS - which approach wins more enterprise customers?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SaaS/comments/1mowgi3/", "content": "Facing a strategic decision about product architecture for a web automation SaaS and would love the community's insights.\n\n## Context:\nBuilding a platform that automates web interactions (think data extraction, form filling, monitoring) using AI vision instead of traditional selectors. Growing steadily but need to choose the right path for scaling to enterprise.\n\n## The Decision:\n\n### Option A: API-First Approach\n\n// Developers integrate directly\nconst result = await automationAPI.execute({\nurl: \"https://example.com\",\ntask: \"extract product prices\",\nformat: \"json\"\n});\n\n\n\n**Pros:**\n- Easy integration into existing workflows\n- Higher developer adoption and viral growth\n- Scales efficiently (minimal UI maintenance)\n- Clear usage-based pricing model\n\n**Cons:**\n- Requires technical buyers\n- Longer sales cycles (need dev resources)\n- Less differentiated (looks like commodity)\n- Harder to demonstrate value in sales calls\n\n### Option B: UI-First Approach\nVisual workflow builder where users:\n1.", "top_comments": []}, {"post_id": 37, "title": "The Hidden Costs of Outdated POS Systems (and How I Fixed Mine)", "score": 1, "total_comments": 2, "url": "https://www.reddit.com/r/SaaS/comments/1mowf96/", "content": "For the first few months of running my restaurant, upgrading my restaurant POS system was the last thing on my mind. I wanted the old setup to stay in place because it “worked.” I now know that my profits were slowly bleeding every month because of that choice.\n\nI was spending way too much time on manual reconciliations that checking sales versus inventory was like being a 1990s bookkeeper. Because of the antiquated restaurant management software, I wasn't getting timely alerts about running low on stock. By the time I was getting alerts, it was too late to do anything about it, and a lot of the ingredients ended up going to waste. Chefs were getting angry, service during peak hours was sluggish, and on my worst days, the POS system would hang mid-order.\n\nAll of that changed when I adopted Recaho’s cloud-based POS system. The first three months were tough to get through—staff training, menu syncing, old data merging. It was overwhelming. But once things began to settle, the difference ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If your current system requires manual workarounds, lacks realtime data, or causes stress during busy periods, calculate what that's actually costing you. The hidden costs often dwarf the upgrade investment :)"}, {"comment_number": 2, "score": 1, "comment": "* post sponsored by Recaho"}]}, {"post_id": 38, "title": "LinkedIn is boring ,so we are building GAUSEJ", "score": 0, "total_comments": 1, "url": "https://www.reddit.com/r/SaaS/comments/1mowdwr/", "content": "I  sure you must be using linkedin, i used it too. But it's kind of boring to read the long text and lack of engagement from the community. On the contrary, Instagram is fun to use and you can spend hours in it , without noticing the time. Nowadays , video content is a very powerful tool/proof , which captures users(college students, entrepreneurs, founders, investors and startups) emotions, risk factor, creativity and vision regarding entrepreneurship. In fact, i believe you might like to watch a particular video rather than read a long Pitch deck.  \n\nGAUSEJ is a platform only focusing on entrepreneurial content and will be full of genuine users. Suppose a user posts his pitch/product demo or shares what he is building , the users would be able to comment/ROAST his idea. This would be really important for that startup (you can consider it as a feedback). They can also build their founding team here by hiring people and you will be able to know who is working on which project. The cons", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Sounds to me like you don't use LinkedIn I've 4% engagement and no stupid cold calls"}]}, {"post_id": 39, "title": "If you could make that one useful tool for Instagram… what would you make?", "score": 2, "total_comments": 1, "url": "https://www.reddit.com/r/SaaS/comments/1mow9nv/", "content": "No text", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Honestly? Something that could batch create actual good carousel posts without looking like obvious templates\n\nLike u feed it one long-form piece of content and it breaks it down into engaging slides with good design. Most tools either look terrible or require way too much manual work\n\nWould save hours compared to doing it in Canva slide by slide\"..\""}]}, {"post_id": 40, "title": "Giving away free lifetime memberships but receiving a 1-star review", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SideProject/comments/1moww51/", "content": "Here’s what happened: about 4 months ago, I launched my first iOS app for cleaning photos, [Lumio: Photo Cleaner & Manager](https://apps.apple.com/app/id6744263407)\n\nThen I spent another 2 months optimizing it. Recently, I gave away a batch of activation codes. In around three weeks, I received 180 reviews. Among them, one was particularly striking — the user said the app was a bit laggy on his iPhone X running iOS 14, which is 8 years old, and immediately gave a 1-star rating.\n\nI was honestly quite baffled.\n\nIn hindsight, I really regret it — I was probably overconfident or reckless. I’m now planning to raise the app’s minimum supported iOS version to iOS 17.\n\nhttps://preview.redd.it/j466cxe0fqif1.jpg?width=1280&format=pjpg&auto=webp&s=1abc8b1bd1e34f8fbbb652ae85f246814d9c7ab5\n\n", "top_comments": []}, {"post_id": 41, "title": "We are building AI Copilot for databases. Think Cursor but for databases. Looking for Feedback :)", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SideProject/comments/1mown0s/", "content": "Hi everyone 👋, long post ahead.\n\nThis post is for,\n\nAnyone who uses **database client tools** or **database management tools** like DBeaver, pgAdmin, TablePlus, HeidiSQL etc.\n\nAnyone who tires AI + databases in their daily workflow and succeeds in using it OR probably struggles with it because of either of the below:\n\n* Copying one SQL snippet into ChatGPT/Claude, then Alt+Tabbing to grab another some query result- only to realize you’ve included redundant or irrelevant info.\n* Even after all that, the LLM still hallucinates or suffers from context bloat.\n* You add multiple MCPs, but still can’t get the right tool call because your agent doesn’t understand what’s needed and when.\n* any other \"AI + Database\" workflow\n\nGrateful 🙏 if you can give it your 5 mins. I am sure you will find it interesting.\n\n# TL;DR\n\nWe’re building an AI-native copilot for databases - like Cursor, but for database specific workflows.\n\nWe’re experimenting and looking for **feedback from Devs/DBAs/Engineers**.\n\nH", "top_comments": []}, {"post_id": 42, "title": "Struggling to manage the flood of customer feedback from emails, surveys, and support tickets?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SideProject/comments/1mowmkf/", "content": "Tired of sifting through customer feedback? **FeedbackFlow** uses AI to turn feedback into actionable insights, recommendations, and to-do lists. It's built for solo founders, small teams, product managers, and customer success teams.\n\nI'd love to hear your thoughts! [Submit feedback](https://feedbackflow.org/collect/226618c4-6e5c-43f1-9688-a9c4437a8900)", "top_comments": []}, {"post_id": 43, "title": "I like my product.. but idk how to market it", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SideProject/comments/1mowhpu/", "content": "Hello there\\~\n\nI've been working on [Framemarks Notes](https://www.framemarks.com/welcome), which is a Youtube video summarizer. Unlike the 10000 other Youtube summarizers out there, I've engineered mine to include screenshots of valuable moments in the video. A bit like [this](https://www.framemarks.com/public/claude-code-and-the-evolution-of-agentic-coding-boris-cherny-anthropic). My problem is... I have no idea how to market it. I haven't figured out howw to stand out from the crowd and would love some advice (or just people telling me what's wrong / not that outstanding). I do think what I have is pretty cool and I personally use it pretty often.\n\nWould love some feedback!", "top_comments": []}, {"post_id": 44, "title": "AI Side Panel v2.1 - cleaner UI, content extraction, add any link", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SideProject/comments/1mowgqt/", "content": "**AI Side Panel - v2.1**\n\nHey everyone!\n\nI made a significant update to my extension based on feedback and GitHub issues..\n\n**What changed in v2.1**\n\n* Redesigned UI and split view. Easier to focus and work side-by-side.\n* Content extraction that removes ads, menus, and noise so the extraction only gets the useful text for prompt.\n* Add any service in settings by pasting a URL.\n\n**Why use it**\n\n1️⃣ Easy toggle AI tools (no more tab hunting).\n\n2️⃣ Split-screen workflow – browse and use AI side-by-side. You can compare both services at the same time.\n\n3️⃣ Drag-and-drop panels to resize/rearrange your workspace.\n\n4️⃣ Fully customisable (you can hide unused AI services)\n\n5️⃣ Custom Service Support (You can add any service via the settings menu)\n\n6️⃣ Smart content extraction that automatically cleans and formats text from news articles, code repositories, and social posts for AI analysis.\n\n**Links**\n\n* Repo: [Github](https://github.com/creosB/AI-Side-Panel-Extension)\n* Video: [Youtube](http", "top_comments": []}, {"post_id": 45, "title": "I built nifty app that’s a perfect home for my quotes and ideas — you can shuffle through them like a deck.", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/SideProject/comments/1mow943/", "content": "Hi all,\n\n  \nI used to write hundreds of notes — then I realized I never actually saw most of them again.\n\nI’d jot down everything: random thoughts, Instagram reel links I didn’t want to lose, cool YouTube videos, quotes, ideas... but over time, my notes got messy and overwhelming. With 400+ notes scattered around Google Keep, it became impossible to remember or find most of them. They just got buried and forgotten.\n\nThat’s why I built Memori Note — an app designed to solve that problem.\n\nInstead of making you open and close notes one by one, you can swipe through all your notes like flipping through a deck of cards. Plus, there’s a shuffle button that shows you a random note whenever you want.\n\nIt’s those little surprises that make a big difference — rediscovering a forgotten quote or idea you loved but hadn’t seen in months feels like a tiny “aha/oh thats cool” moment.\n\nThe goal is simple: make sure your notes don’t just sit there collecting dust but actually come back to life, effort", "top_comments": []}, {"post_id": 46, "title": "Building an open-source AI browser alternative to Perplexity/Firecrawl - lessons from 8 months of indie hacking in Bangladesh", "score": 0, "total_comments": 0, "url": "https://www.reddit.com/r/SideProject/comments/1mow6h7/", "content": "Hey r/SideProject! 👋\n\n\n\nRemember spending hours writing scrapers that broke every time a website changed their layout? Yeah, me too. That frustration led me to build something that might interest you.\n\n\n\n\\*\\*What is it?\\*\\*\n\nAI Agentic Browser - it's like having a really smart intern who can navigate any website, handle CAPTCHAs, switch proxies when blocked, and extract exactly what you need. No more XPath selectors or CSS classes that break overnight.\n\n\n\n\\*\\*The cool part?\\*\\*\n\nJust tell it: \"Go to Amazon, search for wireless headphones under $100, and save the results as CSV\" - and it does it. Uses Google's Gemini AI to actually \"see\" the page like you do.\n\n\n\n\\*\\*Demo:\\*\\* [https://www.youtube.com/watch?v=nFX\\_W3ACc1Q](https://www.youtube.com/watch?v=nFX_W3ACc1Q)\n\n\\*\\*Try it:\\*\\* [https://pilotbrowser.vercel.app/](https://pilotbrowser.vercel.app/)\n\n\n\n\\*\\*What I learned building this:\\*\\*\n\n\\- AI vision models are getting scary good at understanding web layouts\n\n\\- Users hate when scra", "top_comments": []}, {"post_id": 47, "title": "Show your project: one-liner + ICP + link", "score": 2, "total_comments": 1, "url": "https://www.reddit.com/r/SideProject/comments/1mow4os/", "content": "Drop:\n\n1. One-liner\n2. ICP (who it's for)\n3. Link\n\nI'll go first:\n\n1. ExtractCSS - free Chrome extension to copy any UI elements with exact CSS and assets (images, fonts) and best Tailwind conversion engine build in\n2. ICP: frontend devs/designers who prototype from live sites\n3. [extractcss.dev](http://extractcss.dev)", "top_comments": []}, {"post_id": 48, "title": "My MVP is live! Now I will cry to market it :D", "score": 2, "total_comments": 1, "url": "https://www.reddit.com/r/SideProject/comments/1movs4j/", "content": "I launched my first micro SaaS! [https://letsorder.app/](https://letsorder.app/)\n\nI have been a trying founder for many years. I have been an engineer for 16 years. What I really want to do is build software. I used to be very ambitious, nothing but billion $ type thinking. Now I want to focus on what I can market myself - no focus on funding or VCs. I want to earn a steady revenue. I am exploring sub-reddits related to Restaurant, Restaurant Owners, Small Businesses, etc. Please share any tips.\n\nAll the source code is here (disclaimer, this is an AI generated app but it works) - [https://github.com/brainless/letsorder](https://github.com/brainless/letsorder) . There is a backend (deployed on a VPS), two web apps - admin and guest. And the marketing website (screenshots not updated yet). Please criticize!", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Looks cool! Using Rust for this is not bad"}]}, {"post_id": 49, "title": "AI Meme Generator makes $5000 per month, should we expand to all social media image generation?", "score": 0, "total_comments": 9, "url": "https://www.reddit.com/r/SideProject/comments/1movqe2/", "content": "We've been running Supermeme. ai, an AI meme generator for over 3 years with MRR roughly around $5000. This is primarily used by marketers and especially social media marketers to use memes in their ads and marketing. Now, we're wondering if we should target the same persona with different solutions.\n\nFor example, we recently launched this feature where you can generate minimalist images using AI - like this (input - A picture is worth a 1000 words. A meme is worth a 1000 images.)\n\n  \nHowever, not sure if this dilutes our core product offering. Any thoughts on it?\n\nhttps://preview.redd.it/tljt5dln0qif1.jpg?width=1000&format=pjpg&auto=webp&s=1cf005dd374d6e7850dd045071ab94e05fe73f00\n\n", "top_comments": [{"comment_number": 1, "score": 2, "comment": "Expanding to all social media image generation could work, but you might risk losing the niche authority you’ve built in memes.\nA safer route could be: position the meme generator as your flagship, and introduce image generation as a “complementary tool” targeting the same audience — marketers love bundled solutions.\nI run a marketing agency and we’ve seen brands grow faster when they expand features without shifting away from their core USP.\nHappy to share a short case study on this if you’re interested."}, {"comment_number": 2, "score": 1, "comment": "What if you add your meme generator gpt to chat gpt app library?"}, {"comment_number": 3, "score": 1, "comment": "I just been trying it and I like your app. The output is very usable, tried others and it was always quite cringe. Always wished to have this for mobile as well, to quickly generate a meme to post on group chats.\n\nI think your communication shifts to offering a solution for quick, memetic content, and there's overlap in goals there, so it won't feel too much of a stretch.\n\nIf you want to increase LTV, you should focus on the current users doing more with memes, or the minimalist graphs. Because there is overlap, not 100%, but it both works for the same audience.\n\nBut i'd be careful you go down the route of a new market with a new approach, as that might just double your workload in branding, marketing, positioning, SEO, etc.\n\nI know of API-based image builders who do far higher MRR, so I think you still have a lot of room to market and improve the current product. Didn't even get an onboarding email."}]}, {"post_id": 50, "title": "Hey everyone I have started blogging can you guys help me by giving feedback", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/growthhacking/comments/1mouq6o/", "content": "https://medium.com/@dailygyanfeed/start-your-day-right-essential-morning-hacks-for-maximum-productivity-19c3fbfed39a", "top_comments": []}, {"post_id": 51, "title": "Drop your SaaS, I’ll find you a perfect reddit post, blog idea and micro-influencer", "score": 1, "total_comments": 2, "url": "https://www.reddit.com/r/growthhacking/comments/1mornkz/", "content": "\nJust drop your website and target market, and I’ll fish out:\n\n> A perfect reddit post for you to reply to and mention your SaaS\n> A blog post idea that will rank on Google and LLMs\n> A micro-influencer on TikTok/IG to partner with \n\n \nLet’s get cracking! ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Where here? Pm"}]}, {"post_id": 52, "title": "Another AI builder looking for a team", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/growthhacking/comments/1mop8d1/", "content": "Im working on an AI builder app (I know not another one ) trust me this one is different . Looking for:\n• dev to build (I have a prototype) must have experience \n• growth hacker to get traction \n• I work on product and strategy \n• UX/UI designer \n\nThis is not a paid opportunity but more of a partnership ", "top_comments": []}, {"post_id": 53, "title": "How is my demo video ?", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/growthhacking/comments/1mojzhp/", "content": "Demo video for Reply Daddy dot com", "top_comments": []}, {"post_id": 54, "title": "How can I get high quality social content from my franchisor?", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/growthhacking/comments/1moj6tz/", "content": "I run one of the locations for a franchise, and I’m struggling to keep up with social media. I’d love to get more polished, on-brand content from the franchisor so I’m not reinventing the wheel every week. Right now they send us the occasional image or promo, but it’s either too generic or not sized/formatted right for the platforms we use. Has anyone figured out a good way to work with their franchisor so we get a steady stream of usable, high-quality content we can post right away?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Create a content request template and send it monthly. Include exact dimensions needed (1080x1080 for IG, 1200x630 for Facebook), preferred posting frequency, and your top-performing content types\n\nMost franchisors want to help but don't know what you actually need. I've seen franchisees get 10x better content just by being specific about \"send us 4 carousel posts, 2 behind-the-scenes videos, and 3 promotional graphics monthly\""}]}, {"post_id": 55, "title": "Built a voice AI that sounds like me and books meetings while I sleep", "score": 2, "total_comments": 4, "url": "https://www.reddit.com/r/growthhacking/comments/1moetu8/", "content": "Not long ago, I found myself manually following up with leads at odd hours, trying to sound energetic after a 12-hour day. I had reps helping, but the churn was real. They’d either quit, go off-script, or need constant training.\n\n\n\nAt some point I thought… what if I could just clone myself?\n\n\n\nSo that’s what we did.\n\n\n\nWe built [Callcom.ai](http://Callcom.ai), a voice AI platform that lets you duplicate your voice and turn it into a 24/7 AI rep that sounds exactly like you. Not a robotic voice assistant, it’s you! Same tone, same script, same energy, but on autopilot.\n\n\n\nWe trained it on our sales flow and plugged it into our calendar and CRM. Now it handles everything from follow-ups to bookings without me lifting a finger.\n\n\n\nA few crazy things we didn’t expect:\n\n\n\n* People started replying to emails saying “loved the call, thanks for the clarity”\n* Our show-up rate improved\n* I got hours back every week\n\n\n\nHere’s what it actually does:\n\n\n\n* Clones your voice from a simple recording\n", "top_comments": [{"comment_number": 1, "score": 1, "comment": "I'll start counting those while I sleep posts...\n\nWhile I sleep count: 2 \n\n(actually saw it more times but let's just start with 2)"}, {"comment_number": 2, "score": 1, "comment": "How easy is for you to add languages that are not global?"}, {"comment_number": 3, "score": 1, "comment": "So this would be like a voicemail?\n\nCan this agent talk back and forth with the prospect on call?"}]}, {"post_id": 56, "title": "Marketers: how do you keep users engaged after month one, without annoying them?", "score": 3, "total_comments": 3, "url": "https://www.reddit.com/r/growthhacking/comments/1moem2m/", "content": "What’s a simple trigger or nudge that actually improves retention? What killed engagement faster than anything else? Open to creative (not spammy) ways to remind users of value?\n", "top_comments": [{"comment_number": 1, "score": 3, "comment": "The secret sauce is the right time + frequency. \n\nIt’s a whole science, but you should map how often your customers use your product, and based on that you can sense the frequency. \n\nThe exception is the first week. No matter the product you should heavily focus on educating your customers and take them to aha-moment as soon as possible. \n\nIn terms of time: better spot them once they face the problem/challenge/have a task - so I’d use Amplitude/Mixpanel/SQL to track product usage and build automations based on that. \n\nAND YES - make sure you provide VALUE. In every communication you share there should be something useful for users = they’ll engage well = long-lasting retention."}, {"comment_number": 2, "score": 1, "comment": "Stop sending weekly check in emails, that shit kills engagement fast. I'm in the b2b outreach space professionally and our clients see way better retention when they trigger based on actual user behavior instead of time.\n\nSend messages only when users hit specific milestones or haven't used key features in a while. Like if someone uploaded data but never created their first report, that's when you nudge them.\n\nThe best retention trigger is showing users what they've accomplished. Monthly summaries of their progress or results work way better than asking them to do more stuff.\n\nAlso, stop trying to get people to use every feature. Focus on the 2-3 actions that correlate with long term retention and ignore everything else.\n\nWhat kills engagement fastest is generic onboarding sequences that assume everyone has the same goals. Personalize based on why they signed up originally."}]}, {"post_id": 57, "title": "I'll find leads for you for free", "score": 10, "total_comments": 18, "url": "https://www.reddit.com/r/growthhacking/comments/1modpfy/", "content": "Hello everyone,\n\nI'm testing an automated Reddit lead generation pipeline and would love getting your help. The idea is a simple \"lead-gen sniper\" that alerts you when potential customers talk about problems you can solve on Reddit. I'm trying to see if I can generate enough amount of high-quality leads to make this idea viable.\n\n**The Experiment:**  \nFor one week, I'll be a \"human API\" for 3-5 founders.\n\n* You tell me what your product does and what keywords to track.\n* I'll manually hunt for relevant conversations and email you the links.\n\nIt's completely free. The only ask is for your honest feedback at the end so I can decide if this is worth building.\n\nIf you have a launched product and want to be a test client, **comment below with what you're building.** I'll DM a few people to get started.", "top_comments": [{"comment_number": 1, "score": 3, "comment": "[www.careerbutler.app](http://www.careerbutler.app)  \n  \nAll you do it upload your resume, paste the job description and you have a optimized CV that is tailored to the job (ATS friendly as well)"}, {"comment_number": 2, "score": 2, "comment": "Hey, love the idea and the initiative. I’m also working on something similar but not for Reddit. I do run development studio offering multiple services, would love to discuss this idea and the experiment."}, {"comment_number": 3, "score": 2, "comment": "Hey, this sounds sick. I’m running a small dev agency, we build custom websites, apps, and handle hosting too. Been growing mostly through Reddit convos, so this kind of sniper tool is exactly my jam.\n\nI’m down to be one of your testers. Right now I’m looking for entrepreneurs or small business owners complaining about website pain (bad performance, clunky builders, no online presence, etc).\n\nHappy to give real feedback too. DM me if it fits."}]}, {"post_id": 58, "title": "What's the ROI of starting your own subreddit for product growth?", "score": 24, "total_comments": 3, "url": "https://www.reddit.com/r/growthhacking/comments/1mobhr3/", "content": "I'm the PM of [sheet0.com](http://sheet0.com) , an AI data agent. We're launching our MVP right now. Our value positioning is: Sheet0 transforms any webpage, file, or API into a clean, analysis-ready spreadsheet with zero hallucinations.\n\nWhile preparing for our Reddit marketing, we noticed many products like Manus, Lovart, Genspark, have built their own subreddits. I'm curious: how much does this actually help with growth? Is the ROI worth it compared to other channels?\n\nWould love to hear your experiences if you've tried this. And if you're curious about what we're building, feel free to test our product and drop a comment or feedback!", "top_comments": [{"comment_number": 1, "score": 2, "comment": "Self-hosted subreddits drive growth only when you treat them like a living support forum, not a billboard. For my last launch we seeded twenty how-to posts, answered every question within an hour, and pinned a public roadmap; within eight weeks the sub was sending 18 % of sign-ups and cutting Zendesk tickets in half. Key metrics worth tracking are weekly active commenters, referral traffic, and the share of new visitors who click the subreddit link inside Google SERPs-those SEO crumbs get overlooked. Compare that with a Discord or a Circle space: they convert faster but miss the search lift. I’ve run experiments with Discord, Product Hunt discussions, and Launch Club AI for broader Reddit outreach; the sub itself still gave the steadiest, compounding returns. When you’re ready for daily hand-holding, a branded sub punches above its weight; if not, borrow existing threads first."}, {"comment_number": 2, "score": 1, "comment": "Honestly, starting a subreddit can build a solid community, but the ROI depends on your engagement levels and consistency. It's not a quick win. I've found using services like Launchetize helps more directly with initial traction, especially if you're launching on Product Hunt. Keep it authentic, engage genuinely, and you might see steady growth."}, {"comment_number": 3, "score": 1, "comment": "Starting your own subreddit is basically a waste of time tbh. Working at an agency that handles campaigns for SaaS products, I see companies try this constantly and it rarely works.\n\nYour own subreddit will be dead for months. Nobody joins empty communities and you'll be talking to yourself. Our clients who tried this approach got maybe 50 subscribers after 6 months of posting.\n\nWay better to focus on existing subreddits where your target users already hang out. Places like r/analytics, r/datascience, r/entrepreneur. Build relationships there first instead of trying to create a community from scratch.\n\nThose companies you mentioned probably started their subreddits after they already had significant user bases. Putting the cart before the horse if you're still in MVP stage.\n\nSpend that time on direct outreach or content marketing in established communities instead. Much better ROI."}]}, {"post_id": 59, "title": "Hacking brand impact when attribution is a black box", "score": 1, "total_comments": 0, "url": "https://www.reddit.com/r/growthhacking/comments/1moagjb/", "content": "Brand marketing attribution sucks. We all know it. You pour months into a killer podcast, launch a shiny new content hub, or pull off a big event… and your attribution dashboard gives all the credit to some last-click ad that just happened to show up at the finish line. \n\nThe sales team’s hyped, but finance is still staring at you like, “Where’s the proof?”\n\nFor years, I twisted myself into knots trying to jam brand wins into those last-touch models. Total dead-end. Budget talks felt like tiptoeing through a minefield. CFO conversations? Awkward at best. It’s maddening when you *know* brand is working, but the numbers refuse to show it.\n\nSo I ran some experiments: holdout tests, digging into share of search as a real proxy for market share, and stopped chasing every single click. Instead, I hunted measurable shifts finance can’t argue with.\n\nWas it easy? Hell no. Perfect? Not even close. But it flipped the whole CFO conversation on its head, turning what felt like a guessing game into ", "top_comments": []}, {"post_id": 60, "title": "Solo Founders: What’s Your Most Draining Recurring Task?", "score": 4, "total_comments": 9, "url": "https://www.reddit.com/r/marketing/comments/1mor7ie/", "content": "I’m a one-person team for a small product; stakeholder reviews, investor intro calls, and social media cadence quickly pile up my calendar each week.  \nI am wondering - Which repetitive tasks slows you most, and have you tried any tricks to automate even a slice of it—how?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 3, "comment": "Ditch social media bullshit and just build product and get funding.\n\nMost draining thing is all the bullshit investor calls. IR decks and reviews are mostly a wash because no one is actually looking at it, don’t spend more than 10 minutes on it. If they want to be that involved at your stage, have a one on one and ask them how they can help you, rather than just cry about a spreadsheet.\n\n7-9 should be strategy planning, deck building, and gbs. 9–12 and 1-3 should be investors or sales calls, 3 to 9pm should be product.\n\nAt your stage, automatign repetitive tasks makes little sense.\n\n1. You really shouldn’t have too many repetitive tasks.\n2. The company is likely too dynamic to spend 2 hours building tooling to automate a 10 minute job which will be obsolete and just more tech debt slowing you down.\n3. Don’t sell us some bullshit ai agent to help automate tasks, which is what OP is actually doing. I just answered the questions for others who may view this."}, {"comment_number": 3, "score": 2, "comment": "following cause i’m curious"}]}, {"post_id": 61, "title": "Traffic drop-off", "score": 3, "total_comments": 2, "url": "https://www.reddit.com/r/marketing/comments/1moi3q7/", "content": "I work for a local flooring company and over the last 6 months we've managed to improve our call and in-store traffic quite a bit, last month was the highest grossing month the store has had. However, since the last week of July our in-store traffic and general call traffic has taken a nose dive, not sure why, I found 1 issue with our Google Ads bidding but fixed that and its back to normal but overall its slow all on all aspects, even organic calls are way to low to be normal even with us constantly ranking higher in organic search and being in top 3 reults on Google search in our area, I understand things can slow down with the back-to-school time of the year but this is the slowest its ever been. Any help on this would be really helpful. ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "Does the drop in physical traffic and calls correspond with any of your data? Do you see a drop in organic traffic? What does GBP numbers look like? You mentioned an issue with your ad account, but you didn't say if there was a drop in traffic and whether or not it's back up?\n\nEdit:\n\nAre you using any other media? Offline? Online?"}]}, {"post_id": 62, "title": "Every client’s problem!", "score": 10, "total_comments": 32, "url": "https://www.reddit.com/r/marketing/comments/1mocn0h/", "content": "I am an experienced Seo person, trying to take freelancing. Got 3-4 clients, discussed with them the whole project. And lastly when its about the money(very minimal amount) no one wants to pay. As its like they think Seo is very easy and all. ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 19, "comment": "You need to qualify better or choose better businesses to target. And don't sell SEO, sell more leads, cheaper. I'd never in a million motherfucking years pitch SEO or put that on an invoice or proposal. Call it \"Premium Digital Services\" or \"Inbound Marketing Placement\" (etc.) depending how marketing savvy the client is. Those phrases suck but you get the idea. Never sell a commodity. Sell something people can only buy from **you**."}, {"comment_number": 3, "score": 8, "comment": "If they needed SEO, I mean reeeeally needed it, they'd pay whatever it took to get it done. If this were a problem that was truly causing issues in their business, your price tag wouldn't matter. Even after you discussed the project, they didn't feel it was for them. This is actually good. It means you're not reaching the people who need what you offer, and now you can pivot and find them. Talk to ppl who desperately need SEO."}]}, {"post_id": 63, "title": "How do you get traffic to your website that has nothing on it.", "score": 11, "total_comments": 27, "url": "https://www.reddit.com/r/marketing/comments/1mo5knr/", "content": "I've started at company about six months ago that is undergoing a big change and coming out with a website and membership service.\n\nThey have now launched the website but it will be a while until the membership launches. My task now is to \"increase brand awareness\" which for my boss translates to web traffic and social media followers. \n\nAnd in the background the offering and the target audience is so general that we are addressing multiple different people in every post \n\nI'm posting on our social media, it might as well say...I hope you're hungry for nothing... Because every post is talking about what's to come and well there's fuck all.\n\nI'm trying to get some guest blogs sorted with the one expert that seems interested in producing content but at the moment I can't even do some guerilla style comments on Reddit or Quota because I don't know what the website does or when I do they rejig the planned offering.  Management are also against onsite blogs. ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 10, "comment": "Well, you have the answer at the end - it's going to be relevant and SEO optimised blog content, maybe leading to a basic waiting list or something like that. If your higher ups aren't willing to support such an absolutely basic action, I hate to see whatever value this membership of theirs is going to amount to."}, {"comment_number": 3, "score": 7, "comment": "Sounds like you're being told to sell tickets to a movie that hasn't been made yet"}]}, {"post_id": 64, "title": "Found this around, haha 😂", "score": 16, "total_comments": 6, "url": "https://www.reddit.com/r/marketing/comments/1mo4bys/", "content": "No text", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "[removed]"}, {"comment_number": 3, "score": 1, "comment": "[removed]"}]}, {"post_id": 65, "title": "What tactics are you implementing for ABM?", "score": 10, "total_comments": 14, "url": "https://www.reddit.com/r/marketing/comments/1mnjn6p/", "content": "I just got my stodgy company up to speed on what ABM actually is and we've launched our first email campaign. It was a huge success, with open rates in the double digits when we typically see 3% or so. \n\nWe're a supply chain solution provider (fancy name for trucking and warehousing) and we sell primarily to really big companies. Our buyers are typically either procurement executives or logistics executives. \n\nThe historical strategy has been lots of golf and cigars and...then revenue? Which is not working anymore. \n\nWhat kind of tactics is everyone implementing? I've started gathering information from some luxury branding companies as a way to elevate the lead generation experience. I hate paying for ads as the performance is always so unpredictable and our customers are not really swayed by ads. ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 11, "comment": "Great question. IMO ABM = Good marketing. \n\nWorkflow I've seen that work well (B2B SaaS):   \n\\- Account scoring / interaction model (how many contacts have interacted, any intent data, etc)   \n\\- Mark 100 or so accounts as your \"target accounts\" - this needs to be aligned with sales  \n\\- Turn digital awareness campaigns so they're familiar with your brand (ABM vendors will tell you how much your ads are impacting revenue, etc - personally I think that their metrics are a load of BS. No way should you associate won revenue with an impression of an ad on some random site to an unknown contact. The real value of these campaigns are insights, scoring, and automating ads and nurture sequences)   \n\\- Nurture/engagement programs tailored to their segment or business/usecase from marketing   \n\\- SDR/AE personalized outreach with the same   \n\\- Invite to events and conferences   \n\\- Direct mail to those individuals there interacting and your ICP   \n\\- High touch experiences (whisky and cigars still work)   \n\\- Personalized landing pages with \"letters from the CEO\" \n\nJust one work flow I've used and have seen some success."}, {"comment_number": 3, "score": 2, "comment": "If you say so. I’ve sold giant supply chain deals via ads.\n\nThe sales team and actual capabilities have to be in place before you can make the sale tho. Jim bob with rented trailers, three tractors, and a big steel building in the backyard isn’t going to close Red Bull on a supply chain deal."}]}, {"post_id": 66, "title": "The $0 marketing step that most businesses still skip", "score": 134, "total_comments": 48, "url": "https://www.reddit.com/r/marketing/comments/1mndugt/", "content": "I’ve noticed something while consulting small businesses: Many are active on Instagram, Facebook, and LinkedIn… but they’ve never set up or optimized their Google Business Profile.  \n  \n\\- It’s free.  \n\\- It gets you in Google Maps.  \n\\- It helps you rank for “near me” searches.  \n\\- And it can drive leads without any ads.  \n  \nYet so many businesses ignore it because it’s “not exciting.”  \n  \nOne client I worked with went from 0 to 50+ local calls per month after we set it up and posted updates weekly.  \n  \nI'm curious what’s one free marketing tactic you think is massively underrated right now?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 72, "comment": "Man, Google was such a bitch to deal with when I wanted to remove company address once we went fully remote. It then listed us as closed, so trying to get someone to say we were open with no address took weeks. They kept just saying they were looking into it.\n\nNecessary, yes, easy to manage, eh."}, {"comment_number": 3, "score": 23, "comment": "Totally with you on this. I’m amazed how many businesses spend hours on Instagram reels but haven’t even claimed their Google profile. It’s basically free SEO"}]}, {"post_id": 67, "title": "How do you structure follow-ups when someone opens your email but doesn't respond?", "score": 9, "total_comments": 35, "url": "https://www.reddit.com/r/marketing/comments/1mmymav/", "content": "Curious how others handle follow-up sequences when you know someone opened your email but didn't reply. Do you reference the fact that they opened it? Or keep it vague?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 16, "comment": "Don’t reference the open. It’ll be perceived as a confrontation. \n\nGive them more of what they opened. \n\nWas the first email about? \n\n- A discount? Give them more about financial value. \n- a new feature? Give them more about functionality. \n- a company update? Give them more About Us \n\nYou can also reevaluate expectations. Maybe a reply is unreasonable. Give them something to download, something to click. \n\nTender that people aren’t monoliths. Just because they started with one interest doesn’t mean it’s their only interest. Give them more of what you know they like, but don’t exclude everything else."}, {"comment_number": 3, "score": 14, "comment": "You can pretty much guarantee a negative reaction if you mention knowing they opened your email. People prefer to not think about the tracking and surveillance they are subject to."}]}, {"post_id": 68, "title": "Co-Pilot (Enterprise version) for Marketing. What’s doable and what’s not AI-wise?", "score": 17, "total_comments": 27, "url": "https://www.reddit.com/r/marketing/comments/1mmlxhz/", "content": "Please, no Microsoft naysayers. This is a practical question. I’m CMO of a B2B firm and organizationally there is a strong preference for security reasons to utilize Co-Pilot (paid version) for as much as possible at our 250 person firm. We are M365 shop. I am looking to develop a list of what CP can and can’t do Marketing task/activity wise. If you’ve had to do this exercise, would love to see what you’ve come up with.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 8, "comment": "Hoping you get some responses here; I too am interested!"}, {"comment_number": 3, "score": 5, "comment": "Same boat as you. We are only allowed to use Co-Pilot. Professional services industry. Director of my industry marketing groups. My teams use it to build buyer personas, campaign ideation, generating a first draft of any copy, proofreading, and we've built several prompts that incorporate our writing style. We also use it for meta descriptions and so forth."}]}, {"post_id": 69, "title": "Should a company that operates in 4 regions only focus on improving marketing in one stable region?", "score": 3, "total_comments": 13, "url": "https://www.reddit.com/r/marketing/comments/1mm4oc0/", "content": "Fictional company.\n\nPreviously, marketing expenditures have increased to be significantly higher compared to that of the competitors. A stable region is one that has kept its market share constant throughout the years. Last year, marketing expenditures were reduced as the company was like to go into default. On the other hand, market share decreased by 1% in other 3 regions due to these cuts.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "It's hard to know without the specifics. However, a stable region is often associated with the maturity stage in the product lifecycle, usually followed by decline. And we usually don't want to rely too much on that region because then the company is expected to decline too.\n\nIf possible, I want to have a combination with other region. For example, a region which isn't stable yet and still has potential for a lot of growth."}, {"comment_number": 3, "score": 1, "comment": "[removed]"}]}, {"post_id": 70, "title": "Suggestions for upskilling?", "score": 2, "total_comments": 0, "url": "https://www.reddit.com/r/productmanagement/comments/1mot4zo/", "content": "Hi everyone!\n\nI currently work as a PM in IT consulting for almost 2 years. I've written and groomed epics, owning quite a few of them and have experience working in cross functional teams. I like the process of working with Ux and software engineering teams to ultimately create software that helps people.\n\nHowever, I cannot seem to ever get interviews whenever I apply. I don't know what it is truly. I've worked with several time clients at my firm, including top CPG and telecommunications firms. \n\nShould I mention the firms in my resume and what I did? Is it my gpa? I went to a top 10 university and graduated with a 3.4-3.5 gpa, after studying math and econ. In addition, I also struggled with actually getting the job when I had applied. But I feel like I have a lot more experience now. \n\nWould really appreciate any/all help and if anyone could possibly provide guidance/mentorship. Even a simple resume review would be helpful!\nThanks so much :)", "top_comments": []}, {"post_id": 71, "title": "PMs in top down environments", "score": 15, "total_comments": 8, "url": "https://www.reddit.com/r/productmanagement/comments/1moryjc/", "content": "My last company was very top down with the leadership team (really the CEO) driving the roadmap on what needs to be prioritized. Things would constantly be added, and the product and engineering teams would need to jump on it and deliver asap (stakeholders were obsessed with dates). Product was a very generous term - I’d say we were more business analysts writing really detailed, technical specs and focusing almost wholly on execution and delivery. \n\nThe culture was fear based, low trust and adversarial. The expectation was to be deep in the weeds, data driven and always prepared for gotcha questions from stakeholders and executives. \n\nThe business teams didn’t trust tech (product and engineering) and the tech teams felt under appreciated and misunderstood. The business teams called the shots though and didn’t really care what tech teams thought. Despite all this, the company was wildly profitable and in hyper growth. \n\nI found it quite fascinating. Does anyone have experience in envir", "top_comments": [{"comment_number": 1, "score": 22, "comment": "very common actually."}, {"comment_number": 2, "score": 19, "comment": "This is most b2b companies really."}, {"comment_number": 3, "score": 6, "comment": "Our culture among peers is decent enough, but holy moly are we top-down big time. And it's only gotten worse over the recent months as we are about to go to pilot on a flagship 0-to-1 product that's taken around 15 months to build.\n\n\nI'm a somewhat newly promoted Director of Product, normally meant to be one of three, but one left a few months ago (VP is backfilling, but no offers extended yet) and the other is out one more month of their 7-month maternity leave. So it's just been me and the VP for awhile.\n\n\nI have two direct report PMs and one open req I'm trying to fill. In the meantime, I'm doing all the strategy and initial execution work of that open req, still doing IC work for a suite of MVP initiatives that were on my plate when I was a Group PM, and trying to keep my two PMs motivated while working with a newly promoted Engineering Manager who can't seem to make the mental leap from IC to team leader.\n\n\nSo the VP has 6 PMs reporting directly to them for the time being, and they have gradually gotten incredibly hands-on over time as a result of this.\n\n\nNow all the PMs, even mine, are doing iterative strategy, design, and execution reviews with the VP and CEO on almost every little body of work.\n\n\nJust yesterday VP asked me if I was satisfied with the velocity of my Senior PM's discovery and planning for a 0-to-1 initiative she's been leading since her first day a couple months ago.\n\n\nThe very same initiative that the VP has had this PM and I present the PM's approach three times now with each time the VP ignoring all the research and feedback from customers, Sales, and Customer Support, saying they don't agree with it and to go back to the drawing board.\n\n\nThat was the closest I've ever been to straight up losing my shit on my boss."}]}, {"post_id": 72, "title": "AI Prototyping", "score": 3, "total_comments": 5, "url": "https://www.reddit.com/r/productmanagement/comments/1morpue/", "content": "It seems that 'Vibe Prototyping' is becoming more and more discussed in the community.  \n\n\nNumerous guides (Featured on Lenny's and AI Product Circle) have 60+ minute guides on how to adequately prototype within vibe coding tools. One of them even costs upwards of $999 for the guide... This seems antiquated  \n\n\nI'm curious what systems everyone is looking at implementing to produce lifelike product recreations to prototype on top of?", "top_comments": [{"comment_number": 1, "score": 7, "comment": "what outcome are you actually trying to drive with ai-based prototyping?\n\na common trap i have seen with PMs and myself as a ux engineer is spinning up prototypes just because we can. ai makes it easy to explore shiny ideas but many of them would take months or years to build because of technical, legal, or business constraints.\n\neven for stakeholder demos we now keep things bare bones. when a prototype looks too polished it sends the wrong message that it is almost ready. people often overlook the “this is just a prototype” disclaimer.\n\nthis is where friction with engineering starts. executives see what looks like a complete app made in two days and start asking why engineering cannot build it in the same time. it creates unrealistic expectations, pushes for shortcuts, and puts engineering in a position where they have to justify the complexity of real implementation.\n\nai prototyping should be used with intent. ask if it moves the conversation toward a validated direction, helps uncover unknowns, reduces risk, uses the right fidelity for the audience, and avoids setting false expectations. sometimes the most valuable ai prototype is rough and clearly experimental so it sparks the right discussions without undermining engineering."}, {"comment_number": 2, "score": 3, "comment": "Seriously, fellow PMs, Lenny and these courses are here to sell to you. It’s several times a day that topics like this get posted on Reddit Product Subs. \n\nThe advice is the same. \n\nFocus on your customer. Produce minimum prototypes if you must, that can literally be screen shots in power point or something in Figma. Validate your theories. A/B test your hypotheses. It’s not about vibe coding. It’s about understanding user behavior so you can specify what to build. \n\nA fellow PM in my company proudly announced that they had integrated an LLM with Asana to write user stories. To what end?"}, {"comment_number": 3, "score": 2, "comment": "Totally agree, those $999 guides for 'vibe prototyping' sound like a rip-off. For actually getting lifelike product recreations, I think the focus needs to be on tools that can generate actual UI elements or even full pages from prompts."}]}, {"post_id": 73, "title": "How much time have you saved with demo automation?", "score": 2, "total_comments": 0, "url": "https://www.reddit.com/r/productmanagement/comments/1mor270/", "content": "\nBefore we changed our process, our sales team was stuck in a loop. We’d run 20–25 live demos every week, each one taking 30–45 minutes, and a many chunk of those calls were with people who weren’t even close to buying.\n\nIt was frustrating. The same “quick call” would turn into the same full product tour, over and over. Our presales team was getting pulled into deals way too early, and the high-intent buyers, the ones we should have been focusing on, sometimes had to wait to get a proper walkthrough.\n\nLast year we decided to try demo automation. We started using Consensus for personalized, interactive demos that change based on what someone clicks on, and Navattic for quick self-guided tours. Both tools connect to our CRM, so we can see exactly who watched, what they looked at, and how long they stayed engaged.\n\nThat changed everything. Now, a lot of prospects get the info they need before they even talk to sales. When they do book a call, it’s usually to dig into specific questions, n", "top_comments": []}, {"post_id": 74, "title": "If you had one month off, what resources would you use to level up your PM skills?", "score": 11, "total_comments": 26, "url": "https://www.reddit.com/r/productmanagement/comments/1moq1r2/", "content": "From refreshing the basics to getting senior, director, etc-ready—what learning resources do you study with this time frame?", "top_comments": [{"comment_number": 1, "score": 158, "comment": "I'd unplug entirely from all that is product management and get my mental health back on track."}, {"comment_number": 2, "score": 62, "comment": "I’d play golf all morning, fish all afternoon, and spend all evening with my family. Life’s too short to waste time off on this shit. Also, everything I know about product management I learned by doing so I have no idea how time off would teach me anything."}, {"comment_number": 3, "score": 15, "comment": "Buy a switch 2 and play random shit"}]}, {"post_id": 75, "title": "How to prep for first APM interview as a new grad?", "score": 2, "total_comments": 3, "url": "https://www.reddit.com/r/productmanagement/comments/1mop28t/", "content": "Hi! I have a 30-minute screening interview coming up for an APM role that means a lot to me, it’s for a lab building a platform in a linguistic field I care deeply about (sorry its vague, just for context).\n\nI’ve never interviewed for an APM position before and I really don’t want to mess this up. My past interviews have been for SWE, Project Manager, Technical Product Manager, and Business Systems Analyst roles. I’ve been watching Exponent videos and reading Cracking the PM Interview to prepare.\n\nAs a new grad CS + Linguistics major, I’d really appreciate any advice on what to expect and how to prepare, esp since I really, really care about this cause.", "top_comments": [{"comment_number": 1, "score": 1, "comment": "Good luck you got this!"}, {"comment_number": 2, "score": 1, "comment": "Do u know what types of question or the interview structure? This will help you narrow"}, {"comment_number": 3, "score": 1, "comment": "You’ve got to practice my friend\n\nBooks and videos will only take you so far\n\nThe best prep group is the Lewis Lin Slack group"}]}, {"post_id": 76, "title": "How technical are you getting", "score": 9, "total_comments": 20, "url": "https://www.reddit.com/r/productmanagement/comments/1mondb4/", "content": "How deep are you diving into the technical solutions and understanding the systems? I find that I have to deeply understand what systems we will be touching, how the apis will look, reveling solution diagrams, etc. Just wondering how deep everyone is going into solutions tech etc. ", "top_comments": [{"comment_number": 1, "score": 14, "comment": "I need to know why what the engineers and technical people talk about matters. If we use it frequently, I learn the basics of how it’s administered and what the risks are I need to think about. If I can trust my team to tell me I do less. But I am sure to know how to read an architecture diagram, the basics of all the cloud services we use, and dive deeper if there’s a debate and I need to help by asking the right questions to help others get to the right answer"}, {"comment_number": 2, "score": 12, "comment": "As a former architect, I may be the wrong person to answer, but here goes.  \n\nI like to know how the thing works.  What parts and pieces there are.  As my CS professor used to say, \"the gozintas and the gozoutas.\"  I don't need to know the inner workings and I don't need to see the code.  So, I expect my senior eng peers to be able to draw on a whiteboard the system architecture and talk about WHY it works that way.  Then I know when I ask for something what I'm asking for.\n\nYou really should not have to know the technical detail, but understanding it at a high level makes it WAY WAY easier to talk to engineering.  Of course, you do have to creatively forget all of that sometimes.\n\nI have had cases where I intentionally ask for a feature that I know breaks things.  I'll get pushback like, \"hey, it doesn't work that way\" or similar.  I know, we're going to change it.  It's software, we can do that.  \n\nWhat I absolutely do not do is override engineering on a system design.  I'm not going to build it, I'm not going to maintain it.  Even if I think their design is wrong, that's not on me.  I may ask if I can give them feedback, I may share my concerns, but it's not my call.  I'll just say, \"the requirement is X and Y.  Can you meet those requirements with the proposed design?\"  If they say yes, it's on them to deliver.  \n\nSo, yes, it's helpful to know how the thing works.  But, no, don't be constrained by that if you need to do something big."}, {"comment_number": 3, "score": 8, "comment": "I need to know enough to be able to accurately translate it upwards, in an understandable way, without losing key detail. Likewise be able to translate requirements downwards in to actionable content for my team(s) to consider. \n\n\nThat takes at least a rudimentary working knowledge of how all the components sit together and work, which my teams tend to help me with. I always ask my teams to include layman's terms one liners on all our tickets for my benefit."}]}, {"post_id": 77, "title": "How do you keep your product backlog full of good ideas?", "score": 4, "total_comments": 8, "url": "https://www.reddit.com/r/productmanagement/comments/1mon23w/", "content": "Not talking about prioritizing. I mean, how do you even come up with enough ideas in the first place?\n\nI used to work at a newly built cashback app. A big part of my job was analyzing established competitors, how they structure offers, their user flows, the little tricks they use to keep people engaged.\n\nA few other things I tried to boost our backlog:\n\n- I’d actually read our customer tickets and complaints, find quick fixes/ideas.\n- Running slow A/B tests (we had a small user base, so each test took a while) and then twisting what worked into new experiments.\n- Looking at totally different industries that could work in cashback (like gaming retention loops).\n\nI admit I was new to the field, it wasn’t always easy. Do you guys have similar issues? Or actually just me 😓\n\nWhat’s your go-to when your backlog is looking thin? Where did you get better ideas if the tests just aren’t winning? ", "top_comments": [{"comment_number": 1, "score": 10, "comment": "I'm gonna take a wild guess and say your company doesn't have a clear set of goals and an articulable strategy, right? \n\nIf it did, it'd answer this question for you. If the higher ups had vision and goals, they're the perfect starting point for figuring out what threads to pull in terms of ideas for the product. \n\nI'm not attacking your company, every company I've worked in always had extremely vague goals and strategy, that barely ever went beyond \"make more money\". \n\nYour ideas seem sound though - competitors, adjacent/similar industries. Another is upcoming tech perhaps and trying to predict what way consumer behaviour might change in the coming years (guessing your B2C, right?)\n\nFor B2B you have the added advantage of Sales calls. If they're recorded/transcribed they're gold"}, {"comment_number": 2, "score": 7, "comment": "Customer feed back sythizied   \n\nMarket research \n\nYour boss telling you do things"}, {"comment_number": 3, "score": 4, "comment": "I don't. Having a backlog FULL of \"good ideas\" isn't realistic. Not even sure what \"good ideas\" means. But keep it pruned to the best of your ability. \n\n  \nSource: 11 years PMing. Maybe I'm just bad \\*shrug\\*"}]}, {"post_id": 78, "title": "Six sigma certification-is it worth it? Do any employers care?", "score": 0, "total_comments": 8, "url": "https://www.reddit.com/r/productmanagement/comments/1mojq4m/", "content": "There's a free six sigma certification training (green belt) at my office. Is it worth it? \n\nIt was never a certification I would have pursued on my own and dont think I'll use it in my current PM role. Do other employers look for this or could it ever help set me apart in the future? \n\nIm wondering if its worth the effort - but its also free... thoughts? \n", "top_comments": [{"comment_number": 1, "score": 9, "comment": "I’m a black belt six sigma and I always say that innovation is just a sexy way of saying continuous improvement.\n\nMost of the frameworks and concepts translates very well to digital processes and creating new business"}, {"comment_number": 2, "score": 7, "comment": "Not for product. Unless you work in manufacturing or maybe physical product development."}, {"comment_number": 3, "score": 3, "comment": "Free can only be beat by getting paid to get certified. I spent a lot of time in process improvement prior to product management. Those skills have been valuable. I manage a platform that primarily manages a tightly regulated but extremely variable physical production process. I spend a good amount of time on our guardrails to prevent and predict defects. \n\nIf your product has a process that doesn’t have established best practices, it can likely benefit from a process improvement perspective. That said, I wouldn’t seek out six sigma course for myself if I had to pay or it was inconvenient with my schedule. There are plenty of good resources available for free and certification isn’t going to get you a new job."}]}, {"post_id": 79, "title": "Someone give this person a raise!", "score": 0, "total_comments": 6, "url": "https://www.reddit.com/r/productmanagement/comments/1moj3ko/", "content": "People at QWEN CHAT were the ones who thought\n\nHmm... will most people save multi-page reports in chats and come back later to read them? Or will they like to save them as PDFs to be referenced later and read over time?\n\nThe latter seems to make more sense. Let's do that!\n\nTo the people working at marquee LLM chat apps: please remember that we are human too 🥲. These are tools to make things more convenient, and at least to me, this is one of the peaks of it.", "top_comments": [{"comment_number": 1, "score": 9, "comment": "I don't know what's going on"}]}, {"post_id": 80, "title": "How important is a business email?", "score": 1, "total_comments": 1, "url": "https://www.reddit.com/r/smallbusiness/comments/1mowwkt/", "content": "Hi everyone. I recently started a data consulting business and am currently in the process of identifying potential leads after finalising my niche. My main question is: How important is having a professional email address when doing outreach? I’m planning to use LinkedIn and email as my primary channels for the initial pitch.\n\nMy current strategy is to secure the first client, as that’s usually the most challenging part, and then invest more heavily in the business afterwards. I know it's like $5 but in the past, I’ve found myself spending too much time setting up the business rather than actively finding ways to generate revenue. Things like designing a logo, coming up with the perfect name, building a website, and setting up a business email often took priority over actually reaching out to potential clients. This time, I want to flip that approach and focus on getting a client first.\n\nPreviously, I used Google Suite and didn’t have any issues with it. However, if you believe a prof", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}]}, {"post_id": 81, "title": "Recommended Apps for book keeping", "score": 1, "total_comments": 2, "url": "https://www.reddit.com/r/smallbusiness/comments/1movu55/", "content": "I am running a company with anual turnover between 250-500k. No employees, but sometimes hire help on project base. Getting a lot of invoices by mail and email as well as cash receipts. Sometimes i even get supplies from second hand marked without receipt.\n\nI find myself spending most weekends doing the book keeping and VAT reports instead of relaxing with the family. Is there any app that could make my life easier? How does others deal with this?\n\nThanks for any recomendation!", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 2, "comment": "Mostly people thought to work solo and take over business lonely but the fact is if you running a company without hiring employee at least one person you’ll go down that you don’t have family time and not for personal work. You need to hire the person for small work so you’ll relax in the weekend. I also run a business and I hire person just for my piece of mind and relax in the weekend."}]}, {"post_id": 82, "title": "Is there demand for a local moving & transport service in my city?", "score": 0, "total_comments": 5, "url": "https://www.reddit.com/r/smallbusiness/comments/1movlbm/", "content": "Hey everyone,\n\nI’m planning to start a small-scale moving and transport service in my city — mainly for room shifting, furniture transport, and goods delivery.\nBefore I dive in, I wanted to know from you all — do you think there’s a real demand for this kind of service locally? \nWhat are some challenges I should expect?\n\nAny insights or suggestions would be super helpful!\n", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 4, "comment": "i mean… what is your city? 😭"}, {"comment_number": 3, "score": 2, "comment": "Hello Arpan, From India"}]}, {"post_id": 83, "title": "Struggling to get more Google reviews?", "score": 0, "total_comments": 2, "url": "https://www.reddit.com/r/smallbusiness/comments/1movbrz/", "content": "  \nChumly helps local businesses get 5⭐ reviews automatically, reply instantly with AI, and protect their reputation — all in one dashboard.  \n💬 See how it works here: [https://nyx.app.embedmyreviews.com/](https://nyx.app.embedmyreviews.com/)", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "Thanks spez, here’s a juicy one - ask your engineering team how the algorithm didn’t catch this much spam/solicitation"}]}, {"post_id": 84, "title": "What’s the most frustrating part about handling bookings in your business — the no-shows, the double-bookings, or the endless back-and-forth emails?", "score": 0, "total_comments": 3, "url": "https://www.reddit.com/r/smallbusiness/comments/1moumgj/", "content": "A local pet grooming shop I worked with had 6–8 no-shows a week, costing them hundreds in lost revenue. After introducing an automated confirmation & reminder system, their no-show rate dropped by 60% in a month. The owner said it was like ‘getting an extra staff member without the salary.’\n\nI’m curious — how do *you* handle missed appointments right now?", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 3, "comment": "Stop emailing and pick up the phone.  \n\nYou’d be amazed how far 20 minutes of dialing will go to keeping appointments and making customers happy. It shows a level of care for a 10 second confirmation call."}]}, {"post_id": 85, "title": "Business transactions", "score": 0, "total_comments": 1, "url": "https://www.reddit.com/r/smallbusiness/comments/1moue4f/", "content": "I have an operating small mom and pop business and a holding company under a grantors trust, that  I use for investments. Can the operating business loan some of the profits to the holding company for a reasonable fair market interest rate for asset protection? ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}]}, {"post_id": 86, "title": "Has anyone heard about these franchises?", "score": 1, "total_comments": 3, "url": "https://www.reddit.com/r/smallbusiness/comments/1mottgx/", "content": "Hey guys!\n\nI’m a mechanical engineer with more than 8 years of experience in the water/wastewater industry (municipal treatment plants and sewage network/hydraulic design).\n\nEven though I’m a mechanical engineer, I’ve worked from the process standpoint most of that time. My role included project management as well, so I’m also familiar with the electrical and civil part of the projects.\n\nI’m really interested in starting a business in this industry and I came across “Trinity Water Solutions”, who apparently offers franchises related to water/wastewater treatment processes/consultancy (I cannot share the link to their website, but it’s the first result if you google it).\n\nThe only doubt I have is that I did some research about it and I couldn’t find any franchisees experiences or anything like that.\n\nI was wondering if anyone has ever heard or worked with this company before.\n\nThank you!", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "I've never heard of them and their website is extremely basic.  Like so basic you could throw it together with little experience in a few hours.  Both addresses go to random houses in suburban neighborhoods.\n\nNot exactly giving off good vibes.  The only real info on their site is that you should pay them money for a franchise. \n\nAlso the email given is attached to a linkedin profile that has 22 connections and the only work experience is for the company itself. The last post was 2 years ago.\n\nhttps://www.linkedin.com/in/don-reid-58a6341a7\n\nBased on this alone, I'd pass.  It seems like someone who wants to make \"easy\" money on a franchise instead of running their own business."}]}, {"post_id": 87, "title": "Do you think my pay rate is fair?", "score": 4, "total_comments": 11, "url": "https://www.reddit.com/r/smallbusiness/comments/1motq0h/", "content": "So for context I’m a window tinter and I have my own business. I’ve had my own business for about a year now. Before and during I started my business I was working at two different shops. My goal was to always have my own business, and once it started to pick up I quit the last shop. I also really like working for myself because I had issues with my previous bosses when it came to materials and issues with their shops. \n\nI currently only tint cars, but now that I’m making enough money to insure myself to do commercial buildings (since it’s a hell of a lot more expensive) I would like to start tinting buildings. The last shop I worked at, the boss would send his detailing apprentice with me to help tint. I never actually made him tint the windows but I had him blade and clean the windows as well has help me handle the film. I’d like to hire someone part time to help me with this work since I found the apprentice helping me to be extremely resourceful and it helped speed the process up. ", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 6, "comment": "You’re paying over double minimum wage for what you’ve described as “not hard work,” and that’s before they’ve even learned the technical side. Then bumping them to $27/hr once they can actually tint on their own? That’s a solid incentive and way above what most local trades pay entry level helpers. The only thing I’d consider is making sure you structure it so you’re not overpaying someone who’s dragging their feet.... maybe have clear benchmarks for when that raise kicks in. But rate wise? You’re being generous"}, {"comment_number": 3, "score": 2, "comment": "In my experience you're not going to get unskilled labor that doesn't have a drug problem or a felony charge for less than 18-20 bucks an hour in a median COL area. If you're looking for somebody with moderate experience who can go out and directly make you money without you supervising them, that's worth a lot more and is going to depend on how much you make on the jobs. 27-32 an hour seems reasonable for the type of job that you've described, but window tinting is not my area of expertise. I have no idea how much you're overhead is. Don't underestimate overhead!\n\nOne other thing I've learned is that you're not going to get good labor for cheap, and on the flip side paying a lot does NOT guarantee good labor. It's so much more complicated than \"PaY mORe aND YoU'lL Get GUd PeOplE\"...You're just going to have to put out an ad, test the market, interview a lot of people, and see what works.\n\nBTW. You'll probably go through a few employees before you find someone great. Hire slow, fire fast."}]}, {"post_id": 88, "title": "Approached by “synergistic”company to my company", "score": 4, "total_comments": 6, "url": "https://www.reddit.com/r/smallbusiness/comments/1motlk6/", "content": "My small business, call it installation and service company for a household product in high demand, was approached by a large local company who I work quite closely with because our products “go together” if you will. When we get a sale, the client needs them after we install. We constantly refer clients back and forth to each other as we have complimenting services to one another. \n\nSo they approached me to inquire about my business and it’s obvious they’re actually the ideal buyer and I would be worth way more to them than almost any other buyer (except for maybe their own competitors). \n\nMy quick figures are $700K rev ($80K of which are recurring service contracts the rest sales), $100K SDE, and I pay myself $50K salary (not included in SDE). I am a one man army and understand 1.5-2X SDE is probably max I could get because I am my whole entire business and don’t really have an easily sellable business (unless someone wants to buy my job and shadow me for a year to figure it out befo", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 2, "comment": "Did you talk to them about the deal? Stay on for 1-2 months? They will likely want you to stay on 1-2 years.\n\nI dont get their angle. It sounds like you are installing a big ticket item so no repeat sales, sort of one-and-done. Usually the buy for the client book, or the talent. If they are as big as you say they are, I dont get why they dont just start a competitor to you rather than buy you as a one-man shop.\n\nWho approached you? Some middle manager or the CEO/owner/district manager? \n\nIMO you're too small and young (as a company) to be selling already, and somethings fishy. They either have some trouble or want to use you for informaiton."}]}, {"post_id": 89, "title": "Scaling a Mobile Mechanic Business", "score": 0, "total_comments": 2, "url": "https://www.reddit.com/r/smallbusiness/comments/1motbiy/", "content": "Hello,\n\nI own and operate a mobile mechanic business that currently has no employees, and I'm wondering if anyone has any ideas on how to scale the business. I get about 8 calls a day; 4 of which are jobs that I can take. I'd say the 4 calls average out to about 8 billable hours. I don't take many of them because I don't have the time to do it myself. I'd like to hire someone else to help with the workload, but considering the inconsistent schedule and lack of a home base, I'm not sure how to go about it. \n\nI've considered renting a shop, but it would also cost about $1500/month on the low end. It would, however, allow me to have a tech working without the extra cost of an additional work truck, and provide me the opportunity to make a consistent schedule. \n\nI would prefer to keep the business completely mobile, if possible, and that's where I need help. What are the best ways to handle these aspects of hiring somebody?\n\n1. Having an inconsistent employee schedule \n\n2. Providing the em", "top_comments": [{"comment_number": 1, "score": 1, "comment": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed. Please also note our new Rule 5- Posts with negative vote totals may be removed if they are deemed non-specific, or if they are repeats of questions designed to gather information rather than solve a small business problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"}, {"comment_number": 2, "score": 1, "comment": "20+ years in the business, and you think this shit is \"easy\".\n\nGood luck with that..."}]}]