["\n            === POST 0 ===\n            Title: Any variation in routine leads to binging. Help!\n            Score: 2 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/loseit/comments/1ml1v5c/\n            Content: I’ve been losing weight steadily for a year and a half but I’m actually counting calories now after stagnating for a while. It’s been pretty hard, but I did at one point get into the swing of things. \n\nThen I sustained an injury that prevented me from my usual workout routine. Then my LDR partner came in to town and we ate several meals in restaurants, which I hardly ever do. \n\nIt’s been about two weeks since he left and I have been STRUGGLING. I was down to 179 before he got here and I was so excited. But there was also a little voice in my head that said, “don’t sabotage this.” And I feel like that’s exactly what I’m doing. I’m back up several pounds. I’m hoping most of it is water weight but my tracking has been horrible. \n\nAre there any tricks that you have used to get back on track? I am thinking of a gut reset or something similar. \n\nI can’t increase my activity just yet but I need to get my diet back on track. Mentally I feel like I’ve gained 30 pounds. So I just say it doesn’t \n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 1 ===\n            Title: Do digital scales have memory?\n            Score: 6 upvotes\n            Total Comments: 12\n            URL: https://www.reddit.com/r/loseit/comments/1ml0mtp/\n            Content: Hi, my digital scale has an annoying pattern and I’m trying to figure it out.  Any help is greatly appreciated.\n\nI’m not sure if memory is the right word, but my scale has this pattern where it will give a different reading three times in a row, then give the third result every time after that.  If I wait a few minutes it starts all over again.  Usually it starts lower and then goes higher but it will do it in reverse as well.  \n\nFor example, this morning it said 272.8, then 273.6, then 274 over and over.  I took a shower and it went back to 272.8. \n\nI’ve changed the batteries and nothing changed.\n\nDoes anyone know why it does that and which reading I should use? Should I just go with the first one? \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: I can't answer the exact question, but my advice is to just not worry about it.  You're talking about just over a pound.  Less than half a percent of your body weight.  It just isn't significant enough to matter.\n2. Score: 1 | Comment: One thing that some digital scales require is you to \"wake them up\" before you weigh yourself. They sometimes need to calibrate to zero.            \n\nOnly other thing I hear about is if the floor is unlevel (like if you have tiles under the scale)\n3. Score: 1 | Comment: We must have the same type of scale, haha! Mine is doing the same thing, but the good thing is that it's trending downward.\n==============================", "\n            === POST 2 ===\n            Title: Starting my journey- am I on the right track?\n            Score: 2 upvotes\n            Total Comments: 10\n            URL: https://www.reddit.com/r/loseit/comments/1ml0di4/\n            Content: Hello everyone. I just joined today, and am on day three of my weight loss journey. I did most of my decision making by researching online and, occasionally, asking a friend. I am a 5'11\", 280~ Male (my scale hasn't come in yet). Using a calorie deficit calculator, I set a goal of 2000 calories a day. The past three days, I've taken 20ish minutes walks, at various intensities. After, I come home and do some jumping jacks, squats and planks. My diet consists of a nutrition shake in the morning with a kind bar and a multivitamin, and prep meals through CookUnity for lunch and dinner (I have a busy schedule, they are convenient and not processed). Other than a diet soda a day so far, I've cut all soda and junk food. My goal weight is an arbitrary 200 pounds. Should I be worrying about anything else? Do I need to adjust anything? Sorry for formatting, I'm on my phone. \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Sounds like you're on the right track - just be patient and consistent. \\\n\nAnd it's worth being flexible too. Don't let the perfect be the enemy of the good. If you slip up and overeat one day, just jump right back into your plan. The folks who fail are the ones who binge on, like, a Wednesday and tell themselves, \"well this week is shot, might as well start over next Monday\" or something.\n2. Score: 1 | Comment: Sounds like you have a good start! Are you tracking just your calories or looking at your macros as well? Protein and fiber are going to be what helps keep you full the longest, so prioritizing them is most important, I think. \n\nThe movement sounds like a solid plan! Maybe up the walks as you get used to it, but not necessary. As long as you are enjoying it, that’s what matters. If you are looking to change it up, looking on YouTube for different home workouts is beneficial. I know I get bored with doing the same thing, but some people like the routine. \n\nMost important thing is to be consistent! It’s going to be tough at times, but you’ve got this! I’m really proud of you for starting and for reaching out! You’ve got this!\n3. Score: 1 | Comment: Sounds like you’re on the right track. The only thing you may consider at the weeks go on is whether or not the exact food/macro choices you are making are working for you. There are endless ways to eat 2000 calories, and not all of them work for everyone. Most people find focusing on fiber and protein helpful. Some people like lots of little meals, others like just a couple big ones. Totally get relying on a food service, but maybe just keep an eye on whether or not it’s really a good fit for you.\n==============================", "\n            === POST 3 ===\n            Title: skinny fat\n            Score: 3 upvotes\n            Total Comments: 3\n            URL: https://www.reddit.com/r/loseit/comments/1ml08u7/\n            Content: So I was stressed out and didnt work out while losing my weight. Before i gained the weight, I was in perfect tight shape. However, now I'm very small, but I have - not lose skin - im just jiggly and not tight. Im small, but I feel my arms and legs jiggle when I walk, and Im not used to that. How do I stay my size my stop this feeling? I dont know that strength training will magically change the fat to muscle.\n\n  \nAnyone go through this and change it?\n\nalso not sure why there has to be a word count here\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: It’s called Body Recomposition. Yes. Strength training will reduce fat and increase muscle. Both of these things will help a lot. It helps to stay at whatever calories you’re at currently, but raise protein if you can.\n2. Score: 1 | Comment: >I dont know that strength training will magically change the fat to muscle.\n\nHow else would it happen?\n3. Score: 1 | Comment: I dont know that strength training will magically change the fat to muscle.\n\nIt won't, that's not how it happens, but eating at roughly maintenance level while exercising, it's fairly easy (slow, of course) to replace fat for muscle. Way easier than while losing weight actively. \n\nStick with a basic routine and you will see result in 3 months or less.\n==============================", "\n            === POST 4 ===\n            Title: Is this normal and does anyone have similar experience and/or tips for me? Progress/question\n            Score: 1 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/loseit/comments/1mkzsdi/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: A reasonable, sustainable rate of weight loss is about 1% of your body weight per week, so 3lbs in 4 weeks is right on target, I'd say. And since you didn't actually know your starting weight, who knows about where you were before 181 three weeks ago.\n==============================", "\n            === POST 5 ===\n            Title: ★OFFICIAL WEEKLY★ Foodie Friday: Share your favorite recipes and meal pics! August 08, 2025\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/loseit/comments/1mkz54z/\n            Content: # Calories? I think you mean delicious points!\n\nGot some new recipes you want to try out? Looking for ideas for your next /r/MealPrepSunday? Just trying to get some inspiration before you give up and say \"Let's get takeout?\" - *again*? Fight the Friday funk, and get excited for cooking tonight!\n\nPost your favorite recipes here to share with the rest of the /r/loseit community! You can also share your meal photos via [imgur.com](https://imgur.com) links.\n\nDue to the spirit of the sub, please try to include the calorie and nutritional information if at all possible. MyFitnessPal has awesome recipe calculators you can use!\n\nBig thanks to SmilingJaguar for his many years of running our weekly Wecipe threads.\n\n*Due to space limitations, this may be a sticky only occasionally.* ***Please find it using the sidebar if needed.***\n\n**Don't forget to comment and interact with other posters here, let's keep the good vibes going!**\n\n*Daily Threads*\n\n* [**US Accountability Challenge**](https://www.r\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 6 ===\n            Title: Caloric deficet is making me a worse employee\n            Score: 4 upvotes\n            Total Comments: 13\n            URL: https://www.reddit.com/r/loseit/comments/1mkyqaw/\n            Content: I'm really accustomed to being able to coast while still excelling at work because I'm really good at what I do (software engineering). If I promised I would get something done by a certain date, it would always be done by then. I work-from-home and maybe I would fuck off on the days leading up to the deadline, but the night before I could say fuck-it and stay up until 3am and pound-it-out, and still wake up for 9am, no problem.\n\nA few months into my diet and I'm finding that almost impossible. Staying up past midnight has become really difficult and I certainly can't focus on engineering work past 11pm. I just hit a wall where, sure, I can stay conscious, but I won't get anything done. I'll just sit there and stare at my monitor.\n\nAlongside that, I'm going to the gym for like 2-3 hours 5 nights a week. I'm doing lifting sets because everyone and my education has told me to fight to maintain muscle when trying to lose weight... but then I'm supplementing with cardio afterwards to try t\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Having a good, consistent sleep schedule is really important for me to lose weight and to still function well while in a calorie deficit.\n2. Score: 1 | Comment: Procrastinating to the point that you have to stay up for multiple days to catch up isn’t “excelling” at anything, and it’s not sustainable. That has very little to do with your diet or weight loss efforts.\n\nYou’ve worked on your diet, now work on your procrastination and sleep.\n3. Score: 1 | Comment: So you're on what you recognize is an overly aggressive deficit and feeling the effects of that, but don't want to eat more and slow down? \n\nYour original work schedule isn't particularly normal. Health issues are linked to not having enough sleep just like being overweight, smoking, drinking alcohol etc\n==============================", "\n            === POST 7 ===\n            Title: Day 1\n            Score: 3 upvotes\n            Total Comments: 9\n            URL: https://www.reddit.com/r/loseit/comments/1mkykf2/\n            Content: Female\n1,7m / 5'6ft\n100kg / 220lbs\n48,8% body fat\n25 yo\n\nHello guys.\nI will just throw this here. Mostly to keep track of this journey and to mark where it starts.\n\nI have been \"trying\" to lose weight my whole life. Never because I wanted, always because of family pressure, nobody else ever told me I am fat or things like that. \n\nIt's quite sad to look at photos of when I wasn't THAT overweight, and realize that there was no need for people to pressure me so much about weight loss back then.\n\nI am doing this for myself for once. I have no motivation tho.\n\nI have way too many bad habits right now and it feels quite overwhelming. My sleep schedule is a mess, I spend way too much time in front of screens (working or not), I eat whenever I feel any kind of bad emotions or just when I am bored.\n\nMy mind is definitely my greatest enemy in all this.\n\nRecently I have been feeling quite sick and not even eating feels nice anymore. Also, I suspect I might have developed Type 2 diabetes. Don't wo\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Ask your doctor for referrals to a dietician (NOT a nutritionist) to talk about how to manage portion sizes and intake without strict calorie counting.\n\nThere's a reason strict calorie counting is basically the first thing everyone recommends: it works and it's the only way to know really track how much you're consuming. Trying to lose weight without it is like trying to manage your budget without looking at your bank statement. It's not impossible but it makes everything a lot less quantifiable. \n\nIf you really can't do it for mental health reasons, you should be working with a registered dietician to figure out alternative methods to reduce caloric intake. It is extremely possible and honestly pretty easy to exceed your daily caloric intake eating \"healthy\" foods when you're in a deficit. \n\nIf you don't *like* doing it....well, nobody does. It sucks. But if you have the option you should strongly consider it as it's the single best tool to help reduce weight.\n\nThe reality is, at your current weight simple lifestyle changes most likely will result in some weight loss, so that's good news. You will however need to start figuring out how to handle the more restrictive phase of weight loss once your TDEE goes down. I'm 100lbs down from 250 and lost down to around 200-ish before I had to go from \"better diet\" to strict calorie counting.\n\nAgain, you should speak with a dietician either way, but if you truly can't calorie count that will need to be an ongoing relationship as what your habits look like will need to evolve along with your weight loss.\n2. Score: 1 | Comment: Hey! i’m 28f ~203 lbs and sounds like we’re similar. if you wanna chat and keep each other motivated and share ideas im keen! :) \n\ni signed up for classpass and f45 because i realize i need the group socializing to actually work out. \n\nalso i bought a walking pad and try to hit 10k steps. \n\ni bought renpho body scale and tape measure to determine progress. \n\nmy diet is bad tho i always go out to eat. somehow i don’t wanna lose the moments with family and friends to just enjoy (and indulge). so im trying to select foods at home that are one ingredients and less yummy. like tuna and cottage cheese for lunch lol\n3. Score: 1 | Comment: No suggestions but wishing you well on your journey.   You’ve got this!\n==============================", "\n            === POST 8 ===\n            Title: Struggling with “switching” to maintenance.\n            Score: 10 upvotes\n            Total Comments: 10\n            URL: https://www.reddit.com/r/loseit/comments/1mkxetp/\n            Content: Well all, I did the thing. I lost the weight, from obese to normal BMI. I’m feeling really happy about this, obviously, but I’m really struggling with how to “switch” my mindset from loss to maintenance. My original goal was 160, then I decided to lower it to 155, which I hit last month. But I’m still losing. This morning I was 151. \n\nI’m very active: run 12-15 miles per week, swim 2-3 miles per week, lift heavy 2x/week. I’ve learned I love exercise. So my maintenance is probably ~2,000 cals/day, and that just seems like SO MUCH FOOD. I’m probably getting in ~1,700/day, and I feel like I’m really pushing to eat that much. (Thats an average, maybe on a Saturday when I’m out and about I might hit the 2k, but most days it’s 1500-1700.)\n\nMy brain is telling me that if I really eat the 2,000 on a daily basis I’m going to start to gain again, so it’s not letting me eat that much day to day. I was thinking maybe it would be helpful to slowly increase the calories, but I’m worried about losing\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: If you eat 2000K on weekends, maybe try eating to 200K  3 days a week to start. Do it with something highly caloric like an ice cream treat. Rather than trying to get 500 extra calories of fish or broccoli. Or slather some butter on a piece of bread. Do that for a bit and see how it goes. Then up it to 4 days a week. And so on.\n2. Score: 1 | Comment: Maintenance will get easier! Are there any higher calorie foods you can switch in? Maybe a fattier cut of meat, ice cream (real cream few additives), maybe extra cheese or a little more coffee creamer? Or even an extra protein drink, Fairlife has ones that are 42g P for 230 calorie that taste like nesquik. You’ll find your balance, healthy bmi is a range too and with how active you are it makes sense that you’re still losing.\n3. Score: 1 | Comment: My advice, never think, oh I put on some weight, I guess I will start losing again next week. \n\nStart immediately, nip it in the bud. Keep monitoring, weighing.\n\nthat is where I went wrong and bam! but the weight back on.\n\nTreat maintenance just like weight loss.\n==============================", "\n            === POST 9 ===\n            Title: Lost ~70 Ibs and now at a healthy weight. Skinny everywhere but stomach? Should I continue to cut or can I finally just recomp to build muscle faster?\n            Score: 2 upvotes\n            Total Comments: 5\n            URL: https://www.reddit.com/r/loseit/comments/1mkxeif/\n            Content: Hi, I’m 5’3” and I now weigh 134 pounds. I am skinny EVERYWHERE except my apron belly and my upper back but my back has slimmed down a good amount. My apron belly is not only stretchy/loose skin, majority is fat. But could I just recomp so I can build muscle faster? Or do I need to continue to cut? (Ugh) \n\nI weight-lift 3x a week (I will go 4x a week soon) and I am going up in weights every 1-2 weeks for my exercises, hitting 10,000 steps a day. I eat 1600 calories & 100-110g protein a day. My biceps, shoulders, glutes, and quads are growing too like crazy (noob gains lol). So I’m definitely doing something right in the gym and diet-wise! Idk if any of this information matters/is needed, but there you go.\n\nAlso, when do I start bulking so I can build muscle faster? I know I’m not even close to that point, but just wondering for the far future. Thank you!\n\n\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: it sounds like you're doing everything right and building muscle. Just keep the routine for now and see what happens to your body next\n2. Score: 1 | Comment: When I hit my weight goals, I had lots of similar questions. There's a pic I posted of my before and after, before (hit my weight goal) - after is after months a the gym, about the same weight. \n\nIt's really hard.\n\nI ate right about maintenance calories and just hit the gym.\n\nYou can do whatever you want, it's your body.  If you do what I did, you'll probably slowly replace fat with muscle.  The other school of thought is to bulk to build muscle, then once you hit a plateau, cut again. \n\nI personally have a hard time bulk and cutting, my apatite never seems to match my goals. So recomp seems better for me.\n3. Score: 1 | Comment: 48F, down from 109kg to 81kg in 6 months. Recomp aside (as I'm not doing any weight-bearing, just daily walking for exercise) I'm the same as you, wondering how much of my arse and boobs have to disappear before I start losing from my gut! I also have an apron belly and plan to get loose skin surgery. My goal is to get down to around 70-75kg then I plan to consult a surgeon so they can advise on whether or not it will actually be possible to lose any more from that area or is it mostly just skin. My plan is to get the surgery toward the end of next year because by then I should have lost all I want to lose and maintained for around a year, which is what's recommended before getting loose skin surgery.\n==============================", "\n            === POST 10 ===\n            Title: Daily Simple Questions Thread - August 08, 2025\n            Score: 6 upvotes\n            Total Comments: 44\n            URL: https://www.reddit.com/r/Fitness/comments/1mkq7kz/\n            Content: Welcome to the [/r/Fitness](https://old.reddit.com/r/Fitness) Daily Simple Questions Thread - Our daily thread to ask about all things fitness. Post your questions here related to your diet and nutrition or your training routine and exercises. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer.\n\n# As always, be sure to [read the wiki](https://thefitness.wiki/) first. Like, all of it. Rule #0 still applies in this thread.\n\nAlso, there's a [handy search function](https://www.reddit.com/r/Fitness/search?&restrict_sr=on) to your right, and if you didn't know, you can also use Google to search [r/Fitness](https://old.reddit.com/r/Fitness) by using the limiter \"site:reddit.com[/r/fitness](https://old.reddit.com/r/fitness)\" after your search topic.\n\nAlso make sure to check out [Examine.com](https://examine.com/) for evidence based answers to nutrition and supplement questions.\n\nIf you are posting a routine critique request, make sure you fol\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # Post Form Checks as replies to this comment\n\n### For best results, please follow the **[Form Check Guidelines](https://www.reddit.com/r/Fitness/wiki/posting_guidelines#wiki_how_to_post_a_form_check)**.  *Help us help you.*\n\n----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*\n2. Score: 1 | Comment: [removed]\n3. Score: 1 | Comment: Is it normal to feel a pec deck ([like this](https://www.shutterstock.com/image-vector/man-doing-machine-bent-arm-600nw-2379165459.jpg)) in my front delts? I do feel it in my pecs as well\n==============================", "\n            === POST 11 ===\n            Title: Physique Phriday\n            Score: 16 upvotes\n            Total Comments: 34\n            URL: https://www.reddit.com/r/Fitness/comments/1mkq75i/\n            Content: **Welcome to the Physique Phriday thread**\n\nWhat's the point of having people guess your body fat? Nevermind that it's the most inaccurate method available, (read: most likely way wrong - [see here](http://web.archive.org/web/20130301185720/https://paindatabase.com/body-fat/)) you're still just putting an arbitrary number to the body you have. Despite people's claim that they are shooting for a number, they're really shooting for look - like a six pack.\n\nSo let's stopping mucking around with trivialities and get to the heart of the matter. This thread shall serve two purposes:\n\n1. **Physique critiques.** Post some pics and ask about muscles or body parts you need to work on. Or specifically ask about a lagging body part and what exercises worked for others.\n2. An outlet for people that want to show off their efforts that would otherwise be removed due to [Rule 4](https://old.reddit.com/r/Fitness/wiki/rules#wiki_rule_.234), and\n\nLet's keep things civil, don't be a creep, and adhere to [\n\n            TOP COMMENTS:\n        1. Score: 10 | Comment: M38 5'10\" 190 lbs\n\nRecently worked my weighted pullups up to +100 lbs x 5, so I wanted to show off my back: https://imgur.com/a/986DkhQ\n2. Score: 8 | Comment: Super excited about my upper body progress!\n\n35F, 5’3, 140lbs\n\nhttps://imgur.com/a/Omabfck\n3. Score: 7 | Comment: M45 / 184cm / 97kg / 4 years training (lifelong sedentary before)\n\nClamping down on diet and cardio for the last 3 months — was at 22% bf before. Training better after a few injuries. I really think my pecs and shoulders are okay and my back is good (though I’d still like to develop them further) but I’m not crazy about my arms and legs and wish they were bigger.\n\n[Photos here.](https://imgur.com/a/iYwQnzv)\n==============================", "\n            === POST 12 ===\n            Title: Daily Simple Questions Thread - August 07, 2025\n            Score: 24 upvotes\n            Total Comments: 95\n            URL: https://www.reddit.com/r/Fitness/comments/1mjv1fr/\n            Content: Welcome to the [/r/Fitness](https://old.reddit.com/r/Fitness) Daily Simple Questions Thread - Our daily thread to ask about all things fitness. Post your questions here related to your diet and nutrition or your training routine and exercises. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer.\n\n# As always, be sure to [read the wiki](https://thefitness.wiki/) first. Like, all of it. Rule #0 still applies in this thread.\n\nAlso, there's a [handy search function](https://www.reddit.com/r/Fitness/search?&restrict_sr=on) to your right, and if you didn't know, you can also use Google to search [r/Fitness](https://old.reddit.com/r/Fitness) by using the limiter \"site:reddit.com[/r/fitness](https://old.reddit.com/r/fitness)\" after your search topic.\n\nAlso make sure to check out [Examine.com](https://examine.com/) for evidence based answers to nutrition and supplement questions.\n\nIf you are posting a routine critique request, make sure you fol\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # Post Form Checks as replies to this comment\n\n### For best results, please follow the **[Form Check Guidelines](https://www.reddit.com/r/Fitness/wiki/posting_guidelines#wiki_how_to_post_a_form_check)**.  *Help us help you.*\n\n----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*\n2. Score: 1 | Comment: So I have a kid now, and I'm carrying it a lot (with my arm and love).     \nWhen rocking him though, I think I strain my back a bit as he like front to back movement so I do a lot of 'hinge'( idk if there's a solution to that, it's what help him sleep).  \n\nNow when I go to the gym, I squat very alright but my lower back **cannot** hold when deadlifting anymore.  \n\nAny advice for that or good home exercise/strecthing I could do ? When picking him up, I squat more instead of bending and it's a bit better but still.  \nHe's 2 month old, and it's been intense so there's some fatigue in there too, but my lowerback isn't really top-notch right now.\n3. Score: 1 | Comment: thoughts on this program? buddy of mine made it for me. been training two years, 16 years old 135lb bodyweight at 5’3. just trying to get bigger and increase my sbd. squat is 300, bench 205, and dead 355. not sure if im in the beginner or intermediate zone\n\nhttps://docs.google.com/spreadsheets/d/1pRaUfO5RaQX9u5D7hGBCf6_luiigM_M0i7BUzfSQZ48/edit?usp=sharing\n==============================", "\n            === POST 13 ===\n            Title: Rant Wednesday - August 06, 2025\n            Score: 46 upvotes\n            Total Comments: 192\n            URL: https://www.reddit.com/r/Fitness/comments/1mizl29/\n            Content: Welcome to Rant Wednesday: It’s your time to let your gym/fitness/nutrition related frustrations out!\n\nThere is no guiding question to help stir up some rage-feels, feel free to fire at will, ranting about anything and everything that’s been pissing you off or getting on your nerves. Just don't forget that other people are allowed to tell you that your rant is stupid.\n\n            TOP COMMENTS:\n        1. Score: 40 | Comment: This is a small rant, but so annoying. I recently replaced my Apple Airpods with JBL Vibe Beams. It had become second nature to pull the Airpods out of the case and put them in my ears. Well, the JBLs are stored in the case facing the opposite direction than the Airpods, which means the motion that had been using for years to put the Airpods in my ears doesn't work. From an ergonomics standpoint, the Airpods are designed correctly. The lid of the case opens away from me and the Airpods are oriented pointed inwards, as they would go into my ears. The JBLs are point out, which means I have to flip them around.\n2. Score: 35 | Comment: What is it about plate loaded machines that inspires almost everyone to just leave their weights on there. Its fucking ridiculous. Or are we Dutch people just that egocentric. Literally 85 percent of machines still have tons of plates on it in Basic Fit.\n3. Score: 30 | Comment: I HATE when people don't let me work in on a machine. Like, bro, there's room for both of us on that treadmill!\n==============================", "\n            === POST 14 ===\n            Title: Daily Simple Questions Thread - August 06, 2025\n            Score: 9 upvotes\n            Total Comments: 101\n            URL: https://www.reddit.com/r/Fitness/comments/1mizl20/\n            Content: Welcome to the [/r/Fitness](https://old.reddit.com/r/Fitness) Daily Simple Questions Thread - Our daily thread to ask about all things fitness. Post your questions here related to your diet and nutrition or your training routine and exercises. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer.\n\n# As always, be sure to [read the wiki](https://thefitness.wiki/) first. Like, all of it. Rule #0 still applies in this thread.\n\nAlso, there's a [handy search function](https://www.reddit.com/r/Fitness/search?&restrict_sr=on) to your right, and if you didn't know, you can also use Google to search [r/Fitness](https://old.reddit.com/r/Fitness) by using the limiter \"site:reddit.com[/r/fitness](https://old.reddit.com/r/fitness)\" after your search topic.\n\nAlso make sure to check out [Examine.com](https://examine.com/) for evidence based answers to nutrition and supplement questions.\n\nIf you are posting a routine critique request, make sure you fol\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # Post Form Checks as replies to this comment\n\n### For best results, please follow the **[Form Check Guidelines](https://www.reddit.com/r/Fitness/wiki/posting_guidelines#wiki_how_to_post_a_form_check)**.  *Help us help you.*\n\n----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*\n2. Score: 2 | Comment: [removed]\n3. Score: 2 | Comment: Dumb question probably belongs on Moronic Monday but anything wrong with making a protein shake about 3 hour before drinking?\n==============================", "\n            === POST 15 ===\n            Title: Daily Simple Questions Thread - August 05, 2025\n            Score: 28 upvotes\n            Total Comments: 154\n            URL: https://www.reddit.com/r/Fitness/comments/1mi43nf/\n            Content: Welcome to the [/r/Fitness](https://old.reddit.com/r/Fitness) Daily Simple Questions Thread - Our daily thread to ask about all things fitness. Post your questions here related to your diet and nutrition or your training routine and exercises. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer.\n\n# As always, be sure to [read the wiki](https://thefitness.wiki/) first. Like, all of it. Rule #0 still applies in this thread.\n\nAlso, there's a [handy search function](https://www.reddit.com/r/Fitness/search?&restrict_sr=on) to your right, and if you didn't know, you can also use Google to search [r/Fitness](https://old.reddit.com/r/Fitness) by using the limiter \"site:reddit.com[/r/fitness](https://old.reddit.com/r/fitness)\" after your search topic.\n\nAlso make sure to check out [Examine.com](https://examine.com/) for evidence based answers to nutrition and supplement questions.\n\nIf you are posting a routine critique request, make sure you fol\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # Post Form Checks as replies to this comment\n\n### For best results, please follow the **[Form Check Guidelines](https://www.reddit.com/r/Fitness/wiki/posting_guidelines#wiki_how_to_post_a_form_check)**.  *Help us help you.*\n\n----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*\n2. Score: 2 | Comment: [removed]\n3. Score: 2 | Comment: I found an interesting [comment](https://www.reddit.com/r/bodyweightfitness/comments/9rtez1/comment/e8jk6ta/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) from 7 years ago:\n\n>**What’s more important for hypertrophy: total volume or going to failure?**\n\n>Volume is more important.\n\n>Let us say your max on pullups is 10 reps. If you do 3 sets to failure, your sets would probably look like 10, 7, 5. This means you did 22 pullups. However if you leave a rep or 2 in the tank in each set, you can do 8, 8, 8 which means you did 24 pullups. Many studies have shown that total volume is the main driver fr hypertrophy.\n\n>You can go to failure on your last set if you want.\n\nSince 7 years have passed and we are so much wiser now, would you agree or disagree?\n==============================", "\n            === POST 16 ===\n            Title: Moronic Monday - Your weekly stupid questions thread\n            Score: 25 upvotes\n            Total Comments: 254\n            URL: https://www.reddit.com/r/Fitness/comments/1mh6p2m/\n            Content: Get your dunce hats out, Fittit, it's time for your weekly Stupid Questions Thread.\n\nPost your question - stupid or otherwise - here to get an answer. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer. Many questions get submitted late each week that don't get a lot of action, so if your question didn't get answered before, feel free to post it again.\n\n###**As always, be sure to read the [FAQ](https://thefitness.wiki/faq/) first**.\n\nAlso, there's a handy-dandy **search bar to your right**, and if you didn't know, you can also use [Google](https://www.google.com/) to search fittit by using the limiter \"site:reddit.com\\/r/fitness\".\n\nBe sure to check back often as questions get posted throughout the day.  Lastly, it may be a good idea to sort comments by \"new\" to be sure the newer questions get some love as well. [Click here to sort by new in this thread only.](https://old.reddit.com/r/Fitness/comments/1mh6p2m/moronic_monday_your_weekly\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # Post Form Checks as replies to this comment\n\n### For best results, please follow the **[Form Check Guidelines](https://www.reddit.com/r/Fitness/wiki/posting_guidelines#wiki_how_to_post_a_form_check)**.  *Help us help you.*\n\n----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*\n2. Score: 5 | Comment: Does anyone else do dumbbell Romanian deadlifts in a gym mirror with sideview to watch their hips go out as a form check? I (F43) feel a bit self conscious sticking my butt out in front of a sea of dudes trying to look at their own reflections.\n3. Score: 4 | Comment: [removed]\n==============================", "\n            === POST 17 ===\n            Title: Daily Simple Questions Thread - August 03, 2025\n            Score: 18 upvotes\n            Total Comments: 176\n            URL: https://www.reddit.com/r/Fitness/comments/1mgem1z/\n            Content: Welcome to the [/r/Fitness](https://old.reddit.com/r/Fitness) Daily Simple Questions Thread - Our daily thread to ask about all things fitness. Post your questions here related to your diet and nutrition or your training routine and exercises. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer.\n\n# As always, be sure to [read the wiki](https://thefitness.wiki/) first. Like, all of it. Rule #0 still applies in this thread.\n\nAlso, there's a [handy search function](https://www.reddit.com/r/Fitness/search?&restrict_sr=on) to your right, and if you didn't know, you can also use Google to search [r/Fitness](https://old.reddit.com/r/Fitness) by using the limiter \"site:reddit.com[/r/fitness](https://old.reddit.com/r/fitness)\" after your search topic.\n\nAlso make sure to check out [Examine.com](https://examine.com/) for evidence based answers to nutrition and supplement questions.\n\nIf you are posting a routine critique request, make sure you fol\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # Post Form Checks as replies to this comment\n\n### For best results, please follow the **[Form Check Guidelines](https://www.reddit.com/r/Fitness/wiki/posting_guidelines#wiki_how_to_post_a_form_check)**.  *Help us help you.*\n\n----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*\n2. Score: 2 | Comment: I was doing sets of 12 reps. I was recommended to alternate with heavier sets of 6. So that's what I did. After 6 months, I went back to sets of 12. And strangely, I'm lifting the same weight as before, even though I made good progress during my sets of 6 (except for squat, but i tried to go way deeper) . Is this normal?\n3. Score: 2 | Comment: How do you deal with your mental?\n\nWhenever I have a cheat day (cause I can't keep saying no to my friends and family every single time, so I end up with one big cheat day per week) I feel like total shit and guilty af.\n\nI just ate something like 3000 kcal only in the first half of the day, and I usually eat 1500 kcal per day.. feeling bad and like I just wasted lots of efforts, I was finally able to break the 60kg barrier (I'm a 1,65cm gnome, I'm around 10% bf) reaching 59.8kg and I already know in the next few days I'll be back to 61kg and will probably settle around 60.5kg (as I usually gain back around half a kg or so in these occasions).\n\nSo yeah.. how do y'all deal with things like this?\nFeeling like total shit right now.\n==============================", "\n            === POST 18 ===\n            Title: Victory Sunday\n            Score: 47 upvotes\n            Total Comments: 55\n            URL: https://www.reddit.com/r/Fitness/comments/1mgelkq/\n            Content: **Welcome to the Victory Sunday Thread**\n\nIt is Sunday, 6:00 am here in the eastern half of Hyder, Alaska. It's time to ask yourself: What was the one, best thing you did on behalf of your fitness this week? What was your Fitness Victory?\n\n**We want to hear about it!**\n\n**So let's hear your fitness Victory this week! Don't forget to upvote your favorite Victories!**\n\n            TOP COMMENTS:\n        1. Score: 26 | Comment: Went to the gym for the first time in many, many years today. :)\n2. Score: 22 | Comment: Hi, I'm new here. I (f, 47) started going to the gym in September. Well I did go in earlier times but gym and I had been an in off relationship. \n\nSeeing my mom get old and weak makes me want to be consistent from now on forever as I want to age being active and with quality of life if possible. \n\nMy personal victory is that I have to up the weight of the leg extension machine whenever I use it. Currently I do 4 sets of 12 at 82 kg which I think is not bad for a female. It makes me proud and I plan to max out the machine some time soon.\n3. Score: 18 | Comment: Came to the gym, walked on the treadmill for 10 minutes and felt a massive shit coming and left\n==============================", "\n            === POST 19 ===\n            Title: Daily Simple Questions Thread - August 02, 2025\n            Score: 11 upvotes\n            Total Comments: 94\n            URL: https://www.reddit.com/r/Fitness/comments/1mflygn/\n            Content: Welcome to the [/r/Fitness](https://old.reddit.com/r/Fitness) Daily Simple Questions Thread - Our daily thread to ask about all things fitness. Post your questions here related to your diet and nutrition or your training routine and exercises. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer.\n\n# As always, be sure to [read the wiki](https://thefitness.wiki/) first. Like, all of it. Rule #0 still applies in this thread.\n\nAlso, there's a [handy search function](https://www.reddit.com/r/Fitness/search?&restrict_sr=on) to your right, and if you didn't know, you can also use Google to search [r/Fitness](https://old.reddit.com/r/Fitness) by using the limiter \"site:reddit.com[/r/fitness](https://old.reddit.com/r/fitness)\" after your search topic.\n\nAlso make sure to check out [Examine.com](https://examine.com/) for evidence based answers to nutrition and supplement questions.\n\nIf you are posting a routine critique request, make sure you fol\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # Post Form Checks as replies to this comment\n\n### For best results, please follow the **[Form Check Guidelines](https://www.reddit.com/r/Fitness/wiki/posting_guidelines#wiki_how_to_post_a_form_check)**.  *Help us help you.*\n\n----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*\n2. Score: 2 | Comment: Is cutting while unable to get enough protein per day a bad idea?\n\nI (M 173cm) live in Syria so I don't think I need to explain myself lol. I have been training for like 4 years now, I developed some muscle mass, but progress have always been dreadfully slow, and I can't seem to lose the soft look even when I try to cut, epically in chest and belly/love handles.\n\nI have been cutting recently because I wanted to see myself shredded for once, and I am already down from 71kg to 67kg, but I really don't see much visual change. Add to that my sub bar diet and I really have no idea if I should cut or maintain, or if the effort is even worth it tbh\n\nAny tip would be deeply appreciated.\n3. Score: 2 | Comment: If you can only go to the gym 2 or 3 days a week and your ambition is hypertrophy, am I right that 3 x full body workouts are superior to attempting a split (such as push pull legs)?\n==============================", "\n            === POST 20 ===\n            Title: Is this too much?\n            Score: 0 upvotes\n            Total Comments: 7\n            URL: https://www.reddit.com/r/nutrition/comments/1mkxjly/\n            Content: Hi. Currently I am in a bulk and trying to put on  muscle mass by increasing my caloric and protien intake. Today as part of my meals I was planning on having 100g mixed nuts and then 2-3 hours later a bean chilli with rice. My concern is that some of the 'nuts' in the mixture are really legumes. Would there be any risk at all of having these a few hours before my bean chilli, or am I just being overly paranoid?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: #### About participation in the comments of /r/nutrition  \n\nDiscussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people.\n\n**Good** - it is grounded in science and includes citation of peer reviewed sources.  Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others  \n\n**Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion  \n\n**Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy\n\n*Please vote accordingly and report any uglies*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*\n2. Score: 5 | Comment: Are you under the impression that nuts are a good protein source?\n3. Score: 1 | Comment: The only risk is spending 30 mins on a toilet\n==============================", "\n            === POST 21 ===\n            Title: 🔥 Entrenamiento + Nutrición Personalizada 🔥\n            Score: 0 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/nutrition/comments/1mkiufi/\n            Content: 🔥 **Entrenamiento + Nutrición Personalizada** 🔥  \n📍 Modalidad **presencial** y **a distancia**  \n✔ Plan hecho a tu medida  \n✔ Entrenamiento + nutrición ajustados a tus objetivos  \n✔ Seguimiento constante y real\n\n💬 No se trata solo de entrenar fuerte o comer sano...  \n💥 ¡Se trata de un proceso estratégico, acompañado y 100% para vos!\n\n📲 Consultas por\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: #### About participation in the comments of /r/nutrition  \n\nDiscussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people.\n\n**Good** - it is grounded in science and includes citation of peer reviewed sources.  Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others  \n\n**Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion  \n\n**Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy\n\n*Please vote accordingly and report any uglies*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*\n==============================", "\n            === POST 22 ===\n            Title: How bad is it to not fully strain 80/20 beef?\n            Score: 0 upvotes\n            Total Comments: 50\n            URL: https://www.reddit.com/r/nutrition/comments/1mkf88e/\n            Content: Basically, the title says it I do put the beef in a strainer and press down, but sometimes it doesn’t seem like I get it all. It still remains kinda greasy. Is that ok? \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: #### About participation in the comments of /r/nutrition  \n\nDiscussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people.\n\n**Good** - it is grounded in science and includes citation of peer reviewed sources.  Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others  \n\n**Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion  \n\n**Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy\n\n*Please vote accordingly and report any uglies*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*\n2. Score: 63 | Comment: There is no requirement to strain beef.\n3. Score: 25 | Comment: I’ve never stained it.\n==============================", "\n            === POST 23 ===\n            Title: Is it okay to eat the same veggies several times a week?\n            Score: 22 upvotes\n            Total Comments: 36\n            URL: https://www.reddit.com/r/nutrition/comments/1mkexvl/\n            Content: I love veggies and typically like making a different one everyday. \nBut lately I have been trying to make some more food from my culture for my kids.  But  given the intensity of prep and the time I have - what the veggie part of the meals realistically looks like is that 4-5 days out of 7 its a “salad” that is  made by chopping up cucumbers, tomatoes, carrots and sometimes a bell pepper or radishes if I have them on hand. The remaining days I usually will make a cooked vegetable dish . \nThe situation is not helped by the fact that my kids love the “salad” but it’s hit or miss with other dishes. \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: #### About participation in the comments of /r/nutrition  \n\nDiscussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people.\n\n**Good** - it is grounded in science and includes citation of peer reviewed sources.  Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others  \n\n**Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion  \n\n**Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy\n\n*Please vote accordingly and report any uglies*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*\n2. Score: 129 | Comment: Your kids are enthusiastically eating veggies, I’d call that a win. I know it’s trendy to try and eat 30+ plants per week, but don’t let perfect be the enemy of good.\n3. Score: 42 | Comment: Why would it not be ok\n\nThe fact is- your kids are eating veggies. Most children in the West these days are not doing that. Hell, look at food subs around reddit. Adults seem to hate veggies too. Its just sad all around. Be happy and grateful your kids are eating the veggies happily\n==============================", "\n            === POST 24 ===\n            Title: What are some of the most effective legume preparation techniques to render them more agreeable?\n            Score: 11 upvotes\n            Total Comments: 8\n            URL: https://www.reddit.com/r/nutrition/comments/1mk93ig/\n            Content: Apart from taking enzymes, or in addition to taking them, what other ways actually help? \n\nLegumes seem almost universally ranked very high among all the possible healthy foods you can have in your diet. Nobody seems to object to them. But  they can be problematic.  \n\nDr Greger and others have recommended starting out with a small amount and slowly ramping up to give your intestinal microbiota a chance to adapt. The idea is that over the course of a few weeks, you'll be able to digest beans even though you were not able to initially. This, however, doesn't work for everyone. I'm not even sure it works for anyone.\n\nBut there are various other things that people do. There are certain added ingredients that people claim are helpful, like epazote. Ginger is another.\n\nSprouting the legumes before cooking them is another approach. \n\nYet another approach is finding which legumes are the most problematic and the least problematic in your own individual experience.\n\nWhat experiences have you ha\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: #### About participation in the comments of /r/nutrition  \n\nDiscussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people.\n\n**Good** - it is grounded in science and includes citation of peer reviewed sources.  Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others  \n\n**Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion  \n\n**Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy\n\n*Please vote accordingly and report any uglies*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*\n2. Score: 6 | Comment: Soaking your beans before cooking them is the main effective tool. Beans contain sugars that some people can't break down effectively. By soaking the beans, you dissolve those sugars out of the beans into the water and then dump the water. It doesn't get all of it, but it gets a lot of it.\n\nThere are two primary methods for doing this. I researched it a while back and the \"fast\" method is supposedly the most effective.\n\nThe slow method is simply put the beans in water for 24 hours. And that's good. But if you boil the beans for about 2 minutes and leave them covered to sit for an hour, that will extract more of the sugars than just soaking for 24 hours. You can, of course, combine the two.   \n  \nYou could do the fast method, dispose of the water after the hour, then add fresh water and soak for 24 hours. Or multiple fast soaks, using fresh water each time.\n\nBut beyond that, nothing else that I know of is going to reduce those sugars.\n\nTaking beano provides you with more of the enzyme for people who don't produce enough.\n3. Score: 3 | Comment: Working my way up in terms of frequency and volume seemed to help quite a lot.\n\nThe first time I had a red lentil and sweet potato currency was agony, because I hadn't eaten them much before then suddenly had an entire fibre-heavy meal. Now my gut biome is used to it I can eat the same thing and not have much bloating or cramps or anything like that.\n\nWeirdly certain legumes are easier for me than others. Fava beans, black eye beans etc. have never caused me issues at all, most lentils I'm ok with now, chickpeas can still be problematic unless I make a concerted effort to limit the quantity.\n==============================", "\n            === POST 25 ===\n            Title: Most effective bean-digestion enzyme products and supplements?\n            Score: 2 upvotes\n            Total Comments: 3\n            URL: https://www.reddit.com/r/nutrition/comments/1mk8poi/\n            Content: I've tried Beano in the past and it seemed to work pretty well, but I'm sure some people here have tried other things, and might have something more to say; so if you have anything to add or any experiences to share along these lines, please do.\n\n\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: #### About participation in the comments of /r/nutrition  \n\nDiscussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people.\n\n**Good** - it is grounded in science and includes citation of peer reviewed sources.  Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others  \n\n**Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion  \n\n**Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy\n\n*Please vote accordingly and report any uglies*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*\n2. Score: 2 | Comment: I really like Enzymedicas Bean assist, Enzymedica is probably my favorite brand of digestive aid supplements on the market. I've been using their digest gold for almost a year now and it is amazing!\n3. Score: 1 | Comment: Do you still use Beano, or did you give your Beano the flick?\n==============================", "\n            === POST 26 ===\n            Title: Is beta carotene supplementation safe?\n            Score: 8 upvotes\n            Total Comments: 25\n            URL: https://www.reddit.com/r/nutrition/comments/1mjtrpe/\n            Content: I truly am confused reading the subreddit rules if this kind of post is allowed, so if it is not, please let me know and I will delete. I was reading on some looksmaxxing websites about beta carotene supplementation to change skin color and get more glow and someone mentioned having success with 100,000 ius daily. Is this safe for the average human?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: #### About participation in the comments of /r/nutrition  \n\nDiscussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people.\n\n**Good** - it is grounded in science and includes citation of peer reviewed sources.  Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others  \n\n**Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion  \n\n**Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy\n\n*Please vote accordingly and report any uglies*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*\n2. Score: 7 | Comment: Some trials of beta carotene supplementation were actually stopped early due to harm\n3. Score: 6 | Comment: You wanna be orange? Go for it\n==============================", "\n            === POST 27 ===\n            Title: Dad Preps my Meals?\n            Score: 12 upvotes\n            Total Comments: 11\n            URL: https://www.reddit.com/r/nutrition/comments/1mjnj3o/\n            Content: My dad is really into cooking, and I floated the idea of me paying him to prep meals for me. Kind of like those meal prep companies except it’s my dad (higher quality, more personalized). He loves cooking and finding new ingredients. I think it could be a cool way to stay on top of macros and calories, and I’m sure he can help expand my palate. Any recommendations or ideas for logistics on this?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: #### About participation in the comments of /r/nutrition  \n\nDiscussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people.\n\n**Good** - it is grounded in science and includes citation of peer reviewed sources.  Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others  \n\n**Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion  \n\n**Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy\n\n*Please vote accordingly and report any uglies*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*\n2. Score: 16 | Comment: I would also like to hire your dad……sounds like a fantastic plan!\n3. Score: 4 | Comment: I'd say don't reduce his excellence to a dollar value. It makes his contribution seem small. Try doing things for him that he won't do for himself. None of us like our obligations. Lighten his load. Tell him how much his cooking means to you.\n==============================", "\n            === POST 28 ===\n            Title: Does spinach lose any nutritional benefits if I blend it with water in a nutribullet and just drink that?\n            Score: 32 upvotes\n            Total Comments: 71\n            URL: https://www.reddit.com/r/nutrition/comments/1mjjqob/\n            Content: Serious question,  I hate eating a ton of spinach but I have no problem drinking blended watery spinach. I just have no idea if it loses anything in the process. Sorry if this question doesn't belong, wasn't sure where to post. \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: #### About participation in the comments of /r/nutrition  \n\nDiscussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people.\n\n**Good** - it is grounded in science and includes citation of peer reviewed sources.  Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others  \n\n**Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion  \n\n**Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy\n\n*Please vote accordingly and report any uglies*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*\n2. Score: 168 | Comment: Nope, but nothing wrong with maybe adding a banana or something to make it taste better 🤣\n3. Score: 117 | Comment: A squeeze of citrus in there would make the iron more absorbable too\n==============================", "\n            === POST 29 ===\n            Title: Frozen pizza Recs\n            Score: 1 upvotes\n            Total Comments: 18\n            URL: https://www.reddit.com/r/nutrition/comments/1mjishx/\n            Content: So, I realize frozen pizza is like the antithesis of healthy eating. But my daughter is taking *baby steps* towards healthier eating and is trying to find substitutes for some of her favorite items so she doesn’t feel deprived but is reducing her caloric intake.\n\nPortion control historically is tough for her but is something she’s working on. \n\nHer favorite brand is Freschetta.\n\nShe’s tried non-diet but smaller portion ones like Celeste brand, and also tried Quest brand which is a flourless crust option. She didn’t like either one. \n\nTaking recommendations for your favorite “diet” or small portion pizzas for her to try. She’s aiming for approx 350 cals per serving and wants to still feel like she’s got a decent portion size (like, two slices of a standard frozen pizza doesn’t *feel* like enough).  \n\nThank you in advance!\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: #### About participation in the comments of /r/nutrition  \n\nDiscussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people.\n\n**Good** - it is grounded in science and includes citation of peer reviewed sources.  Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others  \n\n**Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion  \n\n**Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy\n\n*Please vote accordingly and report any uglies*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*\n2. Score: 5 | Comment: Ellio’s. It’s not diet but one slab (considered “3 pieces” by their nutritional panel) is 390 calories.\n3. Score: 2 | Comment: There is a line of personal pizzas by Vital Pursuit that are decent. You can get them at Walmart. They are high protein within her calorie range and they even have a cauliflower crust one.\n==============================", "\n            === POST 30 ===\n            Title: Daily Discussion Thread - August 08, 2025 (up for two days)\n            Score: 4 upvotes\n            Total Comments: 3\n            URL: https://www.reddit.com/r/bodybuilding/comments/1mkodey/\n            Content: Feel free to post things in the Daily Discussion Thread that don't warrant a subreddit-level discussion. Although most of our posting rules will be relaxed here, you should still consider your audience when posting. Most importantly, show respect to your fellow Redditors. General Reddiquette always applies. \n\n The Daily Discussion Thread resets every other day at 12:00 a.m. PST.\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: https://preview.redd.it/mga28jgk9thf1.jpeg?width=2048&format=pjpg&auto=webp&s=19df8adc3de8b2c9d5ee5ff28a899fe5efaab58b\n\nStarted tren yesterday. Time to start to look a little nutty\n2. Score: 1 | Comment: **Will I gain muscle?**  \nSo I must confess, I started working out back in 2017. But through my own doing, I was wildly inconsistent. I've decided to take it seriously now (started about 2 months ago), and I noticed my progress is much slower than when I started working out. It doesn't help that I'm in my 30s now.\n\nWill I ever get to the level of rapid progression, or have I wasted that \"ability\" in the past?\n==============================", "\n            === POST 31 ===\n            Title: FREAKOUT FRIDAY (Weekly Rant Thread) - August 08, 2025\n            Score: 2 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/bodybuilding/comments/1mkoddt/\n            Content: What makes you want to flip? Tell us today in our weekly Freakout Friday thread!\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: When I had JUST joined the gym (I'm talking literally *one month* into working out), people would laugh at me and say that it wasn't doing me any good. As though I was supposed to look like Arnold overnight! \n\nPeople don't realize that it takes YEARS of hard work (not to mention, uh, 'supplements') to attain a professional bodybuilder's physique. That kind of response has caused a lot of people to give up early, because they take it to heart and feel like a failure.\n\nIt's like taking two guitar lessons and being expected to play like Eric Clapton! I'm just glad that I didn't listen to those people back in 1995.\n==============================", "\n            === POST 32 ===\n            Title: Overall Bikini Champ, 2025 Patriot Cup!\n            Score: 91 upvotes\n            Total Comments: 6\n            URL: https://www.reddit.com/r/bodybuilding/comments/1mkezky/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 2 | Comment: So happy for you.\n2. Score: 1 | Comment: Client/friend @livli.fts in her first ever show.\n3. Score: 1 | Comment: Congrats \n==============================", "\n            === POST 33 ===\n            Title: (F21) Update from show. I won overall!!\n            Score: 661 upvotes\n            Total Comments: 32\n            URL: https://www.reddit.com/r/bodybuilding/comments/1mkcgwx/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 31 | Comment: What a UNIT. Dang good job!\n2. Score: 21 | Comment: Girl, I cannot believe you are bringing this package AT ONLY 21 YEARS OLD! You are absolutely smashing it. Keep it up! 🙌\n3. Score: 15 | Comment: This is a late post I'm sorry but I am still just as proud to win an overall at a really good competition back in June. Musclecontest Taubaté. It mean everything to me. I have been just short before against very tough competition and it is usually my dominant upper body. It grows too much. We take step back and took away upper session to find the right wellness symmetry and it worked.\n\nI compete again on Saturday. Musclecontest Paulista. Very good regional competition, but I have already added 2kg more of muscle in 6 weeks, mostly in lower body, especially glutes. Best physique I bring to a competition. Wish me luck!\n==============================", "\n            === POST 34 ===\n            Title: Stepped on stage for the first time last weekend!!!\n            Score: 157 upvotes\n            Total Comments: 8\n            URL: https://www.reddit.com/r/bodybuilding/comments/1mkaldl/\n            Content: I was already deeply obsessed with bodybuilding, but my first show day was one of the best days of my entire life and now a whole new fire is lit!! I won my true novice class, won novice because I was the only competitor, and placed second in open, but the girl who beat me was the 2x overall winner so I feel great about coming in right behind her! Judges’ feedback was to come in a little bit more conditioned + tighter in the back so I’m grinding these next couple weeks to get on stage one more time before taking time off to grow my glutes + bank account with the hopes of getting on a national stage next year! \n\n            TOP COMMENTS:\n        1. Score: 7 | Comment: Awesome look! Congratulations on your placings and more importantly - congratulations on believing in yourself and finding joy in the process. 💪💪💪\n2. Score: 4 | Comment: That's a great look for your first time on stage, you nailed it! Bikini is always so difficult to get the conditioning just right for the judges and you presented a great overall balance!\n3. Score: 2 | Comment: Amazing work, you look fantastic!\n==============================", "\n            === POST 35 ===\n            Title: 15 weeks out OCB, looking for critiques\n            Score: 32 upvotes\n            Total Comments: 11\n            URL: https://www.reddit.com/r/bodybuilding/comments/1mk46gw/\n            Content: Sup yall, 27 y/o 5’4 currently at 151 pounds. 15 weeks out from OCB Midwest States in Classic Physique. I probably have another 6/7 pounds to drop before it’s time to get on stage. Also, I ordered some new trunks incase these are not to code. Self coached and first time competing. Looking for honest criticism on posing and my current program. \n\nI am cutting at 2000 cals (maintenance was about 2560) aiming for roughly 170 grams of protein, 200 grabs of carbs and 68 grams of fat per day. I plan on cutting down further at weeks 12, 8, and 4. I’ll cut calories by 200 each time and bring carbs down by 20 grams each cut. Let me know if that makes sense. \n\nThanks for the feedback! \n\n            TOP COMMENTS:\n        1. Score: 13 | Comment: I think you've got more than 6-7 lbs for stage lean. Are you working with a coach?\n\nPosing could use some tweaks. You've got plenty of time to dial that in but would be good to start developing good habits sooner rather than later\n2. Score: 5 | Comment: In pics 2 and 3, if you lower your shoulders a tad, you’ll gain more width.\n\nIn pic 6 are you pushing against your other leg? It will help bring your hamstring out more for increased width\n3. Score: 3 | Comment: You have closer to 15lbs to lose to be stage condition imo. Get those knees more locked out and feet together on the side relaxeds. Front double you're bending at the hips and distributing weight the wrong way. You want 70-80% of your weight on the back leg and then the front to be on the toes and not the other way around. Side chest get your feet together and get some thoracic extension (thing proud/tall chest). Rear double get your arms higher. Ab n thigh put the backs of your hands together behind your head with the bottom/hammer part of your fist touching your occipitals. Then, squeeze your temple area with your forearms.\n==============================", "\n            === POST 36 ===\n            Title: Client 2 weeks out from Pro debut\n            Score: 206 upvotes\n            Total Comments: 15\n            URL: https://www.reddit.com/r/bodybuilding/comments/1mk0iq2/\n            Content: Last slides are comparisons of 7.27.25 vs 8.7.25 check in photos. More glute lines, more quad fullness and detail, and a lot more detail in back. Camera angles aren't 100% ideal, but definitely close enough to make a proper comparison and conclusion. \n\nJust started adding a tiny bit of food and backing off output. Wouldn't be surprised to see a harder look here in 7-10 days.\n\n43 y/o. \n\n            TOP COMMENTS:\n        1. Score: 23 | Comment: Much more definition in the glute striations and hamstrings. Impeccable work. Would be honored to work with a coach that gets these results.\n2. Score: 16 | Comment: 1. That's insane. \n2. That's insane progress for the timeframe.\n3. Score: 6 | Comment: She looks incredible. Lovely work both of you! You should invite her over here lol.\n==============================", "\n            === POST 37 ===\n            Title: Training Thursday - August 07, 2025\n            Score: 3 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/bodybuilding/comments/1mjt5ry/\n            Content: Submit form checks, programs, questions about programs and program success stories (especially if you saw growth from it).\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 38 ===\n            Title: 178.2 lbs,  18 years old, 13 weeks out (division unclear), prep has kicked off. goal weight is 166 (being optimistic)\n            Score: 114 upvotes\n            Total Comments: 16\n            URL: https://www.reddit.com/r/bodybuilding/comments/1mjn5w5/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 11 | Comment: My current thoughts are that 1. I’m a touch behind where I should be, and that 2. My posing needs to be 10 times better than it was last time\n2. Score: 8 | Comment: You look great man. So young still. you have a lot of potential 🙌🏼\n3. Score: 4 | Comment: Time travel is real. It’s actor Joel Kinnaman at 18! Dude, you look sick though. Great work!\n==============================", "\n            === POST 39 ===\n            Title: 10 weeks out\n            Score: 496 upvotes\n            Total Comments: 36\n            URL: https://www.reddit.com/r/bodybuilding/comments/1mjk1as/\n            Content: Dropped to a new low of 164lbs. 10 weeks out from classic and bodybuilding \n\n            TOP COMMENTS:\n        1. Score: 62 | Comment: What is your height dude? You look absolutely massive for 164.\n2. Score: 38 | Comment: Man. Those legs got horsepower. \n3. Score: 29 | Comment: Looking nasty. That lighting isn’t doing you any favors though.\n==============================", "\n            === POST 40 ===\n            Title: Winter meals\n            Score: 2 upvotes\n            Total Comments: 6\n            URL: https://www.reddit.com/r/EatCheapAndHealthy/comments/1ml0c7l/\n            Content: \nWhat are some meals and some of your favorite dishes to make in winter that you can freeze down and then heat up over winter time? like warm hearty recipes? \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Chili! Beans, tomatoes, onions, usually a mix of ground beef and TVP.\n2. Score: 1 | Comment: Pot roast with potatoes and carrots in the crockpot is a quintessential winter meal.\n3. Score: 1 | Comment: Chicken gravy, chicken and dumplings, chicken stew, hamburger soup, lasagna\n==============================", "\n            === POST 41 ===\n            Title: Substitute for ground beef\n            Score: 123 upvotes\n            Total Comments: 100\n            URL: https://www.reddit.com/r/EatCheapAndHealthy/comments/1mkv161/\n            Content: Since meat is becoming so unaffordable and out of my reach financially, I learned a nifty little trick for a substitution.  Or you could add it into your ground beef to stretch a small amount.\n\nGet firm or extra firm tofu, and freeze it right in the container.  Take it out, defrost it, and then squeeze the heck out of it until all the liquid has come out.  What you’re left with has the texture of ground beef and can be used in any recipe calling for it.   Just crumble it and it’s ready to go.  \n\nMy favorite ways to use it are in chili or in spaghetti sauce.   It has no taste of its own, takes on the flavor of whatever you use it in, and once you freeze/defrost it, it develops a texture that is very similar to ground beef.\n\nWhere I live, it costs about 2.99 a pound.  \n\n            TOP COMMENTS:\n        1. Score: 65 | Comment: I find brown lentils also give a ground beef like texture when cooked just right. $1.29 for a pound. I don't eat a lot of meat so I'll combine the lentils with tofu or TVP crumbles (which I can get a pound for like $4 so comparable to actual meat prices. Looking for it cheaper tho)\n2. Score: 62 | Comment: Mushrooms! Specifically the button mushrooms you find in every grocery store. Toss them in a food processor or dice them by hand, then cook dry on the stovetop until the moisture cooks out. Add a little oil and the same spices you would for ground beef.  \n  \nIt's cheaper than animal protein and I can't really tell the difference in texture or flavor.\n3. Score: 35 | Comment: Taco's (soft shell, hard shell, taco salad) are my all time favorite food and something I eat multiple times a week. Ground beef's pricing turned my affordable mealprep into a premium product.\n\nI just swapped out ground beef for ground chicken. It's far cheaper and has less of a fat content. Ground pork is much more fatty, but also much cheaper than even griund chicken/turkey.\n\nI'm going to give the tofu recipe a try. Thanks for the suggestion!\n==============================", "\n            === POST 42 ===\n            Title: Cheapest protein source (chicken)\n            Score: 0 upvotes\n            Total Comments: 22\n            URL: https://www.reddit.com/r/EatCheapAndHealthy/comments/1mkssoe/\n            Content: For some context I live in the UK and are familiar with stores like Sainsbury’s and Tesco. I generally eat to hit my protein goals and really do not care much about taste. My priorities are effortless, high protein meals.\n\nI usually buy a 240g pack of pre cooked, sliced, chicken from Sainsbury’s and mix it it with whatever carbs I have, with a side of frozen vegetables. I would rotate the carbs for a bit of variety. My question is that is it generally worth the effort and money to purchase larger amounts of chicken breast - be it fresh or frozen - and prepare it myself? I hate pan frying and waiting for the oven to pre-heat etc. Just wondering if anyone has been in my situation and made the switch. I’ve prepared oven based chicken myself before and it just seems like so much work compared to just buying pre cooked ones. Is it really worth it in terms of savings? TIA!\n\n            TOP COMMENTS:\n        1. Score: 21 | Comment: If it’s about minimal effort extra firm tofu can go from package to plate and you can just eat it like that \n\nIt’s not as much protein/calorie as chicken breast but you can still easily hit .7g/lb within your calorie limit with it as your primary source (assuming you’re interested in protein cause of lifting or something). A full package is usually about 52-55g of protein for 500-550 calories\n\nIt doesn’t get much cheaper for no effort than tofu. Lentils also work but require cooking and time \n\nIf you’re set on chicken though canned is usually cheaper than pre cooked rotisserie or deli chicken breast so that might be the route if you want pre cooked\n\nI’d say tofu/eggs are probably the lowest effort protein sources. \n\nOr if protein/calorie matter and efficient cost you could just supplement with whey protein 1-2 times a day. That’s about 50g for 300ish calories\n\nOikos triple zero or quark, cottage cheese etc also have pretty solid macros if you’re a protein fiend\n2. Score: 13 | Comment: I hate that chicken that you're describing!!!hate!! I always think it tastes weird compared to chicken you would buy and cook yourself. \n\n\nWhy not buy a rotisserie chicken. You definitely could get four proteins of chicken. Maybe more. \n3. Score: 12 | Comment: Beans!\n==============================", "\n            === POST 43 ===\n            Title: Amuse-bouche Suggestions 💫\n            Score: 30 upvotes\n            Total Comments: 30\n            URL: https://www.reddit.com/r/EatCheapAndHealthy/comments/1mkiyio/\n            Content: \nLooking for ideas for small bites of food. Appetizers, hors d'oeuvres. Anything considered, including other cultures flavor profiles. Appreciate creativity. No olives, anchovies, raw tomato. Ingredients that don't aggravate heartburn & bloating. Easy to make on demand or ahead of time. Things that last or freeze. Have a toaster oven & air fryer also. Love trying new pairings.\n\n            TOP COMMENTS:\n        1. Score: 24 | Comment: I love a cucumber tea-finger sandwich. Cream cheese, dill, cucumber, white bread or rye bread\n2. Score: 15 | Comment: Cantalope with prosciutto on skewers\n\nBrowned butter Roasted butternut squash and shallots with sage on toasts/bread\n\nMini popovers with chives and white cheddar\n\nBaked Brie in puff pastry with jam\n3. Score: 6 | Comment: Buy some frozen puff pastry and make pastry squares. Put ingredients down on a sheet tray, cover with a square of puff pastry, and bake till the pastry is cooked through. The concept went viral maybe a year ago, and you can do any pairings you like: onions, thyme, balsamic; mushroom, goat cheese, thyme, honey; ham, gruyere, and hot honey; etc.\n==============================", "\n            === POST 44 ===\n            Title: FoodAdvice!\n            Score: 0 upvotes\n            Total Comments: 7\n            URL: https://www.reddit.com/r/EatCheapAndHealthy/comments/1mkf8ua/\n            Content: I’ve recently moved into a new home and with that i’d like to start some new habits! any advice is appreciated\n\n            TOP COMMENTS:\n        1. Score: 6 | Comment: Organize your kitchen to make it a pleasure to cook in. The easier it is to cook and the happier you are doing it, the more motivated you will be to spend time in there-- and eating at home is cheapest and healthiest!\n2. Score: 2 | Comment: Get a vacuum sealer, stock up on meat when it goes on sale at your grocery store, and then vacuum seal in individual portions and toss it in the freezer.  I save so much money this way.\n3. Score: 2 | Comment: Take a peeler and shred a carrot into a container. Add cucumbers, tomatoes, onion, and grilled chicken. Then make a dressing from soy sauce, honey, and apple cider vinegar. Easy meal prep!\n==============================", "\n            === POST 45 ===\n            Title: Cheap Veggie Dumpling Fillings?\n            Score: 45 upvotes\n            Total Comments: 44\n            URL: https://www.reddit.com/r/EatCheapAndHealthy/comments/1mjj1w6/\n            Content: Does anyone know what to put in veggie dumplings? I can really only think of cabbage as a cheap filling. Onion and garlic are also obvious necessities, but other than that and a few sauces I'm clueless. Also I unfortunately have to stick to low fat options so please don't argue in the comments. Tysm! \n\n            TOP COMMENTS:\n        1. Score: 46 | Comment: I do tofu, cabbage, carrots and green onion with lots of garlic\n2. Score: 35 | Comment: How about\n\nmushrooms\n\nsweet potato\n\ncarrots\n\ncelery\n\nbokchoy\n\ntofu\n\nsweet peppers\n\nBroccoli and cauliflower (especially the stems. Peel if tough, dice, and blanch in salted boiling water)\n\nWhite potatoes (can be used as a binder for other ingredients too)\n\ngreen soybeans \n\nany sort of leafy greens, such as kale, chard, or spinach.\n\nshredded zucchini or yellow squash.\n\nYou can mix and match  two or three of any of the above along with some kind of onion and usually garlic, ginger, a bit of sesame oil (a very small amount adds a lot of flavor, So even when cooking low-fat I'd recommend a bit) soy sauce and possibly other seasonings.\n3. Score: 22 | Comment: The basic coleslaw bag at the store is a good option. Or, shred some carrots, green onions, etc.\n\nBut...are you steaming them or frying them? What style dumplings? There are SOOOOOO many varieties based upon cultures to choose from.\n==============================", "\n            === POST 46 ===\n            Title: Freezer meals (bonus if it’s good for 9 month old babies!)\n            Score: 10 upvotes\n            Total Comments: 10\n            URL: https://www.reddit.com/r/EatCheapAndHealthy/comments/1mjgqsa/\n            Content: Looking for some freezer meal recipes, could be lunch/ breakfast/dinner/snacks/desserts.\n\nI can’t eat pork or seafood so would substitute for turkey/chicken\n\n            TOP COMMENTS:\n        1. Score: 4 | Comment: Soups (think roasted butternut squash, broccoli, potato-leek) are great frozen, and they would be fine for your little one-- just go easy on the pepper and seasonings until you reheat. Portion out for them first, and you're good to go.\n2. Score: 2 | Comment: Idk about the kid, but I try to make chili, meatloaf, or chicken soup for freezer prep. Homemade burritos are an easy freeze as well and you can put whatever in them. I like the Mission Carb Balance tortillas for this purpose and make homemade refried beans, which I think a kid could eat but idk unfortunately.\n3. Score: 2 | Comment: Any breakfast food!\n==============================", "\n            === POST 47 ===\n            Title: Replacement for granola\n            Score: 70 upvotes\n            Total Comments: 158\n            URL: https://www.reddit.com/r/EatCheapAndHealthy/comments/1mj8ya0/\n            Content: Hello everyone. I thought I should start this out by saying that I despise yogurt. The one that I do eat, has absolutely zero flavor and I eat it solely because of its protein. I mostly hate it because I hate the texture of yogurt, its so slimy and just not good to me. To combat this, ive been putting granola in to give it a crunch. However, its not really the healthiest option. I was wondering what are some good crunchy alternatives to put in my yogurt?\n\n            TOP COMMENTS:\n        1. Score: 210 | Comment: There's so much healthy and delicious food out there, you don't have to force yourself to eat something you don't like just because it's good for you. Food should be your friend.\n\nThat said, if you still want to incorporate yogurt into your diet for whatever reason, I find it makes a great replacement for mayo in things like tuna salad. Smoothies and frozen yogurt are also good options.\n2. Score: 100 | Comment: there's recipes for easy homemade granola that greatly reduces the sugar and oil, and instead uses egg whites for crunch and honey or maple syrup for sweetness level that you control. It is also much more tasty when it's fresh compared to the unhealthy store-bought ones.\n3. Score: 63 | Comment: I use Grape Nuts cereal. It gives it a nice crunch, and it's fairly nutritious as cereals go.\n==============================", "\n            === POST 48 ===\n            Title: Need some ideas for no-cook meals please!\n            Score: 36 upvotes\n            Total Comments: 59\n            URL: https://www.reddit.com/r/EatCheapAndHealthy/comments/1mj83ej/\n            Content: Hi all! As the title suggests I need some ideas for meals that don't require cooking for work. I go out of town a lot for my job and the hotels they put us in usually just have a microwave and mini fridge. This has resulted in me usually getting fast food for my meals. Obviously, that is not the best option financially or health wise. I work a very physically demanding job, so during the day I like to keep my meals light. I'm usually really hungry by dinner so I need something filling but not heavy. I'm planning on buying some electric cooking equipment (electric cooking pot/steamer) for greater meal variety, but for now I don't have those things. I'll add that I was told by my doctor I have high cholesterol so I want to try to keep that in mind when eating as well. My biggest issue is feeling very lethargic during the day so I'm hoping to add food into my diet that helps with my energy levels. Let me know what your go to no-cook meals are please! I'd love any suggestions and advice yo\n\n            TOP COMMENTS:\n        1. Score: 36 | Comment: Bagged salad and a rotisserie chicken was one of my go-tos when I was remodeling my kitchen.\n\nIf you have access to a Trader Joe's, they have some good options for microwaveable food - rice, dal, frozen veggies, etc. Just watch out for high sodium on any processed foods or things that include a sauce.\n2. Score: 17 | Comment: Fruit salad, yogurt bowls, sandwiches, frozen meals that can be cooked in the microwave - you can ‘bake’ a potato in the microwave have it with beans and cheese. Crackers and cheese, peanut butter, and fruit. \nThough not necessarily as tasty - protein powder shakes - over night oats. \nThere’s companies that deliver nice prepackaged salads- maybe you can order a box to your hotel to keep you going for a while?\n3. Score: 12 | Comment: Snack plates, forever. You just have to prep your fruits and veg once every few days and microwave your protein if you want. These are all my regulars but obviously, this list could be 4 pages long.\n\nPick **one or two proteins:**  \nBreast or leg from a rotisserie chicken  \nTurkey deli meat  \nChicken sausage  \nCottage cheese  \nHardboiled eggs\n\n**One or two fruits/starches:**  \nKiwi  \nGrapes  \nApple  \nWatermelon  \nBerries  \nBaked sweet potato\n\n**Two or three veggies:**  \nCucumber  \nCarrots  \nCelery  \nHearts of palm  \nBroccoli (blanched)  \nAsparagus (blanched)  \nGreen beans (blanched)  \nTomato\n\n**A condiment:**  \nMustard  \nHot sauce  \nYogurt sauce (Garlic, lemon, & dill)   \nOnion dip  \nOlives/pickles/marinated artichoke hearts\n\nUsually comes out around 500ish calories. I keep bins in my fridge of all the prepped produce so it takes less than five minutes to throw together, almost no dishes, and the variety always makes the plates look pretty.\n==============================", "\n            === POST 49 ===\n            Title: Help, very picky eater, but need high fiber and high protein\n            Score: 0 upvotes\n            Total Comments: 11\n            URL: https://www.reddit.com/r/EatCheapAndHealthy/comments/1mj6pvb/\n            Content: Things i eat:\n\nChicken, fish, beef, ham, shrimp, crab, eggs\n\nCarrots, peas, string beans, potatoes, corn, lettuce\n\nStrawberries, blueberries, watermelon, peaches, pears, bananas\n\nPinto beans, refried beans, brown, white, Jasmine,   \nBasmati rice, barley, pasta, kidney and cannelli beans (in Chili)\n\nWhole wheat bread, whole wheat tortilla shells (mission Carb smart), regular oatmeal\n\nSeeds - sunflower, almonds, walnuts, pepitas, peanuts, pistachio, cashews\n\nI do not like Coconut\n\nany help on meals, meal preps  \n\n\n            TOP COMMENTS:\n        1. Score: 15 | Comment: This list is pretty comprehensive across all food groups if a little limited in each category. What ingredients are you commonly finding in recipes that you don't like?\n2. Score: 8 | Comment: Just eat those foods!!\n3. Score: 3 | Comment: Chili con Carne, if you can stomach the crushed tomatoes. From your list what you’d need: beef and/or pork mince, canned corn, mix in any kind of legume you can eat, shred in some carrots. Add cooked rice by the end if you’re in to that.\n\nExtra things from outside your list, other that crushed tomatoes, would be onion, garlic and bell peppers, but can probably do without. Season according to taste. Easy and cheap to meal prep.\n\nAlso a banger to eat on white toast\n==============================", "\n            === POST 50 ===\n            Title: Huge health concern PSA! Black Foam particles found contaminating meat in major grocery stores (Safeway/Albertson’s)\n            Score: 5 upvotes\n            Total Comments: 6\n            URL: https://www.reddit.com/r/keto/comments/1ml0ttc/\n            Content: \nI posted something about this last week but when I had to throw away $50 worth of steak the other night because I found so many black flecks, I had to speak up. \n\nSo when I went back to Safeway’s meat department yesterday, I was on a mission to take photos of contaminated meat on the shelves and I was dismayed at what I saw.\nMaybe even horrified at what I found AND the lack of response from the meat dept employees. \n\nAs I pointed out package after package of meats (not just beef but pork and salmon, really anything on the black polystyrene trays), the apathetic nods and placating promises to “talk to somebody about this” just convinced me to take it to a customer service manager. \n\nThe gentleman there took a much more serious approach, taking notes and my number, after showing him the photos.\n\nSo, my hope is to follow through with this and raise awareness, even on social media, or the news if I have to, because carcinogenic particulate in my steaks just really ruins my appetite.\n\nChec\n\n            TOP COMMENTS:\n        1. Score: 9 | Comment: You're talking about the packaging getting on the meat, right?  You can simply rinse that off.\n2. Score: 6 | Comment: All humans, and I mean all, are born with microplastics in their body.\n\nThis appears to be another way we accumulate them.\n\nThis is a packaging problem, not a meat problem.\n\nNot a keto problem.\n==============================", "\n            === POST 51 ===\n            Title: Need advice/reality check\n            Score: 2 upvotes\n            Total Comments: 8\n            URL: https://www.reddit.com/r/keto/comments/1mkwwcz/\n            Content: Hi! I’ve been working out for abt 2 months and have been doing keto for 5 weeks now. I had lost 13 pounds until this week and now I’m up 3 more. I’ve been eating super clean (eat all my meals at home, measure how much I eat), eating under maintenance calories , and counting carbs. The most carbs I’ve been eating is around 12 net carbs maximum but most days it’s less. I’m getting discouraged that I’m not losing anymore weight. Especially when I was 3 pounds lighter on Sunday. I just need assurance that this is normal and I’m not doing something wrong. I’m female btw. Is there something I should do to get over this or something I may be doing wrong? Thank you! ALSO I’ve been doing intermittent fasting 16:8 except I have cream in my coffee \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: the reason you lost a lot fast was likely due to water weight and glycogen depletion and after a while your body gets used to having fat as your fuel source then adapts so at the phase you’re in you’re body is likely just adapting and those 3 lbs could just be water also the scale tends to go up and down depending on a lot of different factors i find the best tracking method to be a measuring tape\n2. Score: 1 | Comment: Stop weighing every day, it will make you mental...ask me how I know. Stay under 20g of carbs and the rest will take care of itself.\n3. Score: 1 | Comment: I eat keto at maintenance, so the same calories every day, and my weight will clock in between 129 and 138lbs on any given day for a ton of reasons (water retention, hormones, urine/waste, etc.). You’re a human and it’s normal to have weight fluctuations, that doesn’t mean you actually gained body fat. You didn’t. 👍🏻\n\nIf it’s stressing you out, I recommend staying away from the scale for awhile. Weigh yourself once a month or so instead.\n==============================", "\n            === POST 52 ===\n            Title: Surprised\n            Score: 18 upvotes\n            Total Comments: 4\n            URL: https://www.reddit.com/r/keto/comments/1mkwkrz/\n            Content: I did strict carnivore for three months or so starting Jan. 2025, then because strict adherence was a bit monotonous for me, added in avocados, dashes of blueberries, full-fat yogurt, nuts. I still eat loads of eggs, bacon, beef, and butter, and feel ketosis is still pretty prevalent given reduced aches and pains and steady energy.\n\nStill, I asked my doctor for an advanced lipid panel out of curiosity. After six months of this WOE, all my markers improved, some dramatically (and they were already pretty good): lower triglycerides, higher HDL, lower overall LDL, with particle size predominantly large and fluffy, good ApoB.\n\nI figured the results would not be bad, but I was genuinely surprised, and motivated, that they were so good. My doctor, to his considerable credit, has been chill and very supportive. Anyway, all best to those who benefit from this.\n\n            TOP COMMENTS:\n        1. Score: 2 | Comment: Are you saying that your bloods are better on keto than carnivore, or better after keto & carnivore?\n2. Score: 1 | Comment: [deleted]\n3. Score: 1 | Comment: I love that this sub is filled with endless good reports like this. I can't wait until I get my first follow up blood panel this fall!\n==============================", "\n            === POST 53 ===\n            Title: KETO dropped my A1C considerably\n            Score: 55 upvotes\n            Total Comments: 10\n            URL: https://www.reddit.com/r/keto/comments/1mkv0w6/\n            Content: I figured it was my time to put in my success on KETO.  I started on a whim in March 2025 when a friend decided to go no sugar for 40 days.  I took it a step forward after hearing a co worker who had success on KETO and thought  \"I can try KETO for 40 days.\"\n\nFast forward to August and I am still riding that train HARD.\n\nI get blood work every 3 months as I was pre-diabetic for the last few years which I should have taken seriously then but didn't.\n\nIn the last 5  months, my A1C dropped from 6.2 to 5.5 and am no longer pre diabetic and have had it removed from my chart.\n\nWeight loss I am clocking in at 58.20 lbs lost since March 5. \n\nStarting weight: 315  \nCurrent weight: 256.8  \nGoal Weight: 135\n\nI have a long way to go weight loss wise, but aside from my BMI, and HDL (which I need to raise), all other labs came back exactly where they should be.\n\nLDL dropped to 97  \nTriglycerides dropped to 78\n\nI have found incredible success on KETO and like many of these threads advise, I treat KET\n\n            TOP COMMENTS:\n        1. Score: 17 | Comment: Great job! Nearly the same experience here- went in for yearly insurance checkup and apparently my A1C was pre-diabetic (and I was 275 lbs). Doc gave me a lecture and sent in diabetes meds to my pharmacy. My pharmacy called me later that day and told me that one of the meds prescribed wouldn't be covered by insurance and that it'd cost me $700 per month, so made the decision that day to immediately go on keto. After 6 months, I went back to the doc for blood work and my A1C was back to normal levels, and I had lost nearly 50 lbs.\n2. Score: 16 | Comment: Great to hear, but if I can offer a warning/heads up.\n\n“Prediabetes” is diabetes.  It’s just a level of diabetes that your insurance doesn’t want to pay for yet.\n\nIf you go back to a “normal” diet, your numbers will go back up.\n\nI’m diabetic and have had numbers as high as 10.1 in the past.  While doing keto I can get those numbers below 5.2, but that doesn’t mean I’m no longer diabetic, it just means I have it well under control.  If I go back to eating like I used to, it will go right back up.\n\nYou can’t “cure” diabetes, but you can put it in remission.\n\nI hope you have continued success on keto and if anything this motivates you even more to stick to it.\n3. Score: 7 | Comment: A couple of things regarding HDL:\n\n- It increases very slowly, so any change will take several months to show.\n\n- My HDL only started to significantly increase once I had stopped losing (stable weight / eating keto at maintenance calories) and exercising (running) for 6months+.\n\nIMHO cholesterol should be the least of your concerns if everything else is right. As you say, reading any carbs will probably mean falling back to your old ways, which is a big no no.\n==============================", "\n            === POST 54 ===\n            Title: LabWork - Cholesterol Questions\n            Score: 4 upvotes\n            Total Comments: 7\n            URL: https://www.reddit.com/r/keto/comments/1mktiyb/\n            Content: A little backstory... \n\nFor 20 years of my life I was in the gym 3 days a week and rather buff. My weight had ballooned to 230lbs though. I started keto when I was around 30 and stayed on keto for 7 years. I went from 240lbs to 185lbs and felt amazing. Cholesterol was high then as well but not like these numbers.  6 years ago I got hit with chronic pain out of nowhere so stopped the keto diet and gained all my weight back. Now that I have learned to live with the chronic pain im trying to get my body back in order, which is why I started back on keto.  \n\nCurrent....  \nI am 43, 5'4\", 205lbs. I had been on keto for about 60 days when I took this blood work. Still on keto and down from 220lbs to 205lbs in about 75 days. I was fasting for this bloodwork. I have been walking/jogging 3-4 days a week for the past 75 days. I have a family history of high cholesterol. My mother and her mother both had/have high cholesterol. My fathers father died of a heart attack. My father has had 2 heart att\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Hello and welcome to /r/keto!\n\nIt sounds like you've got a question about cholesterol. We have answers!\n\nPlease consider using the following resources\n\nhttps://www.reddit.com/r/keto/wiki/faq#wiki_what_about_cholesterol_and_heart_disease.3F\n\nhttps://cholesterolcode.com/\n\nAs a reminder, please read our FAQ before posting to r/keto. It can be found at https://www.reddit.com/r/keto/wiki/faq. Please also review our posting rules and community guidelines.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/keto) if you have any questions or concerns.*\n2. Score: 1 | Comment: What are your triglycerides? That's an important number with reading metabolic panels.\n3. Score: 1 | Comment: Here are other results from my bloodwork, I don't know what might be helpful:\n\nTRIGLYCERIDES    Analyte Value TRIGLYCERIDES 121 \n\nHEMOGLOBIN A1c 5.3 \n\n C-PEPTIDE, LC/MS/MS 2.34 H \n\nINSULIN RESISTANCE SCORE 49 \n\nLIPOPROTEIN (a) <10\n==============================", "\n            === POST 55 ===\n            Title: [2025-08-08] - [Weekend Victory Lap] - Have you had a personal victory this week? Share it with us!\n            Score: 2 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/keto/comments/1mkr47g/\n            Content: Hello /r/keto Community!\n\nYou've all been working so hard and we love hearing about all of your personal victories! Clothes too big? Friends and family noticing a difference? Skipped over something unhealthy? Please use this thread to share any of your Scale or Non-Scale Victories with us!\n\nMake sure to give us some background - what brought you to keto? Do you have any specific goals that align with your victories? Have you tried something new that led to your success? What's the next step for you?\n\nSince this thread is likely to fill up quickly, consider sorting the comments by \"new\" (instead of \"best\" or \"top\") to see the newest posts and support your fellow community members.\n\n*If you're new to* /r/keto *and need some info, start with* [*Keto in a Nutshell*](https://www.reddit.com/r/keto/wiki/keto_in_a_nutshell) *and* [*the FAQ*](https://www.reddit.com/r/keto/wiki/faq)*. Or, if you have a question that doesn't seem to be covered, head on over to the Community Support thread (pinned\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Yesterday marked four weeks of keto! Feeling good, stable, and ready to keep going.\n==============================", "\n            === POST 56 ===\n            Title: Did keto ever helped your anxiety and ocd depression ?\n            Score: 11 upvotes\n            Total Comments: 41\n            URL: https://www.reddit.com/r/keto/comments/1mknj09/\n            Content: I am trying a keto diet for a week now I have not eaten  sweets or grains and very Little carbs. I am feeling I lost some weight but I am not yet seeing results for my conditions ocd anxiety depression maybe that I have more energy . Anyone here helped with keto Their ocd anxiety ?\n\n            TOP COMMENTS:\n        1. Score: 13 | Comment: Anxiety, yes, because it relieved my depressive symptoms and so I wasn't so negative, which meant there was less to latch onto and worry about\n2. Score: 9 | Comment: Keto helped me with anxiety, depression, low mood and suicide ideation. It didn't just help - it got rid of it completely!\n\nBut I follow meat-heavy keto, so more of a ketovore style of eating. Lots of fatty red meat, pork, chicken, poultry, seafood, dairy, etc. The only vegetables I consume are pickles, avocado, bell peppers, onions and garlic. I cook with animal fats, but also use coconut and olive oil. I LOVE olive oil! I have 4 tablespoons of EVOO every day and it does wonders for my mood and brain!\n\nI use low carb seasonings and spices, with very clean ingredients: no gluten, no dextrose, no preservatives. I also allow myself a single cup of coffee with heavy cream every day, but sometimes I'll switch it up and drink sugar free hot chocolate instead.\n\nI find strict carnivore too restrictive (and boring!) and I think that keto allows for too many inflammatory additions, so ketovore is the happy medium for me!\n3. Score: 8 | Comment: For me my anxiety and rumination don’t go away completely but they improve significantly, like 80 % better at least. My energy levels are also better and I feel more resilient overall, both physically and mentally. \n==============================", "\n            === POST 57 ===\n            Title: Introduction, Me?\n            Score: 0 upvotes\n            Total Comments: 11\n            URL: https://www.reddit.com/r/keto/comments/1mkfc41/\n            Content: Hello, just wanted to say that I'm new to the whole keto to start burning my fat efficiently but here a question......HOW THE F*CK AM I GONNA EAT FO RTHE NEXT MONTH OR SO! \n\nCause let me tell you I'm struggling to get food into me especially when I don't know what keto friendly Options are in Fastfood or restaurants? \n\nPlus I'm latino, 2/3 of are plate have rice & beans and that a majority of dishes have some form of corn!!!!!\n\nSorry just felt like saying this cause I'm like day 3 and struggling not get sugar accidentally in me\nI had a drink of sparkling water but added with syrup flavor and didn't realize to check how much sugar in that alone, or if chewing sugar free gun is still okay after chewing a pack 😅 \nGlad to know reddit has a keto group\n\n            TOP COMMENTS:\n        1. Score: 13 | Comment: Read the FAQ. It will address all of your questions \n2. Score: 4 | Comment: [keto foods](https://id.pinterest.com/pin/2322237302551159/)\n3. Score: 4 | Comment: Just think of it as the caveman style of eating. \n==============================", "\n            === POST 58 ===\n            Title: Keto success\n            Score: 54 upvotes\n            Total Comments: 11\n            URL: https://www.reddit.com/r/keto/comments/1mkbpc7/\n            Content: This sub has helped through my weight loss journey and I normally don’t post to Reddit at all but I figured I would here as I am happy what has happened. 31 M  5 foot 8. For years I have been roughly 245 , give or take 5 pounds . I’ve struggled with addiction, binge drinking and eating fast food for about 10 years . Back in April I stopped smoking weed , something I’ve been doing for 15 years. Suddenly , I finally decided to get up and do all the things I’ve wanted to do.\n  I stopped drinking shortly after, and was the main reason for me to lose weight as I could feel my body in pain. I had an enlarged pancreas from drinking too much with a risk of getting pancreatitis . I just got some passing a kidney stone . In all honesty I had a real fear I was dying soon.\n   I tried keto back when I was 21 with success but I only stuck with it until I lost a little bit of weight and went back to doing the same old thing every day.\n  After letting go of the weed and alcohol, I started working out \n\n            TOP COMMENTS:\n        1. Score: 15 | Comment: Brilliant. I've just started today. 258lbs and a goal of 200\n2. Score: 6 | Comment: Good for you!!!, your story will motivate many!\n3. Score: 3 | Comment: Congratulations!   Remember to keep viligent, but enjoy the special occasions.\n==============================", "\n            === POST 59 ===\n            Title: Could gut bacteria develop that metabolizes things that are zero calorie in keto products\n            Score: 0 upvotes\n            Total Comments: 5\n            URL: https://www.reddit.com/r/keto/comments/1mk9q00/\n            Content: In the past I’ve done clean keto and had great success but this time around I’m using keto products, getting well under my basal metabolic rate, and simply not losing any weight. Could the calories on products be wrong if certain things like artificial sweeteners are able to be metabolized after all?\n\nEdit: I count calories, weigh food, use Cronometer\n\n            TOP COMMENTS:\n        1. Score: 3 | Comment: Occam’s razor: weigh everything. Dont use apps like myfitnesspal to do the adding for you but register the nutritional information from the package or official info into whatever app you’re using. Its easy to be off by a few hundred calories and there’s your calorie deficit.    \nThis is the reason most of the time unless you have a metabolic disorder.\n2. Score: 3 | Comment: Slapping \"keto\" on the packaging doesn't automatically make it a great choice.\n3. Score: 2 | Comment: Keto products, depending on their ingredients, can cause an insulin reaction in some people. If you’re having an insulin response, your body can halt ketone production and isn’t burning fat as well.\n==============================", "\n            === POST 60 ===\n            Title: When do ppl start noticing your weight loss?\n            Score: 2 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/intermittentfasting/comments/1ml1thz/\n            Content: What percentage of weight loss  until ppl start noticing a different? I’ve been working for 7 months on fasting. Starting out at 185 and now 149. I’m 5’9” female. Literally no one has ever said anything to me about my loss. I notice then difference when I look at pictures but not a ton when I look in the mirror. Not looking for ppl to compliment me but I feel ppl are more likely to notice when you’ve gained weight vs lost weight.\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 61 ===\n            Title: Too little calories?\n            Score: 1 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/intermittentfasting/comments/1ml1euw/\n            Content: Hi everyone,\n\nI’d like to get your insight on this pattern of eating. I’m doing IF 19:5, two meals at breakfast and lunch. I take care of macros and meet my protein goals, low carbs, high fibre, etc. But sometimes my daily calories are below 1000 and I’m concerned it would backfire on my metabolism. \n\nAs you can see in the screenshots, the meals are quite balanced and filling, and I put some treats in moderation so I feel fulfilled and satiated on all fronts. Please tell me what you think about this calorie deficit. I’m 5’2 F and sedentary most days. \n\nThanks!!\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Which app is this ?\n==============================", "\n            === POST 62 ===\n            Title: 3 Stone Down - Feb 25 - July 25\n            Score: 91 upvotes\n            Total Comments: 5\n            URL: https://www.reddit.com/r/intermittentfasting/comments/1ml0nkm/\n            Content: Bit shy of showing my face but just wanted to do my first post here after lurking for awhile and learning from everyone else's experiences.\n\nI started doing 18:6 Monday to Thursday.\n\n24 hours fast from Thursday lunch time to Friday lunch time \n\nAnd then on the weekends, pretty much eat whatever I want with Friday night being my 'big bad boy' meal 😂 (usually pizza)\n\nI also picked up running, cycling and continued playing soccer once a week (which I've always done anyway)\n\n\nI've gone from 124kg to 104kg in around 6 months all thanks to the advice, stories and methods on this sub. \n\nMy end goal is 100kg and hope to get to this by the start of October in time for a vacation.\n\nIf your just starting out with fasting, keep going, it gets easier and every bit of exercise you do just allows you to be slightly less rigid on the food side, which really helped my mentality.\n\nI ran my first 10k event in July and don't think I could ever go back to my old habits.\n\nThanks for reading and hopefully th\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: **Thank you for posting your [Progress Pic](https://www.reddit.com/r/intermittentfasting/?f=flair_name%3A%22Progress%20Pic%22)!**  \nPlease respond to this comment letting us know your:  \n  - **Height**:  \n  - **Starting weight/current weight/goal weight:** (SW/CW/GW)  \n  - **Fasting routine/protocol**:  \n  - **Exercise routine (if applicable)**:  \n  - **Diet on refeeds**:  (eg keto, low carb, vegetarian, calorie counting, nothing special, etc)\n  \n*You can see more of fazza0123's Progress pics by clicking [here](https://www.reddit.com/r/intermittentfasting/search/?q=author%3Afazza0123%20flair%3A%22Progress%20Pic%22&restrict_sr=1&sort=new)*\n\n-----\n\n**❗Please remember the rules of this subreddit when commenting and be respectful.❗**  \n  \n**Harassment of any kind will not be tolerated and could result in a ban**. Harassment may consist of, but is not limited to:  \n - **Sexual comments**, even if meant as a compliment ('sexy,' 'dad to daddy')  \n - **Treating OP like a sexual object** ('single?' 'onlyfans/gonewild/etc?')  \n - acting like this is a **porn sub** or **rateme sub** (saying what you'd like to do to OP, any sexual reaction to OP, \"10/10\", etc)  \n\n-----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/intermittentfasting) if you have any questions or concerns.*\n2. Score: 1 | Comment: Do you drink alcohol?\n3. Score: 1 | Comment: Well done. Great motivation. Why has intermittent fasting worked so well for you? How many calories in a day do you eat as I am a similar weight\n==============================", "\n            === POST 63 ===\n            Title: Back on the IF wagon after 5 years\n            Score: 4 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/intermittentfasting/comments/1mkzkas/\n            Content: Five years ago, I started IF as part of a general fitness and weightloss programme. After a year I lost around 15kg (33 pounds / ~2.5 stone). I was very proud, but I couldn't feasibly go lower as I was starting to look unhealthily slim in my appearance (according to family).\n\nSince then, I've put back on just over half of that (change in lifestyle, job, etc), and in the last 6 months, I put EVERYTHING back on - undoing a year's worth of hard work. This was due to a significant shift in life situation and establishing new routines etc.\n\nI decided the easiest thing I can do right now, to not put a permanent dent in my fitness, is to start IF again as I can't return to the gym at the moment (other commitments).\n\nWithin two weeks, I've lost so much water weight that I'm down 3kg (6 pounds / half a stone), and stopping snacking altogether. I know this can easily go back on, but I'm monitoring this like a hawk and adjusting my timings accordingly. I am drinking lots of water still, and the o\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 64 ===\n            Title: Irritability during refeeding.\n            Score: 1 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/intermittentfasting/comments/1mkxxzd/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Protein is the first thing that goes in the mouth.\n==============================", "\n            === POST 65 ===\n            Title: I can't seem to understand how that's even possible, 14 kg weight loss, but waist measurement is still the same.\n            Score: 5 upvotes\n            Total Comments: 19\n            URL: https://www.reddit.com/r/intermittentfasting/comments/1mkxq78/\n            Content: I started intermittenfasting (16:8) with a calorie deficet and gym/cardio routine December of 2024 I was around 118 kgs . Its august 2025 now, so around 8-9 months in and today i weighted myself and i am 104kgs. \n\ngreat right? well my waist measurement was 45inches when i started, today, it was still 45! \n\nThis makes no sense to me, i am losing weight on the scale, but no actual difference in body. \n\nBefore anyone says water weight, yes the first 1-2 months I had a massive drop like 8 kgs, which obviously had lots of waterweight. After that I was losing around 0.5/1kg a month. \n\n\n\nFOR REFERENCE !! \n\nOctober of 2023, I weighted around 117kgs, with a 46 inch waist. By January of 2024, I dropped to 106kgs, and I was 39 inch waist. \n\nNOT ONLY did I drop that weight in 3-4 months only, but my belly shrunk like crazy. \n\nso please someone help me understand this. I will go to see a doctor and do some tests, but before I spent 1000$+ (i dont have insurance) on medical tests, can someone who ha\n\n            TOP COMMENTS:\n        1. Score: 12 | Comment: I really don't think you need to go to a doctor without insurance because of this.  If you feel fine otherwise.\n\nEveryone's body is unique.  From your post, I'm guessing you are female and if I am correct, it may just be your body type.  Women carry their weight in different places, based on genetics or whatever.  Whereas with men, extra weight reliably accumulates in the stomach.\n\nI'd just keep doing what you are doing.  The weight is coming from somewhere, the scale is telling you this. It's got to be your upper body.\n2. Score: 8 | Comment: I like the paper roll analogy. Image a roll of paper with lots and lots of paper, every single sheet you remove is a kilo. In the beginning removing one or two doesn’t look like much, the roll looks the same. But at the end every sheet is wrapped around the roll twice or more. So removing a single sheet makes a big impact on how wide the roll looks. \n\nIt can be like that for some people. The biggest changes are seen at the end. \n\nBut the truth is, fat is removed in different places. Hormones and what not. And we don’t get to decide from where. I’m down quite a few kg myself. And all of it has come from my arms, legs and butt.. The stomach and moobs are the same.. I would have preferred it coming from my stomach first, but no, that’s where my body prefers to keep it. \n\nWe just have to endure, sooner or later it will also come away from where we would like it to.\n3. Score: 8 | Comment: Could it be visceral fat? When i wtarted IF i didnt change size for 25 pounds. I found on this subredddit it couls be visceral fat. Basically fat against your organs. When you fast its the first fat your body goes for. \n\nIm not the best at this subject but sounds the same as my experience.\n==============================", "\n            === POST 66 ===\n            Title: Starbucks cold brew\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/intermittentfasting/comments/1mkxoij/\n            Content: No text\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 67 ===\n            Title: IF is getting fun\n            Score: 10 upvotes\n            Total Comments: 7\n            URL: https://www.reddit.com/r/intermittentfasting/comments/1mkxhnf/\n            Content: I’m about a month and a half into IF (changing it up day to day ranging from 18-24 hour fasts then the occasional long 24-36 followed by a “feast” day) and I’ve just noticed something cool. I did my weekly run club but instead of eating last night, I ate an early lunch then was 19 hours fasted by the time I ran. It felt like a cheat code and I had so much energy and didn’t feel bogged down by a full stomach. I’ve felt better playing pickleball fasted too, and I’ve now realized I’m more excited for the next cool thing I get to accomplish wirh my body than I am excited for my next big meal. Has anyone else noticed similar changes as you go through IF? It’s really encouraging and way more so than anything on a scale or appearances could be. \n\n            TOP COMMENTS:\n        1. Score: 4 | Comment: Same! It’s all very rewarding isnt it!  Food now is like an after thought. It will be 2 months for me tomorrow and I just finished running 3 miles fasted and it’s the fastest I ran in a lonnnnng time. Saw 8 minutes pace during my run and I felt light as a feather. 😁 And this was after doing 1 hour of yard work and 45 minutes of strength training. 💪🏾💪🏾\n2. Score: 1 | Comment: Do you do IF 6 days a week? Or variations there if?\n3. Score: 1 | Comment: I definitely noticed this when I first started, and still appreciate it now. Energy and mental clarity, mood improvement. Cheat days are super fun but I usually don't outright crave them. Eating clean is easier when pretty much anything tastes good after a fast, and when your sugar cravings fall off dramatically.\n\nOn the mixed bag front are exercise and eating enough, respectively. Fasted cardio is great. Fasted strength training, not so much. Fasted conditioning is somewhere in between. For eating, getting enough veggies is never a problem but protein can be a challenge (without relying too much on powder).\n==============================", "\n            === POST 68 ===\n            Title: Hit a wall\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/intermittentfasting/comments/1mkwyax/\n            Content: Hi folks, July of 2024 I began IF, doing the 5:2 of 600 calories 2 days a week.  I lost 20 pounds- down from 205 to 185- in 6 months.  Christmas and New Year's came around; I got derailed and gained about 5 pounds.  I resumed the 5:2 the first week of January and have been stuck at 190 ever since.  This past July, I decided to mix it up and started doing a 24 hour fast two days a week, and I'm still stuck at 190.  I'm fairly certain my diet and activity is the same as the first six months of this lifestyle.  Any thoughts or suggestions?  Thanks\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 69 ===\n            Title: Why do I suddenly NEED sugar?\n            Score: 3 upvotes\n            Total Comments: 5\n            URL: https://www.reddit.com/r/intermittentfasting/comments/1mkvdel/\n            Content: I’ve got a pretty good relationship with sugar and have had one for a while. Very few cravings and I don’t need something sweet often, however since starting back on fasting I could devour a whole chocolate bar if I start, or if any is put in front of me. I feel like I’m undoing all of my fasting progress and more when this happens. \n\nHas anyone else found this happen to them? How can I reap the benefits or fasting but avoid this bingeing ? Should I cut back on fasting or eat more food in my eating windows? I feel like my portions are pretty big but maybe they need to be bigger … I’ve done x2 38-40 hour fasts in the past 8 days, x1 20 hour fast and x2 17 hour fasts. I only started fasting again about 10 days ago so maybe I’ve gone in too fast?\n\n            TOP COMMENTS:\n        1. Score: 6 | Comment: Sugar and carbs are usually easier to prepare and more accessible, which makes them an easy choice. \n\nI didn't realize how addictive they can be until I started fasting. After eating sugar, i would sometimes experience anxiety or even symptoms of depression.\n\nWhat helped me the most was switching to a lower-carb diet, but the real turning point was regularly eating fermented foods and probiotics.\n It took a few weeks of consistency, but over time, my sugar and carb cravings decreased a lot.\n2. Score: 1 | Comment: Sugar - carbs - is easy energy, preferred by the body instead of energy made from fat (ketones). As you fast, your glucose stores from your body get used up, and the body sends strong signals for eating more carbs. If you don't give in and keep fasting and/or eating a low carb diet, in a few days, body switches to using fat for energy (making ketones), and carb cravings should almost go away. Then, it's up to you to differentiate between actual hunger/need for energy and just cravings, and to stop yourself from indulging in chocolate bars. It's really like quitting drugs, and it can be as hard. \n\nYou say you don't typically crave sweets, but not all carbs are sweet. Rice is fast carbs, so is all (most?) grains, some veggies are high in carbs, beans, legumes, bread, pasta, also fruit and berries... My guess is, sweets associates easier with quick easy energy, so we crave sugary stuff rather than a bowl of beans... Or a pizza... But it depends xD\n\nYou can reduce carb cravings and make fasting easier by sticking to a low carb diet, like keto, for a few weeks... You can even stuff your face with keto foods until you can't fit in anything anymore, if that stops you from eating chocolate, and wean yourself off fast carbs that way... And then just... Don't fall back into old patterns, and if you do, you now have tools to get out. 😅 \n\nAnd no one needs sugar! 😅 Sugar is very unhealthy! Choose complex carbs instead! Or eat a fruit or a handful of berries... It will be much healthier. And cravings will get better.\n3. Score: 1 | Comment: When you're not fasting and want sugar, put some peanut butter on a spoon with a tad bit of honey. That might help!\n==============================", "\n            === POST 70 ===\n            Title: Breakfast bowl\n            Score: 17 upvotes\n            Total Comments: 11\n            URL: https://www.reddit.com/r/Volumeeating/comments/1ml06ev/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/Volumeeating/wiki/index/#wiki_subreddit_rules)**\n2. If you don't like the content of this post for any reason, refrain from commenting. Negative comments will be removed and the authors banned.\n3. Advice concerning medical issues is not permitted.\n4. We take brigading very seriously. Anyone found sharing content from this sub to other forums with derogatory commentary will be banned and reported to admins. \n5. **Report rule breaking content.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Volumeeating) if you have any questions or concerns.*\n2. Score: 9 | Comment: Not counting the pupper feels like undercounting not gonna lie\n3. Score: 3 | Comment: I thought avocados were toxic the dogs? \n\nAlso can you make me a plate too?\n==============================", "\n            === POST 71 ===\n            Title: Ninja Creami who? Homemade frozen yogurt- no blender either - 63 cal\n            Score: 61 upvotes\n            Total Comments: 9\n            URL: https://www.reddit.com/r/Volumeeating/comments/1mkmk74/\n            Content:  This was so good, zero sugar, and zero mess! I don’t have a creami (sadly) so I’ve been trying to make my own things and today I found a good recipe! Loved it so much I made it later in the day too!\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/Volumeeating/wiki/index/#wiki_subreddit_rules)**\n2. If you don't like the content of this post for any reason, refrain from commenting. Negative comments will be removed and the authors banned.\n3. Advice concerning medical issues is not permitted.\n4. We take brigading very seriously. Anyone found sharing content from this sub to other forums with derogatory commentary will be banned and reported to admins. \n5. **Report rule breaking content.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Volumeeating) if you have any questions or concerns.*\n2. Score: 4 | Comment: Yes! I've been doing this since I was 14 and back then I strained my yogurt to create what later became \"greek yogurt\".\nIf you want a very rich chocolatey ice cream try, 30g Cocoa powder, a fuck ton of stevia, 1 tsp pink salt, a couple tbsps HOT water. Mix it all together until its a smooth watery paste, then let it sit in the freezer for several hours.\nI make mine in the morning so I can have it for dessert. I take it out about a half hour before I want to eat it. It goes from a chocolate brick to something smooth with the consistency of ice cream. I love it so much and look forward to it aaalllll day. Especially in the summer. Warning lotta Fibre in this recipe 💩💩\n3. Score: 2 | Comment: I used to do this before my ninja. Just trust the ninja is WAY WAY WAY better…\n==============================", "\n            === POST 72 ===\n            Title: Cabbage Stir Fry with Canned Tuna Fish. A cheap and very versatile 1-pot-meal that cooks in just a couple of minutes. I'm not a fan of canned tuna fish but I'll be making this again. 508cals and 45g of protein for the entire dish that can be separated into 2 to 3 prepped meals (169-254cal each).\n            Score: 4 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/Volumeeating/comments/1mkm4m7/\n            Content: Ingredients: 2 cans of tuna fish, ¼ head of cabbage, 2 small (or 1 large) carrot, 1 tbsp of sesame oil, \n\nSauce: 1 tbsp of soy sauce, 1 tsp of your choice of garlic, 1 tsp of gochujang, 1 tsp of hoisin sauce, 1 tsp of brown sugar, 1 tsp of accent flavor enhancer (msg), ½ tsp of black pepper (or to taste)\n\n(Once you have all the sauce ingredients, you can make it MANY times again.)\n\nInstructions: prep everything separately. Mix all sauce ingredients and set aside. Thinly slice cabbage to your liking, grate carrot, and set aside. Open and thoroughly drain cans of tuna fish and set aside. Put the 1 tbsp of sesame oil in a large pot and heat on med/high. When oil is hot, toss in the tuna fish and stir. After a minute or so, pour in the sauce, stir, and then toss in your cabbage and carrots, stir. Add lid or cover and remove from heat. If eating while hot grab a bowl and the cabbage should be wilted just enough by the time you come back and should have absorbed some flavor but retained its \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/Volumeeating/wiki/index/#wiki_subreddit_rules)**\n2. If you don't like the content of this post for any reason, refrain from commenting. Negative comments will be removed and the authors banned.\n3. Advice concerning medical issues is not permitted.\n4. We take brigading very seriously. Anyone found sharing content from this sub to other forums with derogatory commentary will be banned and reported to admins. \n5. **Report rule breaking content.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Volumeeating) if you have any questions or concerns.*\n==============================", "\n            === POST 73 ===\n            Title: Need new meal ideas\n            Score: 5 upvotes\n            Total Comments: 16\n            URL: https://www.reddit.com/r/Volumeeating/comments/1mklzqk/\n            Content: I’ve been eating this way since march but I’ve started falling off big time lately because I’m bored with my old stand bys. I usually have turkey wraps, cauli rice with spaghetti sauce, chicken sausage, fish tacos..what are some of your easy super low calorie meal standards? \nAlso looking for sweet recipes for these damn cravings. I’ve been eating low carb yogurt and cool whip and low carb fudge pops \n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/Volumeeating/wiki/index/#wiki_subreddit_rules)**\n2. If you don't like the content of this post for any reason, refrain from commenting. Negative comments will be removed and the authors banned.\n3. Advice concerning medical issues is not permitted.\n4. We take brigading very seriously. Anyone found sharing content from this sub to other forums with derogatory commentary will be banned and reported to admins. \n5. **Report rule breaking content.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Volumeeating) if you have any questions or concerns.*\n2. Score: 9 | Comment: Sautee cabbage, onions, mushrooms, with a little bit of bacon. Top with grilled chicken and soy sauce. Key is to cut the cabbage into long thin strips to mimic pasta. \n\nSomething sweet, Greek yogurt with pudding mix, berries, and a low cal cereal.\n3. Score: 5 | Comment: i love sushi bowls!! i’ll use rice (but you could sub for cauliflower rice since you said low carb, or do half and half), LOTS of cucumber, shrimp, crab (i use snow crab, but you could shred imitation crab), salmon (sometimes), whipped cream cheese, green onion, furikake seasoning, eel sauce, soy sauce, sriracha, avocado (i use half a goverden brand cup). if i use the salmon it comes out to 574 calories and 40g of protein. but you obv could make it lower calorie with cauliflower rice\n==============================", "\n            === POST 74 ===\n            Title: dannon light and fit caramel\n            Score: 15 upvotes\n            Total Comments: 8\n            URL: https://www.reddit.com/r/Volumeeating/comments/1mkjwx2/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/Volumeeating/wiki/index/#wiki_subreddit_rules)**\n2. If you don't like the content of this post for any reason, refrain from commenting. Negative comments will be removed and the authors banned.\n3. Advice concerning medical issues is not permitted.\n4. We take brigading very seriously. Anyone found sharing content from this sub to other forums with derogatory commentary will be banned and reported to admins. \n5. **Report rule breaking content.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Volumeeating) if you have any questions or concerns.*\n2. Score: 5 | Comment: I have these every day, I freeze them then when I eat them I let them thaw out a little and eat them like ice cream .\n3. Score: 2 | Comment: I have one of these every day, too, but I’ve never seen the caramel before. Toasted marshmallow and tiramisu are my faves, but are also fairly hard to find, so I eat a fair amount of strawberry cheesecake. Lemon meringue is not good. I think I’ll try the frozen trick (below).\n==============================", "\n            === POST 75 ===\n            Title: Super delicious and filling lunch!\n            Score: 14 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/Volumeeating/comments/1mkcxon/\n            Content: 508cal!\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/Volumeeating/wiki/index/#wiki_subreddit_rules)**\n2. If you don't like the content of this post for any reason, refrain from commenting. Negative comments will be removed and the authors banned.\n3. Advice concerning medical issues is not permitted.\n4. We take brigading very seriously. Anyone found sharing content from this sub to other forums with derogatory commentary will be banned and reported to admins. \n5. **Report rule breaking content.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Volumeeating) if you have any questions or concerns.*\n2. Score: 1 | Comment: That looks yummy. I’ll have to try the guacamole crema out using regular yogurt.\n==============================", "\n            === POST 76 ===\n            Title: Super delicious and filling lunch!\n            Score: 44 upvotes\n            Total Comments: 8\n            URL: https://www.reddit.com/r/Volumeeating/comments/1mkcxgw/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/Volumeeating/wiki/index/#wiki_subreddit_rules)**\n2. If you don't like the content of this post for any reason, refrain from commenting. Negative comments will be removed and the authors banned.\n3. Advice concerning medical issues is not permitted.\n4. We take brigading very seriously. Anyone found sharing content from this sub to other forums with derogatory commentary will be banned and reported to admins. \n5. **Report rule breaking content.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Volumeeating) if you have any questions or concerns.*\n2. Score: 2 | Comment: Love a good sauce! How long do these last after making them? \n3. Score: 1 | Comment: This looks absolutely delicious! I was wondering about the chicken breast seasoning and how it was cooked? I'd like to try this meal as it fits in my calorie allowance.  I could probably eat this multiple times a week and not get tired of it.\n==============================", "\n            === POST 77 ===\n            Title: Simplest and best 240 cal\n            Score: 65 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/Volumeeating/comments/1mkcrk9/\n            Content: 1 portion steak bites from Costco 120 cal\n4 portions steamed broccoli 120 cal\nGarlic powder, onion powder, sesame seeds, touch of soy sauce.\nEasy and delicious and filling\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/Volumeeating/wiki/index/#wiki_subreddit_rules)**\n2. If you don't like the content of this post for any reason, refrain from commenting. Negative comments will be removed and the authors banned.\n3. Advice concerning medical issues is not permitted.\n4. We take brigading very seriously. Anyone found sharing content from this sub to other forums with derogatory commentary will be banned and reported to admins. \n5. **Report rule breaking content.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Volumeeating) if you have any questions or concerns.*\n==============================", "\n            === POST 78 ===\n            Title: Ninja creami recipe UK\n            Score: 4 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/Volumeeating/comments/1mkazx6/\n            Content: UK based- go too low calorie recipes\n\nI recently purchased a ninja creami and was wondering what are you go too low calorie received <250 cals ? I’m based in the UK\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/Volumeeating/wiki/index/#wiki_subreddit_rules)**\n2. If you don't like the content of this post for any reason, refrain from commenting. Negative comments will be removed and the authors banned.\n3. Advice concerning medical issues is not permitted.\n4. We take brigading very seriously. Anyone found sharing content from this sub to other forums with derogatory commentary will be banned and reported to admins. \n5. **Report rule breaking content.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Volumeeating) if you have any questions or concerns.*\n2. Score: 2 | Comment: 400ml skimmed milk, scoop of protein powder, 1-2 tbsp sweetener or sugar free syrup. Make it a bit too sweet before freezing as freezing will dull the sweetness. Once you spin it add snack size bags of oreos/cookies/rice cake/biscuit/fibre one bar etc on mix in setting. Have fun!\n==============================", "\n            === POST 79 ===\n            Title: Updated Cheesey Chicken and Noodles\n            Score: 3 upvotes\n            Total Comments: 1\n            URL: https://www.reddit.com/r/Volumeeating/comments/1mkaad6/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: # A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/Volumeeating/wiki/index/#wiki_subreddit_rules)**\n2. If you don't like the content of this post for any reason, refrain from commenting. Negative comments will be removed and the authors banned.\n3. Advice concerning medical issues is not permitted.\n4. We take brigading very seriously. Anyone found sharing content from this sub to other forums with derogatory commentary will be banned and reported to admins. \n5. **Report rule breaking content.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Volumeeating) if you have any questions or concerns.*\n==============================", "\n            === POST 80 ===\n            Title: DAE have a weird stall every month?\n            Score: 2 upvotes\n            Total Comments: 3\n            URL: https://www.reddit.com/r/CICO/comments/1ml0g85/\n            Content: I would say I have about every 2 weeks where the scale does not budge and then I’ll randomly weigh myself and I’ll be three or four pounds lower. Does this happen to anyone else or does anyone know why? For example I’ll be 240.2 every single day for around 2 weeks(no changes in the ounces, exactly 240.2) and then randomly I’ll be 237.4. Honestly now that I’m thinking about it my scale doesn’t really do a different number until I’ve lost a pound or two.(I think it’s one of those ones that keeps track of what you weighed last time, idk it’s very cheap) But I know I’m losing weight given it does eventually go down and I weigh every thing I eat. What does this mean? \n\nEdit to include that I’m a woman if that changes anything \n\n            TOP COMMENTS:\n        1. Score: 3 | Comment: Yuuuuup. Mine isn’t actually every month — I’m also a woman but am in perimenopause and don’t menstruate regularly — but it’s still pretty predictable. I lose 3-4 pounds per week for 2 weeks, then gradually lose less and less over the next few weeks, before bottoming out to less than half a pound a week for 2 weeks before starting the cycle up again. \n\nBodies do weird things.\n2. Score: 1 | Comment: Yep! Usually mine follows the menstrual cycle, with water retention in the last week and then the drop after my period when I lose the extra water weight. My graph looks like a staircase. But it's been weird this month and I haven't had the drop yet, I've been 187.2 for an annoying amount of time. I'm getting a little impatient, but I know it will kick in eventually.\n3. Score: 1 | Comment: Got a uterus? Because that'll do it.\n==============================", "\n            === POST 81 ===\n            Title: Help choosing activity level\n            Score: 0 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/CICO/comments/1ml04d8/\n            Content: Which one to choose if im lifting weights 4x a week and walking daily 12-15k steps.\n\n            TOP COMMENTS:\n        1. Score: 5 | Comment: Moderate exercise. This is just a starting point, though. You'll need to see what happens over time if that's the right number for you.\n2. Score: 1 | Comment: Light to moderate.\n\nIt depends on the steps, strolling 8 hours in front of a class will be light maybe lower even. Good 2 hour continuous walk at a brisk pace -> moderate.\n\nThe weights do not add enough to consider a 'level up'\n==============================", "\n            === POST 82 ===\n            Title: Face Gains 42 and 47\n            Score: 133 upvotes\n            Total Comments: 6\n            URL: https://www.reddit.com/r/CICO/comments/1mkzybm/\n            Content: 1st pic: Summer 2020, Pic 2, 3, 4: Summer 2025. You have the power to change your life! I can’t believe how much happier I am and how much life has to offer once I made the change. My transformation was inside and it manifested to my outward appearance. I’m still not at my goal, but I’m very grateful for this community. Lots of love to you all, fam. 🤍\n\n            TOP COMMENTS:\n        1. Score: 5 | Comment: You look amazing!!!\n2. Score: 2 | Comment: You look amazing and younger, nice work!\n3. Score: 0 | Comment: And body gains?! ;-)\n==============================", "\n            === POST 83 ===\n            Title: Work was giving these away. Got a decent haul!\n            Score: 51 upvotes\n            Total Comments: 3\n            URL: https://www.reddit.com/r/CICO/comments/1mkwhrj/\n            Content: No text\n\n            TOP COMMENTS:\n        1. Score: 3 | Comment: GOD I WISH THAT WERE ME\n2. Score: 2 | Comment: Those Quest bars are good and go for at least $2 each most places. That's a pretty good haul!\n3. Score: 2 | Comment: I’m so jelly, this is an awesome haul!\n==============================", "\n            === POST 84 ===\n            Title: Hit my goal! (7 Months)\n            Score: 673 upvotes\n            Total Comments: 10\n            URL: https://www.reddit.com/r/CICO/comments/1mks3ek/\n            Content: Went from 209lbs to 147. Still have a little work to do, but super excited with how far I've come. Down from and XL to a Medium. It has been a journey.\n\n            TOP COMMENTS:\n        1. Score: 19 | Comment: Congratulations! You look wonderful!\nBest tips please (just started).\n2. Score: 3 | Comment: Amazing work! Congrats!!!!\n3. Score: 3 | Comment: nice job!!\n==============================", "\n            === POST 85 ===\n            Title: Macros split for high protein low calorie\n            Score: 1 upvotes\n            Total Comments: 3\n            URL: https://www.reddit.com/r/CICO/comments/1mkrtsc/\n            Content: Hello, I've ( M 34 , 5 '10) managed to have great success with CICO so far, have managed to go from 268 down to 187.\n\n Ive been emphasizing on moving more,working out and focusing on high protein all while counting .It has changed my entire life and I plan on continuing with counting and improving my health / body. \n\n I have been aiming .07- 1 gram of protein , without much care for any of my other macros besides fiber. I've started to notice some effects of having low fats and carbs so trying to figure out a good split ratio for fats carbs and protein that will be sustainable if anyone can help? \n\n            TOP COMMENTS:\n        1. Score: 4 | Comment: Good rule of thumb is to make sure at least 20% of your calories are coming from dietary fat. You’ve already got protein and fiber dialed, so plug the rest with carbs. I recommend potatoes, they’ll keep you feeling full.\n2. Score: 2 | Comment: For your height and weight, if you're trying to minimize calories I'd go 180g protein, give or take, enough carbs to keep you from feeling like shit (varies a lot depending on person but at least 75-100g) and full in the rest with fats\n3. Score: 2 | Comment: 30% fat, 50-60g should be good. 150g protein should be more than sufficient for muscle retention, you're not going to make gains in a deficit, excess will just get burned off for calories.  Rest go to carbs.\n==============================", "\n            === POST 86 ===\n            Title: Different nutritional Values for the same thing?\n            Score: 0 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/CICO/comments/1mklt65/\n            Content: I am buying black lentils on amazon and every single one I look at has different nutritional values than the others, why is that and which do i trust?\n\n  \nFor example, the first one has more in terms of weight and less calories than the one that has less in terms of weight.\n\nhttps://preview.redd.it/912jrjx84qhf1.png?width=343&format=png&auto=webp&s=349c9f7db9e4fb7e692bd0cd7aaaa7c91a7f1a72\n\nhttps://preview.redd.it/ijxksh994qhf1.png?width=328&format=png&auto=webp&s=b92da19242d973fcda1a28c5adfb14d41a3d5fac\n\n\n\n            TOP COMMENTS:\n        1. Score: 4 | Comment: One is for 43 grams, the other 50. Also cups suck for anything not wet or very granular, use a scale.\n\nContents will vary per brand, storage and processing method and genus of the plant stuff inside. (it's just different lentils.)\n\n145 / 50 = 2,9 kcal/gr and 150 / 43 = 3.4 kcal/gr\n\nUse the packaging info of the ones you are using. All should be accurate, for their own contents.\n2. Score: 2 | Comment: I don't use Amazon for anything that goes in my body. Plenty of third party testing reveals that they often sell adulterated products since there is relatively little oversight. This might explain some of the discrepancy between products that you are seeing: some companies are just straight up making it up as they go. \n\nLentils are pretty affordable in stores (in my area at least) but especially so at Korean, African, Chinese, and Indian markets. \n\nBest of luck! I like making lentil hummus :)\n==============================", "\n            === POST 87 ===\n            Title: Is my approach totally bad?\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/CICO/comments/1mkk64j/\n            Content: No text\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 88 ===\n            Title: Still hungry even in surplus??\n            Score: 6 upvotes\n            Total Comments: 18\n            URL: https://www.reddit.com/r/CICO/comments/1mkjabr/\n            Content: Guys… I’ve lost 25-30 pounds, it took me an entire year and a half because I also consistently weight train and didn’t want to lose muscle or diet too hard (and crash or burnout like I am right now…)\n\nAnyway I’ve started eating at maintenance… and got hungrier, then I started pmsing and eating in a slight surplus… still hungry, and for months I’ve been at maintenance or slightly above and my appetite is through the roof. \n\nIs this just a mental thing or am I just super hungry because of the weight loss? I’m so exhausted from tracking, I work full time, I exercise few times a week along with some active rest days and long walks. Maybe it’s just physical exhaustion?!? \n\nCan anyone relate to always being hungry and having a big appetite when trying to take a break from the dieting. What should I do. I want to get this under control and at least maintain my weight. \n\nInfo: I’m F, 5’4, 140 (I gained some weight I started at 160 ish) oh and I’m adding that I eat pretty healthy and meal prep \n\n            TOP COMMENTS:\n        1. Score: 11 | Comment: Something to consider is vitamin deficiencies.\n\n\n When I'm low on iron I get hungry for snacks and tired. \nI'm most anemic around my cycle.\n2. Score: 3 | Comment: If youre hungry, focus on eating foods that satiate you.\nIf you're gaining... either lower your daily calories by 100 or so every week until you find the sweet spot, or eat at a deficit 2-3 days a week and your current maintenance the rest of the time?\n\n\nEdit: protein and fiber are satiating foods. I personally find potatoes incredibly satisfying as well. You could start meals with a soup or a full glass of water....\n3. Score: 2 | Comment: Look at what you are eating. If you’re including processed/junk/packaged foods in your daily regimen the addictive nature of these products (by design) may be causing you to be hungry.\n\nA reset (including abstaining from these foods to break the cycle), and a re-focus on total health may be helpful. \n\nWhen we eat certain foods, the gut microbiome evolves to digest those foods, and will also signal the brain that you need more. Modifying the microbiome with healthy probiotics may be beneficial. Worth a try I think. Good luck.\n==============================", "\n            === POST 89 ===\n            Title: How many calories in this portion of fried fish? 500?\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/caloriecount/comments/1ml1vx5/\n            Content: Breading wasn't too thick, swipe to see\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 90 ===\n            Title: Two Different Nutrition Facts on TTeokbokki cup\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/caloriecount/comments/1ml1oay/\n            Content: I recently bought this Pororo TTeokbokki Dried Rice Cake with Hot Sauce from H Mart and noticed there were two different nutritional labels on the cup. The new label and what I could find on the internet say it’s 190 calories for 120 grams but the packaging (which I’m more inclined to believe) says it’s 320 calories for the same amount. Which of these labels do you think is more accurate? \n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 91 ===\n            Title: Calzone cals\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/caloriecount/comments/1ml1now/\n            Content: I think the filling is sausage, pizza sauce, mushrooms, peppers, onions\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 92 ===\n            Title: Two pictures: how much for this tofu veg rice box?\n            Score: 3 upvotes\n            Total Comments: 2\n            URL: https://www.reddit.com/r/caloriecount/comments/1ml0l07/\n            Content: One picture for reference size of box and one from the top \n2/3 of the box contained white plain rice and 1/3 was tofu and veggies. The veggies didn’t seem oily at all,  but the tofu was definetly fried…. I couldn’t taste any sauce (I didn’t order any) but I do think the tofu might have been fried in soy sauce?\nWould be grateful for any help!\nMy guesstimate is: 400 for rice+250 for tofu+100 for veg=750, but I don’t know if this is too low or too high?\n\n            TOP COMMENTS:\n        1. Score: 1 | Comment: Looks to be 1 cup rice=200 calories.\nBut they add oil, likely 1 tbsp = 120 calories.\nFor the rest you can assume an additional 1-2 tbsp, 1.5 tbsp= 180 calories.\nActual veggies= 1/2 cup? 20-30 calories, let's say 25.\nTofu about a half cup= 100 calories.\n\nTotal: 625 calories.\n\nIf you wanna play it real safe: 700-750 (your estimate.)\n==============================", "\n            === POST 93 ===\n            Title: Birria Pizza\n            Score: 2 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/caloriecount/comments/1ml08pl/\n            Content: What are the macros we are thinking? Its from a family owned restaurant so I’m not sure of the calories. \n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 94 ===\n            Title: cals in 3 of these lamb chops?\n            Score: 2 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/caloriecount/comments/1ml00el/\n            Content: egg for reference\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 95 ===\n            Title: What's the damage?\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/caloriecount/comments/1mkzvo3/\n            Content: A little bit crazy on the cheat meal. Hoping I didn't go past 2.4k cals but realistically id assume I'm somewhere north of 3k; 440gram ribeye sous vide; 770 grams of chicken drumsticks; protien shake, some tabouleih, sushi rice, protien shake and a slice of Matilda cake and a cookie! \n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 96 ===\n            Title: Calories in only the foreground roll?\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/caloriecount/comments/1mkztqf/\n            Content: Outside is cucumber, inside is spicy tuna and avocado. I am kind of addicted to this roll. \n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 97 ===\n            Title: How many? 1 ranch cup , and kung pao sauce cup , queso on the fries .\n            Score: 1 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/caloriecount/comments/1mkzrzy/\n            Content: No text\n\n            TOP COMMENTS:\n        ==============================", "\n            === POST 98 ===\n            Title: Calories in souvlaki meal?\n            Score: 2 upvotes\n            Total Comments: 0\n            URL: https://www.reddit.com/r/caloriecount/comments/1mkz3bw/\n            Content: This is not my photo, but I am trying to calculate how much calories this souvlaki meal would be. Im basing it in jimmy greeks dinner (850 cal), but it isnt from there so i was thinking this was around 1000 calories? Is this too much or too little?\n\n            TOP COMMENTS:\n        =============================="]